In [2]:
# import numpy
import numpy as np
# numpy array - need to pass in python list
arr = np.array([1,2,3,4,5])
# display output
arr

array([1, 2, 3, 4, 5])

In [3]:
prices = [10,20,30,40]
prices_array = np.array(prices)
prices_array

array([10, 20, 30, 40])

In [4]:
names = ['John', 'Matt', 'Rob']
names_array = np.array(names)
names_array

array(['John', 'Matt', 'Rob'], dtype='<U4')

In [5]:
names_array[0]

'John'

In [6]:
multi_array = np.array([[1,2,3],[4,5,6]])
multi_array

array([[1, 2, 3],
       [4, 5, 6]])

In [9]:
multi_array[1][2]

6

In [10]:
multi_array.ndim

2

In [11]:
names_array.ndim

1

In [13]:
names_array.dtype

dtype('<U4')

In [1]:
auto_array = np.zeros(10)
auto_array

NameError: name 'np' is not defined

In [2]:
import numpy as np
auto_array = np.zeros(10)
auto_array

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [3]:
auto_array.dtype

dtype('float64')

In [4]:
auto_array.astype(np.int64)

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [6]:
auto_array = auto_array.astype(np.int64)

In [7]:
auto_array = auto_array.astype(np.int64)
auto_array

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

In [8]:
array = np.array([1,2,3,4], dtype=np.float64)
array

array([1., 2., 3., 4.])

In [9]:
array = np.array([1,2,3,4], dtype='i')
array

array([1, 2, 3, 4], dtype=int32)

In [10]:
array.dtype

dtype('int32')

In [11]:
array = np.array([1,2,3,4], dtype='b')
array
array.dtype

dtype('int8')

In [12]:
array = np.array([1,2,3,4], dtype='u')
array
array.dtype

TypeError: data type 'u' not understood

In [13]:
array = np.array([1,2,3,4], dtype='f')
array
array.dtype

dtype('float32')

In [14]:
array = np.array([1,2,3,4], dtype='c')
array
array.dtype

dtype('S1')

In [15]:
array = np.array([1,2,3,4], dtype='m')
array
array.dtype

dtype('<m8')

In [16]:
array = np.array([1,2,3,4], dtype='M')
array
array.dtype

ValueError: Converting an integer to a NumPy datetime requires a specified unit

In [17]:
array = np.array([1,2,3,4], dtype='O')
array
array.dtype

dtype('O')

In [18]:
array = np.array([1,2,3,4], dtype='S')
array
array.dtype

dtype('S1')

In [19]:
array = np.array([1,2,3,4], dtype='U')
array
array.dtype

dtype('<U1')

In [20]:
array = np.array([1,2,3,4], dtype='V')
array
array.dtype

TypeError: A bytes-like object is required, not 'int'

In [21]:
array = np.array([1,2,3,4], dtype='S')
array

array([b'1', b'2', b'3', b'4'], dtype='|S1')

In [22]:
array = np.array([1,2,3,4], dtype=np.float64)
array
array.dtype

dtype('float64')

In [23]:
listA = [[1,2,3], [4,5,6]]
listB = [[7,8,9], [10,11,12]]
arrayA = np.array(listA)
arrayB = np.array(listB)
arrayA

array([[1, 2, 3],
       [4, 5, 6]])

In [24]:
arrayB

array([[ 7,  8,  9],
       [10, 11, 12]])

In [25]:
arrayA + arrayB

array([[ 8, 10, 12],
       [14, 16, 18]])

In [26]:
arrayB - arrayA

array([[6, 6, 6],
       [6, 6, 6]])

In [27]:
arrayA * 2

array([[ 2,  4,  6],
       [ 8, 10, 12]])

In [28]:
arrayB / 10

array([[0.7, 0.8, 0.9],
       [1. , 1.1, 1.2]])

In [29]:
arrayA * arrayB

array([[ 7, 16, 27],
       [40, 55, 72]])

In [30]:
arrayB / arrayA

array([[7. , 4. , 3. ],
       [2.5, 2.2, 2. ]])

In [31]:
arrayB ** 2

array([[ 49,  64,  81],
       [100, 121, 144]])

In [32]:
arrayA > arrayB

array([[False, False, False],
       [False, False, False]])

In [33]:
arrayA < arrayB

array([[ True,  True,  True],
       [ True,  True,  True]])

In [34]:
import numpy as np
arr = np.array([10,20,30,40,50])
arr

array([10, 20, 30, 40, 50])

In [35]:
arr[0]

10

In [36]:
arr[3]

40

In [37]:
arr = np.array([1,2,3],[4,5,6])
arr

TypeError: Field elements must be 2- or 3-tuples, got '4'

In [38]:
arr = np.array([[1,2,3],[4,5,6]])
arr

array([[1, 2, 3],
       [4, 5, 6]])

In [39]:
arr[1][2]

6

In [40]:
arr[1,2]

6

In [41]:
arr = np.array([10,20,30,40,50,60,70])
arr

array([10, 20, 30, 40, 50, 60, 70])

In [42]:
arr[1:5]

array([20, 30, 40, 50])

In [44]:
arrayM = np.array([[1,2,3],[4,5,6],[7,8,9]])
arrayM

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [45]:
arrayM[1:2]

array([[4, 5, 6]])

In [46]:
arrayM[1:3]

array([[4, 5, 6],
       [7, 8, 9]])

In [47]:
arrayM[1:3, 1:3]

array([[5, 6],
       [8, 9]])

In [48]:
arrayM[0:2, 0:2]

array([[1, 2],
       [4, 5]])

In [49]:
arrayM[:2, :2]

array([[1, 2],
       [4, 5]])

In [50]:
arrayM = np.array([[1,2,3],[4,5,6],[7,8,9]])
arrayM

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [51]:
arrayM[[0, 0, 2, 2],[0, 2, 0, 2]]

array([1, 3, 7, 9])

In [52]:
arrayM

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [53]:
arrayM[arrayM>5]

array([6, 7, 8, 9])

In [54]:
arrayM[arrayM < 7]

array([1, 2, 3, 4, 5, 6])

In [1]:
import numpy as np

In [2]:
arrayA = np.array([[1,2,3],[4,5,6],[7,8,9]])
arrayB = np.array([1,2,3])
arrayA
arrayB

array([1, 2, 3])

In [3]:
arrayA

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [4]:
arrayA + arrayB

array([[ 2,  4,  6],
       [ 5,  7,  9],
       [ 8, 10, 12]])

In [6]:
from pandas import Series
s = Series([1,3,5,7,9])
s

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [7]:
s[3]

7

In [8]:
s.values

array([1, 3, 5, 7, 9])

In [9]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
s = Series([100,200,300], index=[5,2,3])
s

5    100
2    200
3    300
dtype: int64

In [12]:
s = Series([100,200,300], index=['a','b','c'])
s

a    100
b    200
c    300
dtype: int64

In [13]:
s['c']

300

In [14]:
s = Series({'a':100, 'b':700, 'c':1400})
s

a     100
b     700
c    1400
dtype: int64

In [1]:
import numpy as np

In [3]:
from pandas import DataFrame
people = {'name':['Jim', 'Rob', 'Tom'], 'age':[22,44,55], 'location':['US', 'UK', 'AUS']}
frame = DataFrame(people, columns=['name', 'location', 'age'])
frame

  name location  age
0  Jim       US   22
1  Rob       UK   44
2  Tom      AUS   55

In [4]:
frame['location']

0     US
1     UK
2    AUS
Name: location, dtype: object

In [5]:
frame.location

0     US
1     UK
2    AUS
Name: location, dtype: object

In [6]:
frame.loc[1]

name        Rob
location     UK
age          44
Name: 1, dtype: object

In [7]:
frame

  name location  age
0  Jim       US   22
1  Rob       UK   44
2  Tom      AUS   55

frame.salary = 5000
frame

In [9]:
frame

  name location  age
0  Jim       US   22
1  Rob       UK   44
2  Tom      AUS   55

In [10]:
from pandas import DataFrame
people = {'name':['Jim', 'Rob', 'Tom'], 'age':[22,44,55], 'location':['US', 'UK', 'AUS']}
frame = DataFrame(people, columns=['name', 'location', 'age', 'salary'])
frame

  name location  age salary
0  Jim       US   22    NaN
1  Rob       UK   44    NaN
2  Tom      AUS   55    NaN

In [11]:
frame.salary = 5000
frame

  name location  age  salary
0  Jim       US   22    5000
1  Rob       UK   44    5000
2  Tom      AUS   55    5000

In [15]:
from pandas import Series
salaries = Series([1000,2000,3000])
frame.salary = salaries

In [16]:
from pandas import DataFrame
from pandas import Series
people = {'name':['Jim', 'Rob', 'Tom'], 'age':[22,44,55], 'location':['US', 'UK', 'AUS']}
frame = DataFrame(people, columns=['name', 'location', 'age', 'salary'])
salaries = Series([1000,2000,3000])
frame.salary = salaries
frame

  name location  age  salary
0  Jim       US   22    1000
1  Rob       UK   44    2000
2  Tom      AUS   55    3000

In [17]:
del frame['salary']

In [18]:
frame

  name location  age
0  Jim       US   22
1  Rob       UK   44
2  Tom      AUS   55

In [1]:
import numpy as np
from pandas import DataFrame
from pandas import Series

In [2]:
s = Series([10,20,30,40,50], index=['c','a','d','b','e'])

In [3]:
s

c    10
a    20
d    30
b    40
e    50
dtype: int64

In [4]:
s = s.reindex(['a','b','c','d','e'])
s

a    20
b    40
c    10
d    30
e    50
dtype: int64

In [8]:
d = DataFrame(np.arange(9).reshape((3,3)), index=['c','a','b'], columns=['apple','mango','banana'])
d

   apple  mango  banana
c      0      1       2
a      3      4       5
b      6      7       8

In [9]:
d.reindex(['a','b','c'])

   apple  mango  banana
a      3      4       5
b      6      7       8
c      0      1       2

In [15]:
d = d.reindex(['a','b','c'])
d.reindex(columns=['mango','banana','apple'])
d

   apple  mango  banana
a      3      4       5
b      6      7       8
c      0      1       2

In [16]:
s1 = Series([1,2,3,4,5], index=['a','b','c','d','e'])
s2 = Series([1,2,3,4,5,6,7], index=['a','b','c','d','e','f','g'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [17]:
s2

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64

In [18]:
s1 + s2

a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
f     NaN
g     NaN
dtype: float64

In [20]:
s1.add(s2,fill_value=0)

a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
f     6.0
g     7.0
dtype: float64

In [21]:
d1 = DataFrame(np.arange(12).reshape(3,4),columns=['a','b','c','d'])
d2 = DataFrame(np.arange(16).reshape(4,4),columns=['a','b','c','d'])
d1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [22]:
d2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [23]:
d1.add(d2,fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   6.0
1   8.0  10.0  12.0  14.0
2  16.0  18.0  20.0  22.0
3  12.0  13.0  14.0  15.0

In [25]:
s = Series([1,2,3,4])
d = DataFrame(np.arange(8).reshape(2,4))
s

0    1
1    2
2    3
3    4
dtype: int64

In [26]:
d

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [27]:
s+d

   0  1  2   3
0  1  3  5   7
1  5  7  9  11

In [29]:
d = DataFrame(np.arange(16).reshape(4,4))
d

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [30]:
f = lambda x: x+10
d.apply(f)

    0   1   2   3
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [31]:
f2 = lambda x: x*x
d.apply(f2)

     0    1    2    3
0    0    1    4    9
1   16   25   36   49
2   64   81  100  121
3  144  169  196  225

In [1]:
import numpy as np
from pandas import DataFrame
from pandas import Series

In [2]:
s = Series([1,2,3,4], index=['d','c','b','a'])

In [3]:
s

d    1
c    2
b    3
a    4
dtype: int64

In [4]:
s.sort_index()

a    4
b    3
c    2
d    1
dtype: int64

In [6]:
d = DataFrame(np.arange(16).reshape(4,4), index=[3,1,4,2], columns=['d','c','b','a'])
d

    d   c   b   a
3   0   1   2   3
1   4   5   6   7
4   8   9  10  11
2  12  13  14  15

In [9]:
d.sort_index(axis=1, ascending=False)

    d   c   b   a
3   0   1   2   3
1   4   5   6   7
4   8   9  10  11
2  12  13  14  15

In [10]:
prices = Series([300,200,900,500])
prices

0    300
1    200
2    900
3    500
dtype: int64

In [11]:
prices.sort_values()

1    200
0    300
3    500
2    900
dtype: int64

In [12]:
products = DataFrame({'name':['phone','laptop','tablet'],'price':[200,300, 100]})
products

     name  price
0   phone    200
1  laptop    300
2  tablet    100

In [14]:
products.sort_values(by='price',ascending=False)

     name  price
1  laptop    300
0   phone    200
2  tablet    100

In [16]:
s = Series([1,2,3,4,5], index=['a','b','c','d','a'])
s

a    1
b    2
c    3
d    4
a    5
dtype: int64

In [17]:
s.index.is_unique

False

In [18]:
products = DataFrame({'name':['phone','laptop','tablet'],'price':[200,300, 100]})
products

     name  price
0   phone    200
1  laptop    300
2  tablet    100

In [19]:
products.sum()

name     phonelaptoptablet
price                  600
dtype: object

In [20]:
products.count()

name     3
price    3
dtype: int64

In [21]:
products.describe()

       price
count    3.0
mean   200.0
std    100.0
min    100.0
25%    150.0
50%    200.0
75%    250.0
max    300.0

In [22]:
s = Series([1,2,3,np.nan,np.nan,5])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    5.0
dtype: float64

In [23]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    5.0
dtype: float64

In [24]:
data = DataFrame([[1,2,3],[np.nan,np.nan,np.nan],[2,np.nan,4],[np.nan,3,np.nan]])
data

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  NaN
2  2.0  NaN  4.0
3  NaN  3.0  NaN

In [28]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  NaN
2  2.0  NaN  4.0
3  NaN  3.0  NaN

In [29]:
data[3]=np.nan

In [30]:
data

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  NaN  NaN  NaN NaN
2  2.0  NaN  4.0 NaN
3  NaN  3.0  NaN NaN

In [31]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  NaN
2  2.0  NaN  4.0
3  NaN  3.0  NaN

In [33]:
data.fillna(12)

      0     1     2     3
0   1.0   2.0   3.0  12.0
1  12.0  12.0  12.0  12.0
2   2.0  12.0   4.0  12.0
3  12.0   3.0  12.0  12.0

In [34]:
s = Series([10,20,30,40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [35]:
s1 = Series(np.arange(10), index=[['a','a','b','b','b','c','c','d','e','e'],[1,2,1,2,3,1,2,1,1,2]])
s1

a  1    0
   2    1
b  1    2
   2    3
   3    4
c  1    5
   2    6
d  1    7
e  1    8
   2    9
dtype: int64

In [36]:
s1[b][3]

SyntaxError: invalid character '' (U+2018) (3196312590.py, line 1)

In [37]:
s1['b'][3]

4

In [38]:
s1['b'][2]

3

In [39]:
s1['e'][2]

9

In [40]:
s1.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 1),
            ('e', 1),
            ('e', 2)],
           )

In [41]:
s1['b']

1    2
2    3
3    4
dtype: int64

In [42]:
s1['a':'b']

a  1    0
   2    1
b  1    2
   2    3
   3    4
dtype: int64

In [43]:
s1.unstack()

     1    2    3
a  0.0  1.0  NaN
b  2.0  3.0  4.0
c  5.0  6.0  NaN
d  7.0  NaN  NaN
e  8.0  9.0  NaN

In [44]:
data_frame = DataFrame(np.arange(15).reshape(5,3),index=['a','b','c','d','e'])

In [45]:
data_frame

    0   1   2
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11
e  12  13  14

In [46]:
data_frame.stack()

a  0     0
   1     1
   2     2
b  0     3
   1     4
   2     5
c  0     6
   1     7
   2     8
d  0     9
   1    10
   2    11
e  0    12
   1    13
   2    14
dtype: int64

In [48]:
s = Series(data=['laptop','phone','computer','tablet'],index=[1,2,3,4])
s

0      laptop
1       phone
2    computer
3      tablet
dtype: object

In [52]:
import pandas as pd
fruit_prices = pd.read_csv('fruit_prices.csv',usecols=[1,2])
fruit_prices

                         Fruit  RetailPrice
0                       Apples       1.5193
1           Apples, applesauce       1.0660
2       Apples, ready-to-drink       0.7804
3   Apples, frozen concentrate       0.5853
4                     Apricots       2.9665
..                         ...          ...
57                 Raspberries       6.6391
58                 Raspberries       4.1877
59                Strawberries       2.5800
60                Strawberries       2.8189
61                  Watermelon       0.3604

[62 rows x 2 columns]

In [53]:
dtype(fruit_prices)

NameError: name 'dtype' is not defined

In [54]:
type(fruit_prices)

pandas.core.frame.DataFrame

In [58]:
fruit_prices = pd.read_csv('fruit_prices.csv',usecols=['Fruit']).squeeze("columns")

In [61]:
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [62]:
fruit_retailprice = pd.read_csv('fruit_prices.csv',usecols=['RetailPrice']).squeeze("columns")
fruit_retailprice

0     1.5193
1     1.0660
2     0.7804
3     0.5853
4     2.9665
       ...
57    6.6391
58    4.1877
59    2.5800
60    2.8189
61    0.3604
Name: RetailPrice, Length: 62, dtype: float64

In [1]:
import pandas as pd

In [2]:
import numpy as np
from pandas import DataFrame, Series, pd

ImportError: cannot import name 'pd' from 'pandas' (/Users/administrator/.pyenv/versions/3.10.9/lib/python3.10/site-packages/pandas/__init__.py)

In [3]:
import numpy as np
from pandas import DataFrame, Series
Import pandas as pd

SyntaxError: invalid syntax (3314628997.py, line 3)

In [4]:
import pandas as pd

In [5]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [6]:
list(fruit_retailprice)

NameError: name 'fruit_retailprice' is not defined

In [7]:
fruit_retailprice = pd.read_csv('fruit_prices.csv',usecols=['RetailPrice']).squeeze("columns")
fruit_retailprice

0     1.5193
1     1.0660
2     0.7804
3     0.5853
4     2.9665
       ...
57    6.6391
58    4.1877
59    2.5800
60    2.8189
61    0.3604
Name: RetailPrice, Length: 62, dtype: float64

In [8]:
list(fruit_retailprice)

[1.5193,
 1.066,
 0.7804,
 0.5853,
 2.9665,
 1.6905,
 2.06,
 6.6188,
 0.5249,
 3.5585,
 6.0172,
 3.6362,
 4.1739,
 3.3898,
 0.5767,
 3.4269,
 4.5257,
 1.3847,
 4.6513,
 5.5713,
 6.8371,
 1.7198,
 1.5932,
 1.1695,
 1.0415,
 1.8398,
 3.7801,
 0.9215,
 0.7119,
 0.9056,
 2.1849,
 1.1513,
 10.5527,
 1.9062,
 1.2131,
 0.9842,
 0.769,
 1.2904,
 5.5089,
 1.7167,
 2.0237,
 1.8117,
 3.3867,
 1.5865,
 1.9546,
 1.897,
 0.5685,
 1.4344,
 1.4067,
 6.6492,
 1.0288,
 0.6973,
 2.0292,
 5.7042,
 1.5522,
 2.235,
 3.122,
 6.6391,
 4.1877,
 2.58,
 2.8189,
 0.3604]

In [9]:
fruit_prices = pd.read_csv('fruit_prices.csv',usecols=['Fruit']).squeeze("columns")
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [10]:
list(fruit_prices)

['Apples',
 'Apples, applesauce',
 'Apples, ready-to-drink',
 'Apples, frozen concentrate',
 'Apricots',
 'Apricots, packed in juice',
 'Apricots, packed in syrup or water',
 'Apricots',
 'Bananas',
 'Berries, mixed',
 'Blackberries',
 'Blackberries',
 'Blueberries',
 'Blueberries',
 'Cantaloupe',
 'Cherries',
 'Cherries, packed in syrup or water',
 'Clementines',
 'Cranberries',
 'Dates',
 'Figs',
 'Fruit cocktail, packed in juice',
 'Fruit cocktail, packed in syrup or water',
 'Grapefruit',
 'Grapefruit, ready-to-drink',
 'Grapes',
 'Grapes (raisins)',
 'Grapes, ready-to-drink',
 'Grapes, frozen concentrate',
 'Honeydew',
 'Kiwi',
 'Mangoes',
 'Mangoes',
 'Nectarines',
 'Oranges',
 'Oranges, ready-to-drink',
 'Oranges, frozen concentrate',
 'Papaya',
 'Papaya',
 'Peaches',
 'Peaches, packed in juice',
 'Peaches, packed in syrup or water',
 'Peaches',
 'Pears',
 'Pears, packed in juice',
 'Pears, packed in syrup or water',
 'Pineapple',
 'Pineapple, packed in juice',
 'Pineapple, packed in syrup or water',
 'Pineapple',
 'Pineapple, ready-to-drink',
 'Pineapple, frozen concentrate',
 'Plum',
 'Plum (prunes)',
 'Plum (prune), ready-to-drink',
 'Pomegranate',
 'Pomegranate, ready-to-drink',
 'Raspberries',
 'Raspberries',
 'Strawberries',
 'Strawberries',
 'Watermelon']

In [11]:
fruit_list = list(fruit_prices)

In [12]:
for fruit in fruit_list:
    print(fruit)

Apples
Apples, applesauce
Apples, ready-to-drink
Apples, frozen concentrate
Apricots
Apricots, packed in juice
Apricots, packed in syrup or water
Apricots
Bananas
Berries, mixed
Blackberries
Blackberries
Blueberries
Blueberries
Cantaloupe
Cherries
Cherries, packed in syrup or water
Clementines
Cranberries
Dates
Figs
Fruit cocktail, packed in juice
Fruit cocktail, packed in syrup or water
Grapefruit
Grapefruit, ready-to-drink
Grapes
Grapes (raisins)
Grapes, ready-to-drink
Grapes, frozen concentrate
Honeydew
Kiwi
Mangoes
Mangoes
Nectarines
Oranges
Oranges, ready-to-drink
Oranges, frozen concentrate
Papaya
Papaya
Peaches
Peaches, packed in juice
Peaches, packed in syrup or water
Peaches
Pears
Pears, packed in juice
Pears, packed in syrup or water
Pineapple
Pineapple, packed in juice
Pineapple, packed in syrup or water
Pineapple
Pineapple, ready-to-drink
Pineapple, frozen concentrate
Plum
Plum (prunes)
Plum (prune), ready-to-drink
Pomegranate
Pomegranate, ready-to-drink
Raspberries
Raspberries
Strawberries
Strawberries
Watermelon

In [13]:
fruit_names

NameError: name 'fruit_names' is not defined

In [14]:
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [15]:
dict(fruit_prices)

{0: 'Apples',
 1: 'Apples, applesauce',
 2: 'Apples, ready-to-drink',
 3: 'Apples, frozen concentrate',
 4: 'Apricots',
 5: 'Apricots, packed in juice',
 6: 'Apricots, packed in syrup or water',
 7: 'Apricots',
 8: 'Bananas',
 9: 'Berries, mixed',
 10: 'Blackberries',
 11: 'Blackberries',
 12: 'Blueberries',
 13: 'Blueberries',
 14: 'Cantaloupe',
 15: 'Cherries',
 16: 'Cherries, packed in syrup or water',
 17: 'Clementines',
 18: 'Cranberries',
 19: 'Dates',
 20: 'Figs',
 21: 'Fruit cocktail, packed in juice',
 22: 'Fruit cocktail, packed in syrup or water',
 23: 'Grapefruit',
 24: 'Grapefruit, ready-to-drink',
 25: 'Grapes',
 26: 'Grapes (raisins)',
 27: 'Grapes, ready-to-drink',
 28: 'Grapes, frozen concentrate',
 29: 'Honeydew',
 30: 'Kiwi',
 31: 'Mangoes',
 32: 'Mangoes',
 33: 'Nectarines',
 34: 'Oranges',
 35: 'Oranges, ready-to-drink',
 36: 'Oranges, frozen concentrate',
 37: 'Papaya',
 38: 'Papaya',
 39: 'Peaches',
 40: 'Peaches, packed in juice',
 41: 'Peaches, packed in syrup or water',
 42: 'Peaches',
 43: 'Pears',
 44: 'Pears, packed in juice',
 45: 'Pears, packed in syrup or water',
 46: 'Pineapple',
 47: 'Pineapple, packed in juice',
 48: 'Pineapple, packed in syrup or water',
 49: 'Pineapple',
 50: 'Pineapple, ready-to-drink',
 51: 'Pineapple, frozen concentrate',
 52: 'Plum',
 53: 'Plum (prunes)',
 54: 'Plum (prune), ready-to-drink',
 55: 'Pomegranate',
 56: 'Pomegranate, ready-to-drink',
 57: 'Raspberries',
 58: 'Raspberries',
 59: 'Strawberries',
 60: 'Strawberries',
 61: 'Watermelon'}

In [16]:
fruit_dictionary = dict(fruit_prices)

In [17]:
fruit_dictionary

{0: 'Apples',
 1: 'Apples, applesauce',
 2: 'Apples, ready-to-drink',
 3: 'Apples, frozen concentrate',
 4: 'Apricots',
 5: 'Apricots, packed in juice',
 6: 'Apricots, packed in syrup or water',
 7: 'Apricots',
 8: 'Bananas',
 9: 'Berries, mixed',
 10: 'Blackberries',
 11: 'Blackberries',
 12: 'Blueberries',
 13: 'Blueberries',
 14: 'Cantaloupe',
 15: 'Cherries',
 16: 'Cherries, packed in syrup or water',
 17: 'Clementines',
 18: 'Cranberries',
 19: 'Dates',
 20: 'Figs',
 21: 'Fruit cocktail, packed in juice',
 22: 'Fruit cocktail, packed in syrup or water',
 23: 'Grapefruit',
 24: 'Grapefruit, ready-to-drink',
 25: 'Grapes',
 26: 'Grapes (raisins)',
 27: 'Grapes, ready-to-drink',
 28: 'Grapes, frozen concentrate',
 29: 'Honeydew',
 30: 'Kiwi',
 31: 'Mangoes',
 32: 'Mangoes',
 33: 'Nectarines',
 34: 'Oranges',
 35: 'Oranges, ready-to-drink',
 36: 'Oranges, frozen concentrate',
 37: 'Papaya',
 38: 'Papaya',
 39: 'Peaches',
 40: 'Peaches, packed in juice',
 41: 'Peaches, packed in syrup or water',
 42: 'Peaches',
 43: 'Pears',
 44: 'Pears, packed in juice',
 45: 'Pears, packed in syrup or water',
 46: 'Pineapple',
 47: 'Pineapple, packed in juice',
 48: 'Pineapple, packed in syrup or water',
 49: 'Pineapple',
 50: 'Pineapple, ready-to-drink',
 51: 'Pineapple, frozen concentrate',
 52: 'Plum',
 53: 'Plum (prunes)',
 54: 'Plum (prune), ready-to-drink',
 55: 'Pomegranate',
 56: 'Pomegranate, ready-to-drink',
 57: 'Raspberries',
 58: 'Raspberries',
 59: 'Strawberries',
 60: 'Strawberries',
 61: 'Watermelon'}

In [18]:
fruit_dictionary[5]

'Apricots, packed in juice'

In [19]:
type(fruit_prices)

pandas.core.series.Series

In [20]:
type(fruit_dictionary)

dict

In [21]:
sorted(fruit_prices)

['Apples',
 'Apples, applesauce',
 'Apples, frozen concentrate',
 'Apples, ready-to-drink',
 'Apricots',
 'Apricots',
 'Apricots, packed in juice',
 'Apricots, packed in syrup or water',
 'Bananas',
 'Berries, mixed',
 'Blackberries',
 'Blackberries',
 'Blueberries',
 'Blueberries',
 'Cantaloupe',
 'Cherries',
 'Cherries, packed in syrup or water',
 'Clementines',
 'Cranberries',
 'Dates',
 'Figs',
 'Fruit cocktail, packed in juice',
 'Fruit cocktail, packed in syrup or water',
 'Grapefruit',
 'Grapefruit, ready-to-drink',
 'Grapes',
 'Grapes (raisins)',
 'Grapes, frozen concentrate',
 'Grapes, ready-to-drink',
 'Honeydew',
 'Kiwi',
 'Mangoes',
 'Mangoes',
 'Nectarines',
 'Oranges',
 'Oranges, frozen concentrate',
 'Oranges, ready-to-drink',
 'Papaya',
 'Papaya',
 'Peaches',
 'Peaches',
 'Peaches, packed in juice',
 'Peaches, packed in syrup or water',
 'Pears',
 'Pears, packed in juice',
 'Pears, packed in syrup or water',
 'Pineapple',
 'Pineapple',
 'Pineapple, frozen concentrate',
 'Pineapple, packed in juice',
 'Pineapple, packed in syrup or water',
 'Pineapple, ready-to-drink',
 'Plum',
 'Plum (prune), ready-to-drink',
 'Plum (prunes)',
 'Pomegranate',
 'Pomegranate, ready-to-drink',
 'Raspberries',
 'Raspberries',
 'Strawberries',
 'Strawberries',
 'Watermelon']

In [22]:
sorted(fruit_retailprice)

[0.3604,
 0.5249,
 0.5685,
 0.5767,
 0.5853,
 0.6973,
 0.7119,
 0.769,
 0.7804,
 0.9056,
 0.9215,
 0.9842,
 1.0288,
 1.0415,
 1.066,
 1.1513,
 1.1695,
 1.2131,
 1.2904,
 1.3847,
 1.4067,
 1.4344,
 1.5193,
 1.5522,
 1.5865,
 1.5932,
 1.6905,
 1.7167,
 1.7198,
 1.8117,
 1.8398,
 1.897,
 1.9062,
 1.9546,
 2.0237,
 2.0292,
 2.06,
 2.1849,
 2.235,
 2.58,
 2.8189,
 2.9665,
 3.122,
 3.3867,
 3.3898,
 3.4269,
 3.5585,
 3.6362,
 3.7801,
 4.1739,
 4.1877,
 4.5257,
 4.6513,
 5.5089,
 5.5713,
 5.7042,
 6.0172,
 6.6188,
 6.6391,
 6.6492,
 6.8371,
 10.5527]

In [25]:
"Apples" in fruit_prices.values

True

In [26]:
s = Series([10,20,30,40], index=['a','b','c','d'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [27]:
s['c']

30

In [28]:
s['a':'c']

a    10
b    20
c    30
dtype: int64

In [29]:
s

a    10
b    20
c    30
d    40
dtype: int64

In [30]:
s[2]

/var/folders/bv/dtkgtzxx4654_5b6ys39vyrh0000gn/T/ipykernel_16898/2635755408.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[2]

30

In [31]:
s.iloc[2]

30

In [32]:
s

a    10
b    20
c    30
d    40
dtype: int64

In [34]:
s[0:3]

a    10
b    20
c    30
dtype: int64

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
s = Series([10,20,30,40], index=['a','b','c','d'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [3]:
s.iloc[0:3]

a    10
b    20
c    30
dtype: int64

In [5]:
s[s<20]

a    10
dtype: int64

In [6]:
s

a    10
b    20
c    30
d    40
dtype: int64

In [7]:
s[['a','c']]

a    10
c    30
dtype: int64

In [8]:
s[[0,2,3]]

/var/folders/bv/dtkgtzxx4654_5b6ys39vyrh0000gn/T/ipykernel_16226/3564952764.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[0,2,3]]

a    10
c    30
d    40
dtype: int64

In [9]:
s.iloc[[0,2,3]]

a    10
c    30
d    40
dtype: int64

In [10]:
fruit_prices

NameError: name 'fruit_prices' is not defined

In [11]:
fruit_prices = pd.read_csv('fruit_prices.csv',usecols=['Fruit']).squeeze("columns")
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [12]:
fruit_dictionary = dict(fruit_prices)
fruit_dictionary

{0: 'Apples',
 1: 'Apples, applesauce',
 2: 'Apples, ready-to-drink',
 3: 'Apples, frozen concentrate',
 4: 'Apricots',
 5: 'Apricots, packed in juice',
 6: 'Apricots, packed in syrup or water',
 7: 'Apricots',
 8: 'Bananas',
 9: 'Berries, mixed',
 10: 'Blackberries',
 11: 'Blackberries',
 12: 'Blueberries',
 13: 'Blueberries',
 14: 'Cantaloupe',
 15: 'Cherries',
 16: 'Cherries, packed in syrup or water',
 17: 'Clementines',
 18: 'Cranberries',
 19: 'Dates',
 20: 'Figs',
 21: 'Fruit cocktail, packed in juice',
 22: 'Fruit cocktail, packed in syrup or water',
 23: 'Grapefruit',
 24: 'Grapefruit, ready-to-drink',
 25: 'Grapes',
 26: 'Grapes (raisins)',
 27: 'Grapes, ready-to-drink',
 28: 'Grapes, frozen concentrate',
 29: 'Honeydew',
 30: 'Kiwi',
 31: 'Mangoes',
 32: 'Mangoes',
 33: 'Nectarines',
 34: 'Oranges',
 35: 'Oranges, ready-to-drink',
 36: 'Oranges, frozen concentrate',
 37: 'Papaya',
 38: 'Papaya',
 39: 'Peaches',
 40: 'Peaches, packed in juice',
 41: 'Peaches, packed in syrup or water',
 42: 'Peaches',
 43: 'Pears',
 44: 'Pears, packed in juice',
 45: 'Pears, packed in syrup or water',
 46: 'Pineapple',
 47: 'Pineapple, packed in juice',
 48: 'Pineapple, packed in syrup or water',
 49: 'Pineapple',
 50: 'Pineapple, ready-to-drink',
 51: 'Pineapple, frozen concentrate',
 52: 'Plum',
 53: 'Plum (prunes)',
 54: 'Plum (prune), ready-to-drink',
 55: 'Pomegranate',
 56: 'Pomegranate, ready-to-drink',
 57: 'Raspberries',
 58: 'Raspberries',
 59: 'Strawberries',
 60: 'Strawberries',
 61: 'Watermelon'}

In [13]:
fruit_retailprice = pd.read_csv('fruit_prices.csv',usecols=['RetailPrice']).squeeze("columns")
fruit_retailprice

0     1.5193
1     1.0660
2     0.7804
3     0.5853
4     2.9665
       ...
57    6.6391
58    4.1877
59    2.5800
60    2.8189
61    0.3604
Name: RetailPrice, Length: 62, dtype: float64

In [14]:
fruit_prices[4]

'Apricots'

In [15]:
fruit_prices[[0,1,2,3,4]]

0                        Apples
1            Apples, applesauce
2        Apples, ready-to-drink
3    Apples, frozen concentrate
4                      Apricots
Name: Fruit, dtype: object

In [16]:
fruit_prices[[10:20]]

SyntaxError: invalid syntax (1676399437.py, line 1)

In [18]:
fruit_prices[10:21]

10                          Blackberries
11                          Blackberries
12                           Blueberries
13                           Blueberries
14                            Cantaloupe
15                              Cherries
16    Cherries, packed in syrup or water
17                           Clementines
18                           Cranberries
19                                 Dates
20                                  Figs
Name: Fruit, dtype: object

In [19]:
fruit_prices[0]

'Apples'

In [20]:
fruit_prices.iloc[0]

'Apples'

In [21]:
fruits = Series(['Apple', 'Mango', 'Orange'], index=[1,2,3])
fruits

1     Apple
2     Mango
3    Orange
dtype: object

In [22]:
fruits[1]

'Apple'

In [23]:
fruits.iloc[1]

'Mango'

In [25]:
fruit_prices.iloc[[1,2,3,4]]

1            Apples, applesauce
2        Apples, ready-to-drink
3    Apples, frozen concentrate
4                      Apricots
Name: Fruit, dtype: object

In [27]:
fruit_prices.iloc[:10]

0                                Apples
1                    Apples, applesauce
2                Apples, ready-to-drink
3            Apples, frozen concentrate
4                              Apricots
5             Apricots, packed in juice
6    Apricots, packed in syrup or water
7                              Apricots
8                               Bananas
9                        Berries, mixed
Name: Fruit, dtype: object

In [28]:
fruit_prices.iloc[10]

'Blackberries'

In [29]:
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [30]:
fruit_prices.iloc[100]

IndexError: single positional indexer is out-of-bounds

In [31]:
fruit_prices.get(10)

'Blackberries'

In [32]:
fruit_prices.get(100)

In [33]:
fruit_prices.get(100,"Generic Fruit")

'Generic Fruit'

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
fruit_prices = pd.read_csv('fruit_prices.csv',usecols=['Fruit']).squeeze("columns")
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [3]:
fruit_retailprice = pd.read_csv('fruit_prices.csv',usecols=['RetailPrice']).squeeze("columns")
fruit_retailprice

0     1.5193
1     1.0660
2     0.7804
3     0.5853
4     2.9665
       ...
57    6.6391
58    4.1877
59    2.5800
60    2.8189
61    0.3604
Name: RetailPrice, Length: 62, dtype: float64

In [4]:
fruit_dictionary = dict(fruit_prices)
fruit_dictionary

{0: 'Apples',
 1: 'Apples, applesauce',
 2: 'Apples, ready-to-drink',
 3: 'Apples, frozen concentrate',
 4: 'Apricots',
 5: 'Apricots, packed in juice',
 6: 'Apricots, packed in syrup or water',
 7: 'Apricots',
 8: 'Bananas',
 9: 'Berries, mixed',
 10: 'Blackberries',
 11: 'Blackberries',
 12: 'Blueberries',
 13: 'Blueberries',
 14: 'Cantaloupe',
 15: 'Cherries',
 16: 'Cherries, packed in syrup or water',
 17: 'Clementines',
 18: 'Cranberries',
 19: 'Dates',
 20: 'Figs',
 21: 'Fruit cocktail, packed in juice',
 22: 'Fruit cocktail, packed in syrup or water',
 23: 'Grapefruit',
 24: 'Grapefruit, ready-to-drink',
 25: 'Grapes',
 26: 'Grapes (raisins)',
 27: 'Grapes, ready-to-drink',
 28: 'Grapes, frozen concentrate',
 29: 'Honeydew',
 30: 'Kiwi',
 31: 'Mangoes',
 32: 'Mangoes',
 33: 'Nectarines',
 34: 'Oranges',
 35: 'Oranges, ready-to-drink',
 36: 'Oranges, frozen concentrate',
 37: 'Papaya',
 38: 'Papaya',
 39: 'Peaches',
 40: 'Peaches, packed in juice',
 41: 'Peaches, packed in syrup or water',
 42: 'Peaches',
 43: 'Pears',
 44: 'Pears, packed in juice',
 45: 'Pears, packed in syrup or water',
 46: 'Pineapple',
 47: 'Pineapple, packed in juice',
 48: 'Pineapple, packed in syrup or water',
 49: 'Pineapple',
 50: 'Pineapple, ready-to-drink',
 51: 'Pineapple, frozen concentrate',
 52: 'Plum',
 53: 'Plum (prunes)',
 54: 'Plum (prune), ready-to-drink',
 55: 'Pomegranate',
 56: 'Pomegranate, ready-to-drink',
 57: 'Raspberries',
 58: 'Raspberries',
 59: 'Strawberries',
 60: 'Strawberries',
 61: 'Watermelon'}

In [5]:
fruit_prices[0] = "Oranges"

In [6]:
fruit_prices

0                        Oranges
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [7]:
fruit_prices[0] = "Apples"

In [8]:
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [9]:
fruit_prices.iloc[0] = "Oranges"
fruit_prices

0                        Oranges
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [10]:
fruit_prices.iloc[[1,2,3]] = ["Peaches","Pineapples","Watermelons"]
fruit_prices

0          Oranges
1          Peaches
2       Pineapples
3      Watermelons
4         Apricots
          ...
57     Raspberries
58     Raspberries
59    Strawberries
60    Strawberries
61      Watermelon
Name: Fruit, Length: 62, dtype: object

In [11]:
fruit_prices.iloc[[0,1,2,3]] = ["Apples","Apples, applesauce","Apples, ready-to-drink","Apples, frozen concentrate"]
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [12]:
s = pd.Series([10,20,30,40], index=['apple','banana','cherry','date'])
s

apple     10
banana    20
cherry    30
date      40
dtype: int64

In [14]:
s.loc['banana'] = 200
s

apple      10
banana    200
cherry     30
date       40
dtype: int64

In [15]:
s.loc[['apple','cherry',]] = [1,3]
s

apple       1
banana    200
cherry      3
date       40
dtype: int64

In [16]:
s

apple       1
banana    200
cherry      3
date       40
dtype: int64

In [17]:
s.loc['banana':'date'] = [25,35,45]
s

apple      1
banana    25
cherry    35
date      45
dtype: int64

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
fruit_prices = pd.read_csv('fruit_prices.csv',usecols=['Fruit']).squeeze("columns")
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [3]:
fruit_retailprice = pd.read_csv('fruit_prices.csv',usecols=['RetailPrice']).squeeze("columns")
fruit_retailprice

0     1.5193
1     1.0660
2     0.7804
3     0.5853
4     2.9665
       ...
57    6.6391
58    4.1877
59    2.5800
60    2.8189
61    0.3604
Name: RetailPrice, Length: 62, dtype: float64

In [4]:
fruit_dictionary = dict(fruit_prices)
fruit_dictionary

{0: 'Apples',
 1: 'Apples, applesauce',
 2: 'Apples, ready-to-drink',
 3: 'Apples, frozen concentrate',
 4: 'Apricots',
 5: 'Apricots, packed in juice',
 6: 'Apricots, packed in syrup or water',
 7: 'Apricots',
 8: 'Bananas',
 9: 'Berries, mixed',
 10: 'Blackberries',
 11: 'Blackberries',
 12: 'Blueberries',
 13: 'Blueberries',
 14: 'Cantaloupe',
 15: 'Cherries',
 16: 'Cherries, packed in syrup or water',
 17: 'Clementines',
 18: 'Cranberries',
 19: 'Dates',
 20: 'Figs',
 21: 'Fruit cocktail, packed in juice',
 22: 'Fruit cocktail, packed in syrup or water',
 23: 'Grapefruit',
 24: 'Grapefruit, ready-to-drink',
 25: 'Grapes',
 26: 'Grapes (raisins)',
 27: 'Grapes, ready-to-drink',
 28: 'Grapes, frozen concentrate',
 29: 'Honeydew',
 30: 'Kiwi',
 31: 'Mangoes',
 32: 'Mangoes',
 33: 'Nectarines',
 34: 'Oranges',
 35: 'Oranges, ready-to-drink',
 36: 'Oranges, frozen concentrate',
 37: 'Papaya',
 38: 'Papaya',
 39: 'Peaches',
 40: 'Peaches, packed in juice',
 41: 'Peaches, packed in syrup or water',
 42: 'Peaches',
 43: 'Pears',
 44: 'Pears, packed in juice',
 45: 'Pears, packed in syrup or water',
 46: 'Pineapple',
 47: 'Pineapple, packed in juice',
 48: 'Pineapple, packed in syrup or water',
 49: 'Pineapple',
 50: 'Pineapple, ready-to-drink',
 51: 'Pineapple, frozen concentrate',
 52: 'Plum',
 53: 'Plum (prunes)',
 54: 'Plum (prune), ready-to-drink',
 55: 'Pomegranate',
 56: 'Pomegranate, ready-to-drink',
 57: 'Raspberries',
 58: 'Raspberries',
 59: 'Strawberries',
 60: 'Strawberries',
 61: 'Watermelon'}

In [5]:
s = pd.Series([10,20,30,40], index=['apple','banana','cherry','date'])
s

apple     10
banana    20
cherry    30
date      40
dtype: int64

In [6]:
s.loc['banana'] = 200
s

apple      10
banana    200
cherry     30
date       40
dtype: int64

In [7]:
s.loc[['apple','cherry',]] = [1,3]
s

apple       1
banana    200
cherry      3
date       40
dtype: int64

In [8]:
s.loc['banana':'date'] = [25,35,45]
s

apple      1
banana    25
cherry    35
date      45
dtype: int64

In [9]:
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [10]:
fruit_prices.value_counts()

Fruit
Papaya                                      2
Blackberries                                2
Mangoes                                     2
Peaches                                     2
Blueberries                                 2
Pineapple                                   2
Apricots                                    2
Raspberries                                 2
Strawberries                                2
Oranges, ready-to-drink                     1
Oranges, frozen concentrate                 1
Pears, packed in juice                      1
Oranges                                     1
Peaches, packed in juice                    1
Peaches, packed in syrup or water           1
Pears                                       1
Apples                                      1
Pineapple, packed in syrup or water         1
Pears, packed in syrup or water             1
Pineapple, packed in juice                  1
Pineapple, ready-to-drink                   1
Pineapple, frozen concentrate               1
Plum                                        1
Plum (prunes)                               1
Plum (prune), ready-to-drink                1
Pomegranate                                 1
Pomegranate, ready-to-drink                 1
Nectarines                                  1
Honeydew                                    1
Kiwi                                        1
Apples, applesauce                          1
Apples, ready-to-drink                      1
Apples, frozen concentrate                  1
Apricots, packed in juice                   1
Apricots, packed in syrup or water          1
Bananas                                     1
Berries, mixed                              1
Cantaloupe                                  1
Cherries                                    1
Cherries, packed in syrup or water          1
Clementines                                 1
Cranberries                                 1
Dates                                       1
Figs                                        1
Fruit cocktail, packed in juice             1
Fruit cocktail, packed in syrup or water    1
Grapefruit                                  1
Grapefruit, ready-to-drink                  1
Grapes                                      1
Grapes (raisins)                            1
Grapes, ready-to-drink                      1
Grapes, frozen concentrate                  1
Watermelon                                  1
Name: count, dtype: int64

In [11]:
fruit_prices.value_counts(sort=False)

Fruit
Apples                                      1
Apples, applesauce                          1
Apples, ready-to-drink                      1
Apples, frozen concentrate                  1
Apricots                                    2
Apricots, packed in juice                   1
Apricots, packed in syrup or water          1
Bananas                                     1
Berries, mixed                              1
Blackberries                                2
Blueberries                                 2
Cantaloupe                                  1
Cherries                                    1
Cherries, packed in syrup or water          1
Clementines                                 1
Cranberries                                 1
Dates                                       1
Figs                                        1
Fruit cocktail, packed in juice             1
Fruit cocktail, packed in syrup or water    1
Grapefruit                                  1
Grapefruit, ready-to-drink                  1
Grapes                                      1
Grapes (raisins)                            1
Grapes, ready-to-drink                      1
Grapes, frozen concentrate                  1
Honeydew                                    1
Kiwi                                        1
Mangoes                                     2
Nectarines                                  1
Oranges                                     1
Oranges, ready-to-drink                     1
Oranges, frozen concentrate                 1
Papaya                                      2
Peaches                                     2
Peaches, packed in juice                    1
Peaches, packed in syrup or water           1
Pears                                       1
Pears, packed in juice                      1
Pears, packed in syrup or water             1
Pineapple                                   2
Pineapple, packed in juice                  1
Pineapple, packed in syrup or water         1
Pineapple, ready-to-drink                   1
Pineapple, frozen concentrate               1
Plum                                        1
Plum (prunes)                               1
Plum (prune), ready-to-drink                1
Pomegranate                                 1
Pomegranate, ready-to-drink                 1
Raspberries                                 2
Strawberries                                2
Watermelon                                  1
Name: count, dtype: int64

In [12]:
fruit_prices.value_counts(ascending=True)

Fruit
Apples                                      1
Grapes, frozen concentrate                  1
Kiwi                                        1
Nectarines                                  1
Oranges                                     1
Oranges, ready-to-drink                     1
Oranges, frozen concentrate                 1
Peaches, packed in juice                    1
Peaches, packed in syrup or water           1
Pears                                       1
Grapes, ready-to-drink                      1
Pears, packed in juice                      1
Pineapple, packed in juice                  1
Pineapple, packed in syrup or water         1
Pineapple, ready-to-drink                   1
Pineapple, frozen concentrate               1
Plum                                        1
Plum (prunes)                               1
Plum (prune), ready-to-drink                1
Pomegranate                                 1
Pomegranate, ready-to-drink                 1
Pears, packed in syrup or water             1
Grapes (raisins)                            1
Honeydew                                    1
Grapefruit, ready-to-drink                  1
Apples, applesauce                          1
Apples, ready-to-drink                      1
Apples, frozen concentrate                  1
Apricots, packed in juice                   1
Apricots, packed in syrup or water          1
Bananas                                     1
Berries, mixed                              1
Grapes                                      1
Cherries                                    1
Cherries, packed in syrup or water          1
Cantaloupe                                  1
Fruit cocktail, packed in juice             1
Grapefruit                                  1
Fruit cocktail, packed in syrup or water    1
Clementines                                 1
Figs                                        1
Dates                                       1
Watermelon                                  1
Cranberries                                 1
Pineapple                                   2
Blueberries                                 2
Mangoes                                     2
Apricots                                    2
Strawberries                                2
Papaya                                      2
Raspberries                                 2
Blackberries                                2
Peaches                                     2
Name: count, dtype: int64

In [13]:
fruit_prices.value_counts(normalize=True)

Fruit
Papaya                                      0.032258
Blackberries                                0.032258
Mangoes                                     0.032258
Peaches                                     0.032258
Blueberries                                 0.032258
Pineapple                                   0.032258
Apricots                                    0.032258
Raspberries                                 0.032258
Strawberries                                0.032258
Oranges, ready-to-drink                     0.016129
Oranges, frozen concentrate                 0.016129
Pears, packed in juice                      0.016129
Oranges                                     0.016129
Peaches, packed in juice                    0.016129
Peaches, packed in syrup or water           0.016129
Pears                                       0.016129
Apples                                      0.016129
Pineapple, packed in syrup or water         0.016129
Pears, packed in syrup or water             0.016129
Pineapple, packed in juice                  0.016129
Pineapple, ready-to-drink                   0.016129
Pineapple, frozen concentrate               0.016129
Plum                                        0.016129
Plum (prunes)                               0.016129
Plum (prune), ready-to-drink                0.016129
Pomegranate                                 0.016129
Pomegranate, ready-to-drink                 0.016129
Nectarines                                  0.016129
Honeydew                                    0.016129
Kiwi                                        0.016129
Apples, applesauce                          0.016129
Apples, ready-to-drink                      0.016129
Apples, frozen concentrate                  0.016129
Apricots, packed in juice                   0.016129
Apricots, packed in syrup or water          0.016129
Bananas                                     0.016129
Berries, mixed                              0.016129
Cantaloupe                                  0.016129
Cherries                                    0.016129
Cherries, packed in syrup or water          0.016129
Clementines                                 0.016129
Cranberries                                 0.016129
Dates                                       0.016129
Figs                                        0.016129
Fruit cocktail, packed in juice             0.016129
Fruit cocktail, packed in syrup or water    0.016129
Grapefruit                                  0.016129
Grapefruit, ready-to-drink                  0.016129
Grapes                                      0.016129
Grapes (raisins)                            0.016129
Grapes, ready-to-drink                      0.016129
Grapes, frozen concentrate                  0.016129
Watermelon                                  0.016129
Name: proportion, dtype: float64

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
fruit_prices = pd.read_csv('fruit_prices.csv',usecols=['Fruit']).squeeze("columns")
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [3]:
fruit_retailprice = pd.read_csv('fruit_prices.csv',usecols=['RetailPrice']).squeeze("columns")
fruit_retailprice

0     1.5193
1     1.0660
2     0.7804
3     0.5853
4     2.9665
       ...
57    6.6391
58    4.1877
59    2.5800
60    2.8189
61    0.3604
Name: RetailPrice, Length: 62, dtype: float64

In [4]:
fruit_dictionary = dict(fruit_prices)
fruit_dictionary

{0: 'Apples',
 1: 'Apples, applesauce',
 2: 'Apples, ready-to-drink',
 3: 'Apples, frozen concentrate',
 4: 'Apricots',
 5: 'Apricots, packed in juice',
 6: 'Apricots, packed in syrup or water',
 7: 'Apricots',
 8: 'Bananas',
 9: 'Berries, mixed',
 10: 'Blackberries',
 11: 'Blackberries',
 12: 'Blueberries',
 13: 'Blueberries',
 14: 'Cantaloupe',
 15: 'Cherries',
 16: 'Cherries, packed in syrup or water',
 17: 'Clementines',
 18: 'Cranberries',
 19: 'Dates',
 20: 'Figs',
 21: 'Fruit cocktail, packed in juice',
 22: 'Fruit cocktail, packed in syrup or water',
 23: 'Grapefruit',
 24: 'Grapefruit, ready-to-drink',
 25: 'Grapes',
 26: 'Grapes (raisins)',
 27: 'Grapes, ready-to-drink',
 28: 'Grapes, frozen concentrate',
 29: 'Honeydew',
 30: 'Kiwi',
 31: 'Mangoes',
 32: 'Mangoes',
 33: 'Nectarines',
 34: 'Oranges',
 35: 'Oranges, ready-to-drink',
 36: 'Oranges, frozen concentrate',
 37: 'Papaya',
 38: 'Papaya',
 39: 'Peaches',
 40: 'Peaches, packed in juice',
 41: 'Peaches, packed in syrup or water',
 42: 'Peaches',
 43: 'Pears',
 44: 'Pears, packed in juice',
 45: 'Pears, packed in syrup or water',
 46: 'Pineapple',
 47: 'Pineapple, packed in juice',
 48: 'Pineapple, packed in syrup or water',
 49: 'Pineapple',
 50: 'Pineapple, ready-to-drink',
 51: 'Pineapple, frozen concentrate',
 52: 'Plum',
 53: 'Plum (prunes)',
 54: 'Plum (prune), ready-to-drink',
 55: 'Pomegranate',
 56: 'Pomegranate, ready-to-drink',
 57: 'Raspberries',
 58: 'Raspberries',
 59: 'Strawberries',
 60: 'Strawberries',
 61: 'Watermelon'}

In [5]:
s = pd.Series([10,20,30,40], index=['apple','banana','cherry','date'])
s

apple     10
banana    20
cherry    30
date      40
dtype: int64

In [6]:
prices = [100,200,300,400,500]
prices_series = pd.Series(prices)

In [7]:
prices_series

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [8]:
def summer_discount(x):
    return x - (x*0.1)

In [9]:
prices_series.apply(summer_discount)

0     90.0
1    180.0
2    270.0
3    360.0
4    450.0
dtype: float64

In [13]:
scores = pd.Series([56,78,91,34,98,23,43,59])
def pass_or_fail(num):
    if num > 35:
        return "You passed!"
    else:
        return "Fail"
result = scores.apply(pass_or_fail)
result

0    You passed!
1    You passed!
2    You passed!
3           Fail
4    You passed!
5           Fail
6    You passed!
7    You passed!
dtype: object

In [14]:
result.value_counts()

You passed!    6
Fail           2
Name: count, dtype: int64

In [15]:
result.value_counts(normalize=True)

You passed!    0.75
Fail           0.25
Name: proportion, dtype: float64

In [16]:
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [17]:
fruit_prices.apply(len)

0      6
1     18
2     22
3     26
4      8
      ..
57    11
58    11
59    12
60    12
61    10
Name: Fruit, Length: 62, dtype: int64

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [3]:
fruit_names = pd.read_csv('fruit_prices.csv',usecols=['Fruit']).squeeze("columns")
fruit_names

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [4]:
fruit_retailprice = pd.read_csv('fruit_prices.csv',usecols=['RetailPrice']).squeeze("columns")
fruit_retailprice

0     1.5193
1     1.0660
2     0.7804
3     0.5853
4     2.9665
       ...
57    6.6391
58    4.1877
59    2.5800
60    2.8189
61    0.3604
Name: RetailPrice, Length: 62, dtype: float64

In [5]:
fruit_prices = pd.read_csv('fruit_prices.csv',usecols=['Fruit']).squeeze("columns")
fruit_prices

0                         Apples
1             Apples, applesauce
2         Apples, ready-to-drink
3     Apples, frozen concentrate
4                       Apricots
                 ...
57                   Raspberries
58                   Raspberries
59                  Strawberries
60                  Strawberries
61                    Watermelon
Name: Fruit, Length: 62, dtype: object

In [6]:
fruit_dictionary = dict(fruit_prices)
fruit_dictionary

{0: 'Apples',
 1: 'Apples, applesauce',
 2: 'Apples, ready-to-drink',
 3: 'Apples, frozen concentrate',
 4: 'Apricots',
 5: 'Apricots, packed in juice',
 6: 'Apricots, packed in syrup or water',
 7: 'Apricots',
 8: 'Bananas',
 9: 'Berries, mixed',
 10: 'Blackberries',
 11: 'Blackberries',
 12: 'Blueberries',
 13: 'Blueberries',
 14: 'Cantaloupe',
 15: 'Cherries',
 16: 'Cherries, packed in syrup or water',
 17: 'Clementines',
 18: 'Cranberries',
 19: 'Dates',
 20: 'Figs',
 21: 'Fruit cocktail, packed in juice',
 22: 'Fruit cocktail, packed in syrup or water',
 23: 'Grapefruit',
 24: 'Grapefruit, ready-to-drink',
 25: 'Grapes',
 26: 'Grapes (raisins)',
 27: 'Grapes, ready-to-drink',
 28: 'Grapes, frozen concentrate',
 29: 'Honeydew',
 30: 'Kiwi',
 31: 'Mangoes',
 32: 'Mangoes',
 33: 'Nectarines',
 34: 'Oranges',
 35: 'Oranges, ready-to-drink',
 36: 'Oranges, frozen concentrate',
 37: 'Papaya',
 38: 'Papaya',
 39: 'Peaches',
 40: 'Peaches, packed in juice',
 41: 'Peaches, packed in syrup or water',
 42: 'Peaches',
 43: 'Pears',
 44: 'Pears, packed in juice',
 45: 'Pears, packed in syrup or water',
 46: 'Pineapple',
 47: 'Pineapple, packed in juice',
 48: 'Pineapple, packed in syrup or water',
 49: 'Pineapple',
 50: 'Pineapple, ready-to-drink',
 51: 'Pineapple, frozen concentrate',
 52: 'Plum',
 53: 'Plum (prunes)',
 54: 'Plum (prune), ready-to-drink',
 55: 'Pomegranate',
 56: 'Pomegranate, ready-to-drink',
 57: 'Raspberries',
 58: 'Raspberries',
 59: 'Strawberries',
 60: 'Strawberries',
 61: 'Watermelon'}

In [7]:
s = pd.Series([10,20,30,40], index=['apple','banana','cherry','date'])
s

apple     10
banana    20
cherry    30
date      40
dtype: int64

In [8]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [9]:
s

apple     10
banana    20
cherry    30
date      40
dtype: int64

In [10]:
prices = [100,200,300,400,500]
prices_series = pd.Series(prices)
prices_series

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [12]:
def summer_discount(x):
    return x - (x*0.1)  
prices_series.apply(summer_discount)

0     90.0
1    180.0
2    270.0
3    360.0
4    450.0
dtype: float64

In [13]:
scores = pd.Series([56,78,91,34,98,23,43,59])
def pass_or_fail(num):
    if num > 35:
        return "You passed!"
    else:
        return "Fail"
result = scores.apply(pass_or_fail)
result

0    You passed!
1    You passed!
2    You passed!
3           Fail
4    You passed!
5           Fail
6    You passed!
7    You passed!
dtype: object

In [14]:
fruit_prices.apply(len)

0      6
1     18
2     22
3     26
4      8
      ..
57    11
58    11
59    12
60    12
61    10
Name: Fruit, Length: 62, dtype: int64

In [15]:
stock_symbols = {"Acme Corp":"ACMC","Anton Computers":"ANT", "Maximo Construction":"MCX"}
stock_prices = {"ACMC":29,"MCX":15,"ANT":48}
symbol_series = Series(stock_symbols)
prices_series = Series(stock_prices)
symbol_series

Acme Corp              ACMC
Anton Computers         ANT
Maximo Construction     MCX
dtype: object

In [16]:
prices_series

ACMC    29
MCX     15
ANT     48
dtype: int64

In [17]:
symbol_series.map(prices_series)

Acme Corp              29
Anton Computers        48
Maximo Construction    15
dtype: int64

In [20]:
data = pd.read_csv('data_cleaned_2021.csv')
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [23]:
data = data.set_index('index')

In [24]:
data

,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
index,,,,,,,,,,,,,,,,,,,,,
0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,Company - Private,...,0,0,1,1,0,0,0,data scientist,na,M
1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,Other Organization,...,0,0,0,0,0,0,0,data scientist,na,M
2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,Company - Private,...,0,0,0,0,0,0,0,data scientist,na,M
3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,Government,...,0,0,0,0,0,0,0,data scientist,na,na
4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,Company - Private,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,Company - Public,...,0,0,0,0,0,0,0,other scientist,sr,M
951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,Company - Public,...,0,1,0,0,0,0,0,data engineer,sr,na
952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,College / University,...,0,0,0,0,0,0,0,other scientist,na,P
953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,Company - Private,...,0,0,0,0,0,0,0,data scientist,na,na
955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,Nonprofit Organization,...,0,0,0,0,0,0,0,other scientist,na,M

In [25]:
data.index.name="Job ID"

In [26]:
data

,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
Job ID,,,,,,,,,,,,,,,,,,,,,
0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,Company - Private,...,0,0,1,1,0,0,0,data scientist,na,M
1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,Other Organization,...,0,0,0,0,0,0,0,data scientist,na,M
2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,Company - Private,...,0,0,0,0,0,0,0,data scientist,na,M
3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,Government,...,0,0,0,0,0,0,0,data scientist,na,na
4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,Company - Private,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,Company - Public,...,0,0,0,0,0,0,0,other scientist,sr,M
951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,Company - Public,...,0,1,0,0,0,0,0,data engineer,sr,na
952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,College / University,...,0,0,0,0,0,0,0,other scientist,na,P
953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,Company - Private,...,0,0,0,0,0,0,0,data scientist,na,na
955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,Nonprofit Organization,...,0,0,0,0,0,0,0,other scientist,na,M

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
stock_symbols = {"Acme Corp":"ACMC","Anton Computers":"ANT", "Maximo Construction":"MCX"}
stock_prices = {"ACMC":29,"MCX":15,"ANT":48}
symbol_series = Series(stock_symbols)
prices_series = Series(stock_prices)
symbol_series

Acme Corp              ACMC
Anton Computers         ANT
Maximo Construction     MCX
dtype: object

In [3]:
symbol_series.map(prices_series)

Acme Corp              29
Anton Computers        48
Maximo Construction    15
dtype: int64

In [4]:
data = pd.read_csv('data_cleaned_2021.csv')
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [5]:
data.index.name="Job ID"
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
stock_symbols = {"Acme Corp":"ACMC","Anton Computers":"ANT", "Maximo Construction":"MCX"}
stock_prices = {"ACMC":29,"MCX":15,"ANT":48}
symbol_series = Series(stock_symbols)
prices_series = Series(stock_prices)
symbol_series

Acme Corp              ACMC
Anton Computers         ANT
Maximo Construction     MCX
dtype: object

In [3]:
prices_series

ACMC    29
MCX     15
ANT     48
dtype: int64

In [4]:
symbol_series.map(prices_series)

Acme Corp              29
Anton Computers        48
Maximo Construction    15
dtype: int64

In [5]:
data = pd.read_csv('data_cleaned_2021.csv')
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [6]:
data.index.name="Job ID"
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [7]:
data.head(10)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,0,0,0,1,0,1,0,data scientist,na,na
6,6,Data Scientist,$54K-$93K (Glassdoor est.),Job Description\n\n**Please only local candida...,4.1,ClearOne Advantage\n4.1,"Baltimore, MD","Baltimore, MD",501 - 1000,2008,...,0,0,0,0,0,0,0,data scientist,na,na
7,7,Data Scientist,$86K-$142K (Glassdoor est.),Advanced Analytics Lead Data Scientist\nOver...,3.8,Logic20/20\n3.8,"San Jose, CA","Seattle, WA",201 - 500,2005,...,1,0,0,0,0,0,0,data scientist,na,M
8,8,Research Scientist,$38K-$84K (Glassdoor est.),SUMMARY\n\nThe Research Scientist I will be ta...,3.3,Rochester Regional Health\n3.3,"Rochester, NY","Rochester, NY",10000+,2014,...,0,0,0,0,0,0,0,other scientist,na,P
9,9,Data Scientist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,0,0,0,data scientist,na,na

In [8]:
data.tail()

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
Job ID,,,,,,,,,,,,,,,,,,,,,
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
stock_symbols = {"Acme Corp":"ACMC","Anton Computers":"ANT", "Maximo Construction":"MCX"}
stock_prices = {"ACMC":29,"MCX":15,"ANT":48}
symbol_series = Series(stock_symbols)
prices_series = Series(stock_prices)
symbol_series

Acme Corp              ACMC
Anton Computers         ANT
Maximo Construction     MCX
dtype: object

In [3]:
prices_series

ACMC    29
MCX     15
ANT     48
dtype: int64

In [4]:
symbol_series.map(prices_series)

Acme Corp              29
Anton Computers        48
Maximo Construction    15
dtype: int64

In [5]:
data = pd.read_csv('data_cleaned_2021.csv')
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [6]:
data.index.name="Job ID"
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [7]:
data.index

RangeIndex(start=0, stop=742, step=1, name='Job ID')

In [8]:
data.values

array([[0, 'Data Scientist', '$53K-$91K (Glassdoor est.)', ...,
        'data scientist', 'na', 'M'],
       [1, 'Healthcare Data Scientist', '$63K-$112K (Glassdoor est.)',
        ..., 'data scientist', 'na', 'M'],
       [2, 'Data Scientist', '$80K-$90K (Glassdoor est.)', ...,
        'data scientist', 'na', 'M'],
       ...,
       [952, 'Project Scientist - Auton Lab, Robotics Institute',
        '$56K-$91K (Glassdoor est.)', ..., 'other scientist', 'na', 'P'],
       [953, 'Data Science Manager', '$95K-$160K (Glassdoor est.)', ...,
        'data scientist', 'na', 'na'],
       [955, 'Research Scientist  Security and Privacy',
        '$61K-$126K (Glassdoor est.)', ..., 'other scientist', 'na', 'M']],
      dtype=object)

In [9]:
data.shape

(742, 42)

In [10]:
data.dtypes

index                   int64
Job Title              object
Salary Estimate        object
Job Description        object
Rating                float64
Company Name           object
Location               object
Headquarters           object
Size                   object
Founded                 int64
Type of ownership      object
Industry               object
Sector                 object
Revenue                object
Competitors            object
Hourly                  int64
Employer provided       int64
Lower Salary            int64
Upper Salary            int64
Avg Salary(K)         float64
company_txt            object
Job Location           object
Age                     int64
Python                  int64
spark                   int64
aws                     int64
excel                   int64
sql                     int64
sas                     int64
keras                   int64
pytorch                 int64
scikit                  int64
tensor                  int64
hadoop                  int64
tableau                 int64
bi                      int64
flink                   int64
mongo                   int64
google_an               int64
job_title_sim          object
seniority_by_title     object
Degree                 object
dtype: object

In [11]:
data.columns

Index(['index', 'Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'Hourly', 'Employer provided', 'Lower Salary', 'Upper Salary',
       'Avg Salary(K)', 'company_txt', 'Job Location', 'Age', 'Python',
       'spark', 'aws', 'excel', 'sql', 'sas', 'keras', 'pytorch', 'scikit',
       'tensor', 'hadoop', 'tableau', 'bi', 'flink', 'mongo', 'google_an',
       'job_title_sim', 'seniority_by_title', 'Degree'],
      dtype='object')

In [12]:
data.axes

[RangeIndex(start=0, stop=742, step=1, name='Job ID'),
 Index(['index', 'Job Title', 'Salary Estimate', 'Job Description', 'Rating',
        'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
        'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
        'Hourly', 'Employer provided', 'Lower Salary', 'Upper Salary',
        'Avg Salary(K)', 'company_txt', 'Job Location', 'Age', 'Python',
        'spark', 'aws', 'excel', 'sql', 'sas', 'keras', 'pytorch', 'scikit',
        'tensor', 'hadoop', 'tableau', 'bi', 'flink', 'mongo', 'google_an',
        'job_title_sim', 'seniority_by_title', 'Degree'],
       dtype='object')]

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 742 entries, 0 to 741
Data columns (total 42 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   index               742 non-null    int64
 1   Job Title           742 non-null    object
 2   Salary Estimate     742 non-null    object
 3   Job Description     742 non-null    object
 4   Rating              742 non-null    float64
 5   Company Name        742 non-null    object
 6   Location            742 non-null    object
 7   Headquarters        742 non-null    object
 8   Size                742 non-null    object
 9   Founded             742 non-null    int64
 10  Type of ownership   742 non-null    object
 11  Industry            742 non-null    object
 12  Sector              742 non-null    object
 13  Revenue             742 non-null    object
 14  Competitors         742 non-null    object
 15  Hourly              742 non-null    int64
 16  Employer provided   742 non-null    int64
 17  Lower Salary        742 non-null    int64
 18  Upper Salary        742 non-null    int64
 19  Avg Salary(K)       742 non-null    float64
 20  company_txt         742 non-null    object
 21  Job Location        742 non-null    object
 22  Age                 742 non-null    int64
 23  Python              742 non-null    int64
 24  spark               742 non-null    int64
 25  aws                 742 non-null    int64
 26  excel               742 non-null    int64
 27  sql                 742 non-null    int64
 28  sas                 742 non-null    int64
 29  keras               742 non-null    int64
 30  pytorch             742 non-null    int64
 31  scikit              742 non-null    int64
 32  tensor              742 non-null    int64
 33  hadoop              742 non-null    int64
 34  tableau             742 non-null    int64
 35  bi                  742 non-null    int64
 36  flink               742 non-null    int64
 37  mongo               742 non-null    int64
 38  google_an           742 non-null    int64
 39  job_title_sim       742 non-null    object
 40  seniority_by_title  742 non-null    object
 41  Degree              742 non-null    object
dtypes: float64(2), int64(23), object(17)
memory usage: 243.6+ KB

In [14]:
data['Salary Estimate']

Job ID
0       $53K-$91K (Glassdoor est.)
1      $63K-$112K (Glassdoor est.)
2       $80K-$90K (Glassdoor est.)
3       $56K-$97K (Glassdoor est.)
4      $86K-$143K (Glassdoor est.)
                  ...
737    $58K-$111K (Glassdoor est.)
738    $72K-$133K (Glassdoor est.)
739     $56K-$91K (Glassdoor est.)
740    $95K-$160K (Glassdoor est.)
741    $61K-$126K (Glassdoor est.)
Name: Salary Estimate, Length: 742, dtype: object

In [15]:
type(data['Salary Estimate'])

pandas.core.series.Series

In [16]:
data['Location']

Job ID
0      Albuquerque, NM
1        Linthicum, MD
2       Clearwater, FL
3         Richland, WA
4         New York, NY
            ...
737      Cambridge, MA
738      Nashville, TN
739     Pittsburgh, PA
740      Allentown, PA
741    Beavercreek, OH
Name: Location, Length: 742, dtype: object

In [18]:
data.Salary Estimate

SyntaxError: invalid syntax (1641935628.py, line 1)

In [19]:
data.Salary

AttributeError: 'DataFrame' object has no attribute 'Salary'

In [20]:
data.size

31164

In [24]:
new_data = data[['Job Title','Salary Estimate','Company Name','Location','Size']]

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('data_cleaned_2021.csv')
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [3]:
data.index.name="Job ID"
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,0,0,other scientist,sr,M
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,1,0,0,0,0,0,data engineer,sr,na
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,0,0,other scientist,na,P
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,0,0,data scientist,na,na
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,0,0,other scientist,na,M

In [4]:
new_data = data[['Job Title','Salary Estimate','Company Name','Location','Size']]

In [5]:
new_data

,Job Title,Salary Estimate,Company Name,Location,Size
Job ID,,,,,
0,Data Scientist,$53K-$91K (Glassdoor est.),Tecolote Research\n3.8,"Albuquerque, NM",501 - 1000
1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),University of Maryland Medical System\n3.4,"Linthicum, MD",10000+
2,Data Scientist,$80K-$90K (Glassdoor est.),KnowBe4\n4.8,"Clearwater, FL",501 - 1000
3,Data Scientist,$56K-$97K (Glassdoor est.),PNNL\n3.8,"Richland, WA",1001 - 5000
4,Data Scientist,$86K-$143K (Glassdoor est.),Affinity Solutions\n2.9,"New York, NY",51 - 200
...,...,...,...,...,...
737,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),GSK\n3.9,"Cambridge, MA",10000+
738,Senior Data Engineer,$72K-$133K (Glassdoor est.),Eventbrite\n4.4,"Nashville, TN",1001 - 5000
739,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),Software Engineering Institute\n2.6,"Pittsburgh, PA",501 - 1000
740,Data Science Manager,$95K-$160K (Glassdoor est.),"Numeric, LLC\n3.2","Allentown, PA",1 - 50
741,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Riverside Research Institute\n3.6,"Beavercreek, OH",501 - 1000

In [6]:
data.head()

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tensor,hadoop,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,0,0,1,1,0,0,0,data scientist,na,M
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,0,0,data scientist,na,M
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,0,0,data scientist,na,M
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,0,0,data scientist,na,na
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,0,0,data scientist,na,na

In [7]:
new_data.head()

,Job Title,Salary Estimate,Company Name,Location,Size
Job ID,,,,,
0,Data Scientist,$53K-$91K (Glassdoor est.),Tecolote Research\n3.8,"Albuquerque, NM",501 - 1000
1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),University of Maryland Medical System\n3.4,"Linthicum, MD",10000+
2,Data Scientist,$80K-$90K (Glassdoor est.),KnowBe4\n4.8,"Clearwater, FL",501 - 1000
3,Data Scientist,$56K-$97K (Glassdoor est.),PNNL\n3.8,"Richland, WA",1001 - 5000
4,Data Scientist,$86K-$143K (Glassdoor est.),Affinity Solutions\n2.9,"New York, NY",51 - 200

In [8]:
data.columns

Index(['index', 'Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'Hourly', 'Employer provided', 'Lower Salary', 'Upper Salary',
       'Avg Salary(K)', 'company_txt', 'Job Location', 'Age', 'Python',
       'spark', 'aws', 'excel', 'sql', 'sas', 'keras', 'pytorch', 'scikit',
       'tensor', 'hadoop', 'tableau', 'bi', 'flink', 'mongo', 'google_an',
       'job_title_sim', 'seniority_by_title', 'Degree'],
      dtype='object')

In [9]:
data[['Lower Salary','Upper Salary','Avg Salary(K)']]

        Lower Salary  Upper Salary  Avg Salary(K)
Job ID
0                 53            91           72.0
1                 63           112           87.5
2                 80            90           85.0
3                 56            97           76.5
4                 86           143          114.5
...              ...           ...            ...
737               58           111           84.5
738               72           133          102.5
739               56            91           73.5
740               95           160          127.5
741               61           126           93.5

[742 rows x 3 columns]

In [10]:
data['Salary Estimate'][0]

'$53K-$91K (Glassdoor est.)'

In [11]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    salary_range = salary_str.split(' ')
    return salary_range
parse_salary(string)

['$53K-$91K', '(Glassdoor', 'est.)']

In [12]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    salary_range = salary_str.split(' ')[0]
    return salary_range
parse_salary(string)

'$53K-$91K'

In [13]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    salary_range = salary_str.split(' ')[0]
    if "-" in salary_range:
        salary_range.split('-')
    return salary_range
parse_salary(string)

'$53K-$91K'

In [22]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    salary_range = salary_str.split(' ')[0]
    if "-" in salary_range:
        min_salary_str, max_salary_str = salary_range.split('-')
    else:
        min_salary_str = max_salary_str = salary_range

    def clean_and_convert(salary):
        try:
            return float(salary.replace('$','').split('K')[0]) * 1000
        except ValueError:
            return 0

    min_salary = clean_and_convert(min_salary_str)
    max_salary = clean_and_convert(max_salary_str)
        
    return pd.Series([min_salary, max_salary])
parse_salary(string)

0    53000.0
1    91000.0
dtype: float64

In [23]:
data['Salary Estimate'].apply(parse_salary)

              0         1
Job ID
0       53000.0   91000.0
1       63000.0  112000.0
2       80000.0   90000.0
3       56000.0   97000.0
4       86000.0  143000.0
...         ...       ...
737     58000.0  111000.0
738     72000.0  133000.0
739     56000.0   91000.0
740     95000.0  160000.0
741     61000.0  126000.0

[742 rows x 2 columns]

In [24]:
data[['Min Salary', 'Max Salary']] = data['Salary Estimate'].apply(parse_salary)
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,tableau,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,1,0,0,0,data scientist,na,M,53000.0,91000.0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,0,data scientist,na,M,63000.0,112000.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,0,data scientist,na,M,80000.0,90000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,0,data scientist,na,na,56000.0,97000.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,0,data scientist,na,na,86000.0,143000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,0,other scientist,sr,M,58000.0,111000.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,0,data engineer,sr,na,72000.0,133000.0
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,0,other scientist,na,P,56000.0,91000.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,0,data scientist,na,na,95000.0,160000.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,0,other scientist,na,M,61000.0,126000.0

In [26]:
data['Average Salary'] = (data['Max Salary'] + data['Min Salary']) / 2

In [27]:
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,other scientist,na,P,56000.0,91000.0,73500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,other scientist,na,M,61000.0,126000.0,93500.0

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('data_cleaned_2021.csv')

In [3]:
data.index.name="Job ID"

In [4]:
new_data = data[['Job Title','Salary Estimate','Company Name','Location','Size']]

In [5]:
data[['Lower Salary','Upper Salary','Avg Salary(K)']]

        Lower Salary  Upper Salary  Avg Salary(K)
Job ID
0                 53            91           72.0
1                 63           112           87.5
2                 80            90           85.0
3                 56            97           76.5
4                 86           143          114.5
...              ...           ...            ...
737               58           111           84.5
738               72           133          102.5
739               56            91           73.5
740               95           160          127.5
741               61           126           93.5

[742 rows x 3 columns]

In [6]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    salary_range = salary_str.split(' ')[0]
    if "-" in salary_range:
        min_salary_str, max_salary_str = salary_range.split('-')
    else:
        min_salary_str = max_salary_str = salary_range

    def clean_and_convert(salary):
        try:
            return float(salary.replace('$','').split('K')[0]) * 1000
        except ValueError:
            return 0

    min_salary = clean_and_convert(min_salary_str)
    max_salary = clean_and_convert(max_salary_str)
        
    return pd.Series([min_salary, max_salary])
parse_salary(string)

0    53000.0
1    91000.0
dtype: float64

In [7]:
data['Salary Estimate'].apply(parse_salary)

              0         1
Job ID
0       53000.0   91000.0
1       63000.0  112000.0
2       80000.0   90000.0
3       56000.0   97000.0
4       86000.0  143000.0
...         ...       ...
737     58000.0  111000.0
738     72000.0  133000.0
739     56000.0   91000.0
740     95000.0  160000.0
741     61000.0  126000.0

[742 rows x 2 columns]

In [8]:
data[['Min Salary', 'Max Salary']] = data['Salary Estimate'].apply(parse_salary)

In [9]:
data['Average Salary'] = (data['Max Salary'] + data['Min Salary']) / 2

In [12]:
data['Job Title'].value_counts()

Job Title
Data Scientist                     131
Data Engineer                       53
Senior Data Scientist               34
Data Analyst                        15
Senior Data Engineer                14
                                  ...
Data Scientist/ML Engineer           1
Sr. Data Scientist                   1
Data Engineer 4 - Contract           1
Data Analyst - Asset Management      1
Machine Learning Engineer (NLP)      1
Name: count, Length: 264, dtype: int64

In [13]:
data['Job Title']

Job ID
0                                         Data Scientist
1                              Healthcare Data Scientist
2                                         Data Scientist
3                                         Data Scientist
4                                         Data Scientist
                             ...
737             Sr Scientist, Immuno-Oncology - Oncology
738                                 Senior Data Engineer
739    Project Scientist - Auton Lab, Robotics Institute
740                                 Data Science Manager
741            Research Scientist  Security and Privacy
Name: Job Title, Length: 742, dtype: object

In [16]:
data['Job Title'].value_counts(normalize=True)

Job Title
Data Scientist                     0.176550
Data Engineer                      0.071429
Senior Data Scientist              0.045822
Data Analyst                       0.020216
Senior Data Engineer               0.018868
                                     ...
Data Scientist/ML Engineer         0.001348
Sr. Data Scientist                 0.001348
Data Engineer 4 - Contract         0.001348
Data Analyst - Asset Management    0.001348
Machine Learning Engineer (NLP)    0.001348
Name: proportion, Length: 264, dtype: float64

In [21]:
data['Max Salary'] = data['Max Salary'].astype('int')
data['Max Salary']

Job ID
0       91000
1      112000
2       90000
3       97000
4      143000
        ...
737    111000
738    133000
739     91000
740    160000
741    126000
Name: Max Salary, Length: 742, dtype: int64

In [22]:
data['Max Salary'].dtype

dtype('int64')

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('data_cleaned_2021.csv')

In [3]:
data.index.name="Job ID"

In [4]:
new_data = data[['Job Title','Salary Estimate','Company Name','Location','Size']]

In [5]:
data[['Lower Salary','Upper Salary','Avg Salary(K)']]

        Lower Salary  Upper Salary  Avg Salary(K)
Job ID
0                 53            91           72.0
1                 63           112           87.5
2                 80            90           85.0
3                 56            97           76.5
4                 86           143          114.5
...              ...           ...            ...
737               58           111           84.5
738               72           133          102.5
739               56            91           73.5
740               95           160          127.5
741               61           126           93.5

[742 rows x 3 columns]

In [6]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    salary_range = salary_str.split(' ')[0]
    if "-" in salary_range:
        min_salary_str, max_salary_str = salary_range.split('-')
    else:
        min_salary_str = max_salary_str = salary_range

    def clean_and_convert(salary):
        try:
            return float(salary.replace('$','').split('K')[0]) * 1000
        except ValueError:
            return 0

    min_salary = clean_and_convert(min_salary_str)
    max_salary = clean_and_convert(max_salary_str)
        
    return pd.Series([min_salary, max_salary])
parse_salary(string)

0    53000.0
1    91000.0
dtype: float64

In [7]:
data['Salary Estimate'].apply(parse_salary)

              0         1
Job ID
0       53000.0   91000.0
1       63000.0  112000.0
2       80000.0   90000.0
3       56000.0   97000.0
4       86000.0  143000.0
...         ...       ...
737     58000.0  111000.0
738     72000.0  133000.0
739     56000.0   91000.0
740     95000.0  160000.0
741     61000.0  126000.0

[742 rows x 2 columns]

In [8]:
data[['Min Salary', 'Max Salary']] = data['Salary Estimate'].apply(parse_salary)

In [9]:
data['Average Salary'] = (data['Max Salary'] + data['Min Salary']) / 2

In [10]:
data['Job Title'].value_counts()

Job Title
Data Scientist                     131
Data Engineer                       53
Senior Data Scientist               34
Data Analyst                        15
Senior Data Engineer                14
                                  ...
Data Scientist/ML Engineer           1
Sr. Data Scientist                   1
Data Engineer 4 - Contract           1
Data Analyst - Asset Management      1
Machine Learning Engineer (NLP)      1
Name: count, Length: 264, dtype: int64

In [11]:
data['Job Title']

Job ID
0                                         Data Scientist
1                              Healthcare Data Scientist
2                                         Data Scientist
3                                         Data Scientist
4                                         Data Scientist
                             ...
737             Sr Scientist, Immuno-Oncology - Oncology
738                                 Senior Data Engineer
739    Project Scientist - Auton Lab, Robotics Institute
740                                 Data Science Manager
741            Research Scientist  Security and Privacy
Name: Job Title, Length: 742, dtype: object

In [12]:
data['Job Title'].value_counts(normalize=True)

Job Title
Data Scientist                     0.176550
Data Engineer                      0.071429
Senior Data Scientist              0.045822
Data Analyst                       0.020216
Senior Data Engineer               0.018868
                                     ...
Data Scientist/ML Engineer         0.001348
Sr. Data Scientist                 0.001348
Data Engineer 4 - Contract         0.001348
Data Analyst - Asset Management    0.001348
Machine Learning Engineer (NLP)    0.001348
Name: proportion, Length: 264, dtype: float64

In [13]:
data['Max Salary'] = data['Max Salary'].astype('int')
data['Max Salary']

Job ID
0       91000
1      112000
2       90000
3       97000
4      143000
        ...
737    111000
738    133000
739     91000
740    160000
741    126000
Name: Max Salary, Length: 742, dtype: int64

In [14]:
data['Max Salary'].dtype

dtype('int64')

In [16]:
data.sort_values('Average Salary').head(10)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
370,472,"Research Scientist, Immunology - Cancer Biology",Employer Provided Salary:$100K-$140K,"Research Scientist, Immunology - Cancer Biolog...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0
300,377,Data Operations Lead,Employer Provided Salary:$85K-$90K,Data Operations Lead\nLocation: Flexible thoug...,-1.0,Muso,"San Francisco, CA","San Francisco, CA",201 - 500,-1,...,0,0,0,0,na,sr,M,0.0,0,0.0
551,703,"Research Scientist, Immunology - Cancer Biology",Employer Provided Salary:$100K-$140K,"Research Scientist, Immunology - Cancer Biolog...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0
138,161,Data Engineer,Employer Provided Salary:$120K-$145K,"Location: Tampa, FL\nTitle: Data Engineer\nTS/...",5.0,Gridiron IT\n5.0,"Tampa, FL","Reston, VA",51 - 200,2017,...,0,0,0,0,data engineer,na,na,0.0,0,0.0
581,741,"Scientist Cancer Discovery, Molecular Assay",Employer Provided Salary:$100K-$135K,"Scientist Cancer Discovery, Molecular Assay\...",-1.0,Monte Rosa Therapeutics,"Cambridge, MA",-1,unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0
266,331,Principal Data Scientist with over 10 years ex...,Employer Provided Salary:$200K-$250K,Position Title: Principal Data Scientist\nLoca...,-1.0,CA-One Tech Cloud,"San Francisco, CA","Fremont, CA",51 - 200,2017,...,0,0,0,0,data scientist,sr,na,0.0,0,0.0
45,48,Data Scientist,Employer Provided Salary:$150K-$160K,"BPA Services, LLC is seeking a Computer/Data S...",5.0,BPA Services\n5.0,"Washington, DC","Alexandria, VA",unknown,-1,...,0,0,0,0,data scientist,na,na,0.0,0,0.0
609,778,"Senior Scientist, Cell Pharmacology/Assay Deve...",Employer Provided Salary:$110K-$130K,"Senior Scientist, Cell Pharmacology/Assay Deve...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,sr,P,0.0,0,0.0
641,819,"Principal Research Scientist/Team Lead, Medici...",Employer Provided Salary:$120K-$145K,"Principal Research Scientist/Team Lead, Medici...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,sr,P,0.0,0,0.0
176,208,Principal Data Scientist with over 10 years ex...,Employer Provided Salary:$200K-$250K,Position Title: Principal Data Scientist\nLoca...,-1.0,CA-One Tech Cloud,"San Francisco, CA","Fremont, CA",51 - 200,2017,...,0,0,0,0,data scientist,sr,na,0.0,0,0.0

In [17]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    if ":" in salary_str:
        salary_str = salary_str.split(":")[1].strip()
    salary_range = salary_str.split(' ')[0]
    if "-" in salary_range:
        min_salary_str, max_salary_str = salary_range.split('-')
    else:
        min_salary_str = max_salary_str = salary_range

    def clean_and_convert(salary):
        try:
            return float(salary.replace('$','').split('K')[0]) * 1000
        except ValueError:
            return 0

    min_salary = clean_and_convert(min_salary_str)
    max_salary = clean_and_convert(max_salary_str)
        
    return pd.Series([min_salary, max_salary])
parse_salary(string)

0    53000.0
1    91000.0
dtype: float64

In [18]:
data['Salary Estimate'].apply(parse_salary)

              0         1
Job ID
0       53000.0   91000.0
1       63000.0  112000.0
2       80000.0   90000.0
3       56000.0   97000.0
4       86000.0  143000.0
...         ...       ...
737     58000.0  111000.0
738     72000.0  133000.0
739     56000.0   91000.0
740     95000.0  160000.0
741     61000.0  126000.0

[742 rows x 2 columns]

In [19]:
data.sort_values('Average Salary').head(10)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
370,472,"Research Scientist, Immunology - Cancer Biology",Employer Provided Salary:$100K-$140K,"Research Scientist, Immunology - Cancer Biolog...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0
300,377,Data Operations Lead,Employer Provided Salary:$85K-$90K,Data Operations Lead\nLocation: Flexible thoug...,-1.0,Muso,"San Francisco, CA","San Francisco, CA",201 - 500,-1,...,0,0,0,0,na,sr,M,0.0,0,0.0
551,703,"Research Scientist, Immunology - Cancer Biology",Employer Provided Salary:$100K-$140K,"Research Scientist, Immunology - Cancer Biolog...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0
138,161,Data Engineer,Employer Provided Salary:$120K-$145K,"Location: Tampa, FL\nTitle: Data Engineer\nTS/...",5.0,Gridiron IT\n5.0,"Tampa, FL","Reston, VA",51 - 200,2017,...,0,0,0,0,data engineer,na,na,0.0,0,0.0
581,741,"Scientist Cancer Discovery, Molecular Assay",Employer Provided Salary:$100K-$135K,"Scientist Cancer Discovery, Molecular Assay\...",-1.0,Monte Rosa Therapeutics,"Cambridge, MA",-1,unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0
266,331,Principal Data Scientist with over 10 years ex...,Employer Provided Salary:$200K-$250K,Position Title: Principal Data Scientist\nLoca...,-1.0,CA-One Tech Cloud,"San Francisco, CA","Fremont, CA",51 - 200,2017,...,0,0,0,0,data scientist,sr,na,0.0,0,0.0
45,48,Data Scientist,Employer Provided Salary:$150K-$160K,"BPA Services, LLC is seeking a Computer/Data S...",5.0,BPA Services\n5.0,"Washington, DC","Alexandria, VA",unknown,-1,...,0,0,0,0,data scientist,na,na,0.0,0,0.0
609,778,"Senior Scientist, Cell Pharmacology/Assay Deve...",Employer Provided Salary:$110K-$130K,"Senior Scientist, Cell Pharmacology/Assay Deve...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,sr,P,0.0,0,0.0
641,819,"Principal Research Scientist/Team Lead, Medici...",Employer Provided Salary:$120K-$145K,"Principal Research Scientist/Team Lead, Medici...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,sr,P,0.0,0,0.0
176,208,Principal Data Scientist with over 10 years ex...,Employer Provided Salary:$200K-$250K,Position Title: Principal Data Scientist\nLoca...,-1.0,CA-One Tech Cloud,"San Francisco, CA","Fremont, CA",51 - 200,2017,...,0,0,0,0,data scientist,sr,na,0.0,0,0.0

In [20]:
data.sort_values('Average Salary', ascending=False)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
354,452,"Director II, Data Science - GRM Actuarial",$202K-$306K (Glassdoor est.),Advance your career at Liberty Mutual Insuranc...,3.3,Liberty Mutual Insurance\n3.3,"Chicago, IL","Boston, MA",10000+,1912,...,0,0,0,0,data scientist,na,M,202000.0,306000,254000.0
708,913,"Director II, Data Science - GRM Actuarial",$202K-$306K (Glassdoor est.),Advance your career at Liberty Mutual Insuranc...,3.3,Liberty Mutual Insurance\n3.3,"Chicago, IL","Boston, MA",10000+,1912,...,0,0,0,0,data scientist,na,M,202000.0,306000,254000.0
528,675,"Director II, Data Science - GRM Actuarial",$202K-$306K (Glassdoor est.),Advance your career at Liberty Mutual Insuranc...,3.3,Liberty Mutual Insurance\n3.3,"Chicago, IL","Boston, MA",10000+,1912,...,0,0,0,0,data scientist,na,M,202000.0,306000,254000.0
103,117,Senior Data Scientist,$200K-$275K(Employer est.),Who we want:\nAre you committed to using your ...,4.2,Gallup\n4.2,"Washington, DC","Washington, DC",1001 - 5000,1935,...,0,0,0,0,data scientist,sr,M,200000.0,275000,237500.0
429,548,Principal Machine Learning Scientist,$176K-$289K (Glassdoor est.),"Today, nearly every business in the world has ...",4.7,Sage Intacct\n4.7,"San Francisco, CA","San Jose, CA",501 - 1000,1999,...,0,0,0,0,machine learning engineer,sr,P,176000.0,289000,232500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
176,208,Principal Data Scientist with over 10 years ex...,Employer Provided Salary:$200K-$250K,Position Title: Principal Data Scientist\nLoca...,-1.0,CA-One Tech Cloud,"San Francisco, CA","Fremont, CA",51 - 200,2017,...,0,0,0,0,data scientist,sr,na,0.0,0,0.0
693,893,Senior Data Scientist,Employer Provided Salary:$120K-$140K,"SkySync is a dynamic, fast-paced, venture-back...",5.0,SkySync\n5.0,"Ann Arbor, MI","Ann Arbor, MI",51 - 200,2011,...,0,0,0,0,data scientist,sr,M,0.0,0,0.0
542,694,ENVIRONMENTAL ENGINEER/SCIENTIST,Employer Provided Salary:$25-$28 Per Hour,"McPhail Associates, LLC is a geotechnical and ...",3.3,Mcphail Associates\n3.3,"Cambridge, MA","Cambridge, MA",1 - 50,1976,...,0,0,0,0,other scientist,na,na,0.0,0,0.0
300,377,Data Operations Lead,Employer Provided Salary:$85K-$90K,Data Operations Lead\nLocation: Flexible thoug...,-1.0,Muso,"San Francisco, CA","San Francisco, CA",201 - 500,-1,...,0,0,0,0,na,sr,M,0.0,0,0.0
641,819,"Principal Research Scientist/Team Lead, Medici...",Employer Provided Salary:$120K-$145K,"Principal Research Scientist/Team Lead, Medici...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,sr,P,0.0,0,0.0

In [21]:
data.sort_values('Max Salary', ascending=False)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
354,452,"Director II, Data Science - GRM Actuarial",$202K-$306K (Glassdoor est.),Advance your career at Liberty Mutual Insuranc...,3.3,Liberty Mutual Insurance\n3.3,"Chicago, IL","Boston, MA",10000+,1912,...,0,0,0,0,data scientist,na,M,202000.0,306000,254000.0
528,675,"Director II, Data Science - GRM Actuarial",$202K-$306K (Glassdoor est.),Advance your career at Liberty Mutual Insuranc...,3.3,Liberty Mutual Insurance\n3.3,"Chicago, IL","Boston, MA",10000+,1912,...,0,0,0,0,data scientist,na,M,202000.0,306000,254000.0
708,913,"Director II, Data Science - GRM Actuarial",$202K-$306K (Glassdoor est.),Advance your career at Liberty Mutual Insuranc...,3.3,Liberty Mutual Insurance\n3.3,"Chicago, IL","Boston, MA",10000+,1912,...,0,0,0,0,data scientist,na,M,202000.0,306000,254000.0
429,548,Principal Machine Learning Scientist,$176K-$289K (Glassdoor est.),"Today, nearly every business in the world has ...",4.7,Sage Intacct\n4.7,"San Francisco, CA","San Jose, CA",501 - 1000,1999,...,0,0,0,0,machine learning engineer,sr,P,176000.0,289000,232500.0
103,117,Senior Data Scientist,$200K-$275K(Employer est.),Who we want:\nAre you committed to using your ...,4.2,Gallup\n4.2,"Washington, DC","Washington, DC",1001 - 5000,1935,...,0,0,0,0,data scientist,sr,M,200000.0,275000,237500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
370,472,"Research Scientist, Immunology - Cancer Biology",Employer Provided Salary:$100K-$140K,"Research Scientist, Immunology - Cancer Biolog...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0
581,741,"Scientist Cancer Discovery, Molecular Assay",Employer Provided Salary:$100K-$135K,"Scientist Cancer Discovery, Molecular Assay\...",-1.0,Monte Rosa Therapeutics,"Cambridge, MA",-1,unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0
363,464,ENVIRONMENTAL ENGINEER/SCIENTIST,Employer Provided Salary:$25-$28 Per Hour,"McPhail Associates, LLC is a geotechnical and ...",3.3,Mcphail Associates\n3.3,"Cambridge, MA","Cambridge, MA",1 - 50,1976,...,0,0,0,0,other scientist,na,na,0.0,0,0.0
176,208,Principal Data Scientist with over 10 years ex...,Employer Provided Salary:$200K-$250K,Position Title: Principal Data Scientist\nLoca...,-1.0,CA-One Tech Cloud,"San Francisco, CA","Fremont, CA",51 - 200,2017,...,0,0,0,0,data scientist,sr,na,0.0,0,0.0
138,161,Data Engineer,Employer Provided Salary:$120K-$145K,"Location: Tampa, FL\nTitle: Data Engineer\nTS/...",5.0,Gridiron IT\n5.0,"Tampa, FL","Reston, VA",51 - 200,2017,...,0,0,0,0,data engineer,na,na,0.0,0,0.0

In [22]:
data.sort_values('Rating', ascending=False)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
373,477,Data Scientist,Employer Provided Salary:$150K-$160K,"BPA Services, LLC is seeking a Computer/Data S...",5.0,BPA Services\n5.0,"Washington, DC","Alexandria, VA",unknown,-1,...,0,0,0,0,data scientist,na,na,0.0,0,0.0
424,542,Data Scientist,$75K-$127K (Glassdoor est.),Title: Data Scientist\n\nLocation: Springfield...,5.0,Royce Geospatial\n5.0,"Springfield, VA","Arlington, VA",51 - 200,2014,...,0,0,0,0,data scientist,na,na,75000.0,127000,101000.0
45,48,Data Scientist,Employer Provided Salary:$150K-$160K,"BPA Services, LLC is seeking a Computer/Data S...",5.0,BPA Services\n5.0,"Washington, DC","Alexandria, VA",unknown,-1,...,0,0,0,0,data scientist,na,na,0.0,0,0.0
693,893,Senior Data Scientist,Employer Provided Salary:$120K-$140K,"SkySync is a dynamic, fast-paced, venture-back...",5.0,SkySync\n5.0,"Ann Arbor, MI","Ann Arbor, MI",51 - 200,2011,...,0,0,0,0,data scientist,sr,M,0.0,0,0.0
138,161,Data Engineer,Employer Provided Salary:$120K-$145K,"Location: Tampa, FL\nTitle: Data Engineer\nTS/...",5.0,Gridiron IT\n5.0,"Tampa, FL","Reston, VA",51 - 200,2017,...,0,0,0,0,data engineer,na,na,0.0,0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,778,"Senior Scientist, Cell Pharmacology/Assay Deve...",Employer Provided Salary:$110K-$130K,"Senior Scientist, Cell Pharmacology/Assay Deve...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,sr,P,0.0,0,0.0
176,208,Principal Data Scientist with over 10 years ex...,Employer Provided Salary:$200K-$250K,Position Title: Principal Data Scientist\nLoca...,-1.0,CA-One Tech Cloud,"San Francisco, CA","Fremont, CA",51 - 200,2017,...,0,0,0,0,data scientist,sr,na,0.0,0,0.0
641,819,"Principal Research Scientist/Team Lead, Medici...",Employer Provided Salary:$120K-$145K,"Principal Research Scientist/Team Lead, Medici...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,sr,P,0.0,0,0.0
404,518,"Senior Scientist, Cell Pharmacology/Assay Deve...",Employer Provided Salary:$110K-$130K,"Senior Scientist, Cell Pharmacology/Assay Deve...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,sr,P,0.0,0,0.0
456,583,Data Scientist,$81K-$140K (Glassdoor est.),"As a Data Scientist, you will play a critical ...",-1.0,ALIN,"New York, NY","Noida, India",unknown,-1,...,0,0,0,0,data scientist,na,M,81000.0,140000,110500.0

In [23]:
data.sort_values(['Max Salary','Rating'], ascending=False)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
354,452,"Director II, Data Science - GRM Actuarial",$202K-$306K (Glassdoor est.),Advance your career at Liberty Mutual Insuranc...,3.3,Liberty Mutual Insurance\n3.3,"Chicago, IL","Boston, MA",10000+,1912,...,0,0,0,0,data scientist,na,M,202000.0,306000,254000.0
528,675,"Director II, Data Science - GRM Actuarial",$202K-$306K (Glassdoor est.),Advance your career at Liberty Mutual Insuranc...,3.3,Liberty Mutual Insurance\n3.3,"Chicago, IL","Boston, MA",10000+,1912,...,0,0,0,0,data scientist,na,M,202000.0,306000,254000.0
708,913,"Director II, Data Science - GRM Actuarial",$202K-$306K (Glassdoor est.),Advance your career at Liberty Mutual Insuranc...,3.3,Liberty Mutual Insurance\n3.3,"Chicago, IL","Boston, MA",10000+,1912,...,0,0,0,0,data scientist,na,M,202000.0,306000,254000.0
429,548,Principal Machine Learning Scientist,$176K-$289K (Glassdoor est.),"Today, nearly every business in the world has ...",4.7,Sage Intacct\n4.7,"San Francisco, CA","San Jose, CA",501 - 1000,1999,...,0,0,0,0,machine learning engineer,sr,P,176000.0,289000,232500.0
103,117,Senior Data Scientist,$200K-$275K(Employer est.),Who we want:\nAre you committed to using your ...,4.2,Gallup\n4.2,"Washington, DC","Washington, DC",1001 - 5000,1935,...,0,0,0,0,data scientist,sr,M,200000.0,275000,237500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
551,703,"Research Scientist, Immunology - Cancer Biology",Employer Provided Salary:$100K-$140K,"Research Scientist, Immunology - Cancer Biolog...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0
581,741,"Scientist Cancer Discovery, Molecular Assay",Employer Provided Salary:$100K-$135K,"Scientist Cancer Discovery, Molecular Assay\...",-1.0,Monte Rosa Therapeutics,"Cambridge, MA",-1,unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0
609,778,"Senior Scientist, Cell Pharmacology/Assay Deve...",Employer Provided Salary:$110K-$130K,"Senior Scientist, Cell Pharmacology/Assay Deve...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,sr,P,0.0,0,0.0
641,819,"Principal Research Scientist/Team Lead, Medici...",Employer Provided Salary:$120K-$145K,"Principal Research Scientist/Team Lead, Medici...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,sr,P,0.0,0,0.0
730,943,"Research Scientist, Immunology - Cancer Biology",Employer Provided Salary:$100K-$140K,"Research Scientist, Immunology - Cancer Biolog...",-1.0,Kronos Bio,"Cambridge, MA","San Mateo, CA",unknown,-1,...,0,0,0,0,other scientist,na,P,0.0,0,0.0

In [25]:
data.sort_values(['Rating','Max Salary'], ascending=False).head(30)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
424,542,Data Scientist,$75K-$127K (Glassdoor est.),Title: Data Scientist\n\nLocation: Springfield...,5.0,Royce Geospatial\n5.0,"Springfield, VA","Arlington, VA",51 - 200,2014,...,0,0,0,0,data scientist,na,na,75000.0,127000,101000.0
45,48,Data Scientist,Employer Provided Salary:$150K-$160K,"BPA Services, LLC is seeking a Computer/Data S...",5.0,BPA Services\n5.0,"Washington, DC","Alexandria, VA",unknown,-1,...,0,0,0,0,data scientist,na,na,0.0,0,0.0
138,161,Data Engineer,Employer Provided Salary:$120K-$145K,"Location: Tampa, FL\nTitle: Data Engineer\nTS/...",5.0,Gridiron IT\n5.0,"Tampa, FL","Reston, VA",51 - 200,2017,...,0,0,0,0,data engineer,na,na,0.0,0,0.0
373,477,Data Scientist,Employer Provided Salary:$150K-$160K,"BPA Services, LLC is seeking a Computer/Data S...",5.0,BPA Services\n5.0,"Washington, DC","Alexandria, VA",unknown,-1,...,0,0,0,0,data scientist,na,na,0.0,0,0.0
693,893,Senior Data Scientist,Employer Provided Salary:$120K-$140K,"SkySync is a dynamic, fast-paced, venture-back...",5.0,SkySync\n5.0,"Ann Arbor, MI","Ann Arbor, MI",51 - 200,2011,...,0,0,0,0,data scientist,sr,M,0.0,0,0.0
459,587,Data Scientist,$112K-$179K (Glassdoor est.),"Hi,\n\nGreetings of the Day!!!\n\nLooking for ...",4.8,TechProjects\n4.8,"New York, NY","North Brunswick, NJ",1 - 50,2011,...,0,0,0,0,data scientist,na,na,112000.0,179000,145500.0
208,255,Senior Research Statistician- Data Scientist,$76K-$125K (Glassdoor est.),Acuity is seeking a Senior Research Statistici...,4.8,Acuity Insurance\n4.8,"Sheboygan, WI","Sheboygan, WI",1001 - 5000,1925,...,0,0,0,0,data scientist,sr,M,76000.0,125000,100500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000,85000.0
29,30,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000,85000.0
150,177,Senior Data Analyst,$44K-$78K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,analyst,sr,M,44000.0,78000,61000.0
212,259,Senior Data Analyst,$44K-$78K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,analyst,sr,M,44000.0,78000,61000.0
366,468,Revenue Analytics Manager,$45K-$78K (Glassdoor est.),HOVER uses patented technology making it possi...,4.8,HOVER\n4.8,"San Francisco, CA","San Francisco, CA",51 - 200,2011,...,0,0,0,0,Data scientist project manager,na,na,45000.0,78000,61500.0
546,698,Revenue Analytics Manager,$45K-$78K (Glassdoor est.),HOVER uses patented technology making it possi...,4.8,HOVER\n4.8,"San Francisco, CA","San Francisco, CA",51 - 200,2011,...,0,0,0,0,Data scientist project manager,na,na,45000.0,78000,61500.0
727,940,Revenue Analytics Manager,$45K-$78K (Glassdoor est.),HOVER uses patented technology making it possi...,4.8,HOVER\n4.8,"San Francisco, CA","San Francisco, CA",51 - 200,2011,...,0,0,0,0,Data scientist project manager,na,na,45000.0,78000,61500.0
429,548,Principal Machine Learning Scientist,$176K-$289K (Glassdoor est.),"Today, nearly every business in the world has ...",4.7,Sage Intacct\n4.7,"San Francisco, CA","San Jose, CA",501 - 1000,1999,...,0,0,0,0,machine learning engineer,sr,P,176000.0,289000,232500.0
549,701,Data Scientist - Sales,$130K-$206K (Glassdoor est.),"Dubbed an ""open-source unicorn"" by Forbes, Con...",4.7,Confluent\n4.7,"Mountain View, CA","Mountain View, CA",501 - 1000,2014,...,0,0,0,0,data scientist,na,na,130000.0,206000,168000.0
389,497,Senior Data Engineer,$97K-$180K (Glassdoor est.),Position Overview: From software hacking to ha...,4.7,Praetorian\n4.7,"Austin, TX","Austin, TX",51 - 200,2010,...,0,0,0,0,data engineer,sr,na,97000.0,180000,138500.0
590,750,Senior Data Engineer,$97K-$180K (Glassdoor est.),Position Overview: From software hacking to ha...,4.7,Praetorian\n4.7,"Austin, TX","Austin, TX",51 - 200,2010,...,0,0,0,0,data engineer,sr,na,97000.0,180000,138500.0
57,61,Data Scientist,$111K-$176K (Glassdoor est.),About Us\n\n\nInterested in working for a huma...,4.7,1904labs\n4.7,"Saint Louis, MO","Saint Louis, MO",51 - 200,2016,...,0,0,0,0,data scientist,na,na,111000.0,176000,143500.0
423,541,Data Scientist,$111K-$176K (Glassdoor est.),About Us\n\n\nInterested in working for a huma...,4.7,1904labs\n4.7,"Saint Louis, MO","Saint Louis, MO",51 - 200,2016,...,0,0,0,0,data scientist,na,na,111000.0,176000,143500.0
188,225,Principal Data Scientist (Computational Chemis...,$108K-$173K (Glassdoor est.),"At Recursion, we combine experimental biology,...",4.7,Recursion Pharmaceuticals\n4.7,"Salt Lake City, UT","Salt Lake City, UT",51 - 200,2013,...,0,0,0,0,data scientist,sr,na,108000.0,173000,140500.0
310,390,Principal Data Scientist (Computational Chemis...,$108K-$173K (Glassdoor est.),"At Recursion, we combine experimental biology,...",4.7,Recursion Pharmaceuticals\n4.7,"Salt Lake City, UT","Salt Lake City, UT",51 - 200,2013,...,0,0,0,0,data scientist,sr,na,108000.0,173000,140500.0
427,545,Principal Data Scientist (Computational Chemis...,$108K-$173K (Glassdoor est.),"At Recursion, we combine experimental biology,...",4.7,Recursion Pharmaceuticals\n4.7,"Salt Lake City, UT","Salt Lake City, UT",51 - 200,2013,...,0,0,0,0,data scientist,sr,na,108000.0,173000,140500.0
34,35,Data Scientist,$85K-$140K (Glassdoor est.),New England Biolabs is seeking a Data Scientis...,4.7,New England Biolabs\n4.7,"Ipswich, MA","Ipswich, MA",201 - 500,1974,...,0,0,0,0,data scientist,na,na,85000.0,140000,112500.0
327,413,Data Scientist,$85K-$140K (Glassdoor est.),New England Biolabs is seeking a Data Scientis...,4.7,New England Biolabs\n4.7,"Ipswich, MA","Ipswich, MA",201 - 500,1974,...,0,0,0,0,data scientist,na,na,85000.0,140000,112500.0
233,288,Data & Analytics Consultant (NYC),$91K-$138K (Glassdoor est.),WHO WE LOOK FOR\n\nAn SEI Consultant is a mast...,4.7,Systems Evolution Inc.\n4.7,"New York, NY","Cincinnati, OH",201 - 500,1992,...,0,0,0,0,data analitics,na,M,91000.0,138000,114500.0
37,38,Data Scientist,$83K-$137K (Glassdoor est.),STR is a government research contractor specia...,4.7,Systems & Technology Research\n4.7,"Woburn, MA","Woburn, MA",201 - 500,2010,...,0,0,0,0,data scientist,na,P,83000.0,137000,110000.0
93,104,Data Modeler,$79K-$134K (Glassdoor est.),The database modeler shall perform analysis of...,4.7,IT Concepts\n4.7,"Landover, MD","Vienna, VA",51 - 200,2003,...,0,0,0,0,data modeler,na,na,79000.0,134000,106500.0
447,572,Data Scientist,$80K-$134K (Glassdoor est.),STR is a government research contractor specia...,4.7,Systems & Technology Research\n4.7,"Arlington, VA","Woburn, MA",201 - 500,2010,...,0,0,0,0,data scientist,na,P,80000.0,134000,107000.0
117,132,Data Engineer,$65K-$125K (Glassdoor est.),"Job Description\n\nWhy consider OPI, and why d...",4.7,Object Partners\n4.7,"Minneapolis, MN","Minneapolis, MN",51 - 200,1996,...,0,1,0,0,data engineer,na,na,65000.0,125000,95000.0

In [26]:
data.sort_values(['Rating','Max Salary'], ascending=[False, True]).head(30)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
45,48,Data Scientist,Employer Provided Salary:$150K-$160K,"BPA Services, LLC is seeking a Computer/Data S...",5.0,BPA Services\n5.0,"Washington, DC","Alexandria, VA",unknown,-1,...,0,0,0,0,data scientist,na,na,0.0,0,0.0
138,161,Data Engineer,Employer Provided Salary:$120K-$145K,"Location: Tampa, FL\nTitle: Data Engineer\nTS/...",5.0,Gridiron IT\n5.0,"Tampa, FL","Reston, VA",51 - 200,2017,...,0,0,0,0,data engineer,na,na,0.0,0,0.0
373,477,Data Scientist,Employer Provided Salary:$150K-$160K,"BPA Services, LLC is seeking a Computer/Data S...",5.0,BPA Services\n5.0,"Washington, DC","Alexandria, VA",unknown,-1,...,0,0,0,0,data scientist,na,na,0.0,0,0.0
693,893,Senior Data Scientist,Employer Provided Salary:$120K-$140K,"SkySync is a dynamic, fast-paced, venture-back...",5.0,SkySync\n5.0,"Ann Arbor, MI","Ann Arbor, MI",51 - 200,2011,...,0,0,0,0,data scientist,sr,M,0.0,0,0.0
424,542,Data Scientist,$75K-$127K (Glassdoor est.),Title: Data Scientist\n\nLocation: Springfield...,5.0,Royce Geospatial\n5.0,"Springfield, VA","Arlington, VA",51 - 200,2014,...,0,0,0,0,data scientist,na,na,75000.0,127000,101000.0
150,177,Senior Data Analyst,$44K-$78K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,analyst,sr,M,44000.0,78000,61000.0
212,259,Senior Data Analyst,$44K-$78K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,analyst,sr,M,44000.0,78000,61000.0
366,468,Revenue Analytics Manager,$45K-$78K (Glassdoor est.),HOVER uses patented technology making it possi...,4.8,HOVER\n4.8,"San Francisco, CA","San Francisco, CA",51 - 200,2011,...,0,0,0,0,Data scientist project manager,na,na,45000.0,78000,61500.0
546,698,Revenue Analytics Manager,$45K-$78K (Glassdoor est.),HOVER uses patented technology making it possi...,4.8,HOVER\n4.8,"San Francisco, CA","San Francisco, CA",51 - 200,2011,...,0,0,0,0,Data scientist project manager,na,na,45000.0,78000,61500.0
727,940,Revenue Analytics Manager,$45K-$78K (Glassdoor est.),HOVER uses patented technology making it possi...,4.8,HOVER\n4.8,"San Francisco, CA","San Francisco, CA",51 - 200,2011,...,0,0,0,0,Data scientist project manager,na,na,45000.0,78000,61500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000,85000.0
29,30,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000,85000.0
208,255,Senior Research Statistician- Data Scientist,$76K-$125K (Glassdoor est.),Acuity is seeking a Senior Research Statistici...,4.8,Acuity Insurance\n4.8,"Sheboygan, WI","Sheboygan, WI",1001 - 5000,1925,...,0,0,0,0,data scientist,sr,M,76000.0,125000,100500.0
459,587,Data Scientist,$112K-$179K (Glassdoor est.),"Hi,\n\nGreetings of the Day!!!\n\nLooking for ...",4.8,TechProjects\n4.8,"New York, NY","North Brunswick, NJ",1 - 50,2011,...,0,0,0,0,data scientist,na,na,112000.0,179000,145500.0
382,490,Associate Environmental Scientist - Wildlife B...,$38K-$64K (Glassdoor est.),"QK, Inc., formerly Quad Knopf, has served a di...",4.7,QK\n4.7,"Clovis, CA","Visalia, CA",51 - 200,1972,...,0,0,0,0,other scientist,na,na,38000.0,64000,51000.0
576,735,Associate Environmental Scientist - Wildlife B...,$38K-$64K (Glassdoor est.),"QK, Inc., formerly Quad Knopf, has served a di...",4.7,QK\n4.7,"Clovis, CA","Visalia, CA",51 - 200,1972,...,0,0,0,0,other scientist,na,na,38000.0,64000,51000.0
106,120,Financial Data Analyst,$41K-$72K (Glassdoor est.),CentralReach is a leading provider of end-to-e...,4.7,CentralReach\n4.7,"Matawan, NJ","Pompano Beach, FL",201 - 500,2012,...,0,0,0,0,analyst,na,na,41000.0,72000,56500.0
81,89,Jr. Business Data Analyst,$37K-$76K (Glassdoor est.),"Hi there! We're WebFX, a full-service digital ...",4.7,webfx.com\n4.7,"Harrisburg, PA","Harrisburg, PA",201 - 500,1997,...,0,0,0,1,analyst,jr,na,37000.0,76000,56500.0
184,217,Radar Data Analyst,$42K-$76K (Glassdoor est.),Decisive Analytics Corporation has an opening ...,4.7,DECISIVE ANALYTICS Corporation\n4.7,"Huntsville, AL","Arlington, VA",51 - 200,1996,...,0,0,0,0,analyst,na,na,42000.0,76000,59000.0
285,355,Radar Data Analyst,$42K-$76K (Glassdoor est.),Decisive Analytics Corporation has an opening ...,4.7,DECISIVE ANALYTICS Corporation\n4.7,"Huntsville, AL","Arlington, VA",51 - 200,1996,...,0,0,0,0,analyst,na,na,42000.0,76000,59000.0
66,73,Data Scientist,$60K-$99K (Glassdoor est.),Job Description\n\n\nOversight is a leading pr...,4.7,Oversight Systems\n4.7,"Atlanta, GA","Atlanta, GA",51 - 200,2003,...,0,0,0,0,data scientist,na,na,60000.0,99000,79500.0
548,700,Data Scientist,$60K-$99K (Glassdoor est.),Job Description\n\n\nOversight is a leading pr...,4.7,Oversight Systems\n4.7,"Atlanta, GA","Atlanta, GA",51 - 200,2003,...,0,0,0,0,data scientist,na,na,60000.0,99000,79500.0
388,496,"Technology-Minded, Data Professional Opportuni...",$40K-$101K (Glassdoor est.),"At VU, we help Veterans buy homes. To make tha...",4.7,Veterans United Home Loans\n4.7,"Columbia, MO","Columbia, MO",1001 - 5000,2002,...,0,0,1,0,na,na,na,40000.0,101000,70500.0
586,746,"Technology-Minded, Data Professional Opportuni...",$40K-$101K (Glassdoor est.),"At VU, we help Veterans buy homes. To make tha...",4.7,Veterans United Home Loans\n4.7,"Columbia, MO","Columbia, MO",1001 - 5000,2002,...,0,0,1,0,na,na,na,40000.0,101000,70500.0
435,556,Data Scientist,$65K-$106K (Glassdoor est.),About Us:\n\nHeadquartered in beautiful Santa ...,4.7,HG Insights\n4.7,"Santa Barbara, CA","Santa Barbara, CA",51 - 200,2010,...,0,0,0,0,data scientist,na,P,65000.0,106000,85500.0
101,113,Data Scientist,$61K-$110K (Glassdoor est.),"About Us\n\nFounded in Syracuse in 1992, we ar...",4.7,Rapid Response Monitoring\n4.7,"Syracuse, NY","Syracuse, NY",501 - 1000,1992,...,0,0,0,0,data scientist,na,M,61000.0,110000,85500.0
48,51,Spectral Scientist/Engineer,$56K-$117K (Glassdoor est.),Thank you for your interest in joining the Cen...,4.7,Centauri\n4.7,"Beavercreek, OH","Chantilly, VA",501 - 1000,1999,...,0,0,0,0,other scientist,na,M,56000.0,117000,86500.0
406,520,Lead Data Engineer (Python),$66K-$123K (Glassdoor est.),Lead Data Engineer (Python)\n\nStrategic Emplo...,4.7,Strategic Employment Partners\n4.7,"San Francisco, CA","Los Angeles, CA",51 - 200,2006,...,0,0,0,0,data engineer,sr,na,66000.0,123000,94500.0
612,781,Lead Data Engineer (Python),$66K-$123K (Glassdoor est.),Lead Data Engineer (Python)\n\nStrategic Emplo...,4.7,Strategic Employment Partners\n4.7,"San Francisco, CA","Los Angeles, CA",51 - 200,2006,...,0,0,0,0,data engineer,sr,na,66000.0,123000,94500.0
117,132,Data Engineer,$65K-$125K (Glassdoor est.),"Job Description\n\nWhy consider OPI, and why d...",4.7,Object Partners\n4.7,"Minneapolis, MN","Minneapolis, MN",51 - 200,1996,...,0,1,0,0,data engineer,na,na,65000.0,125000,95000.0

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pddata = pd.read_csv('data_cleaned_2021.csv')data.index.name="Job ID"new_data = data[['Job Title','Salary Estimate','Company Name','Location','Size']]data[['Lower Salary','Upper Salary','Avg Salary(K)']]

SyntaxError: invalid non-printable character U+2028 (4069140581.py, line 3)

In [2]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [3]:
data = pd.read_csv('data_cleaned_2021.csv')data.index.name="Job ID"new_data = data[['Job Title','Salary Estimate','Company Name','Location','Size']]data[['Lower Salary','Upper Salary','Avg Salary(K)']]

/Users/administrator/.pyenv/versions/3.10.9/lib/python3.10/site-packages/IPython/core/inputtransformer2.py:604: UserWarning: `make_tokens_by_line` received a list of lines which do not have lineending markers ('\n', '\r', '\r\n', '\x0b', '\x0c'), behavior will be unspecified
  tokens_by_line = make_tokens_by_line(lines)

SyntaxError: invalid non-printable character U+2028 (1201119823.py, line 1)

In [4]:
data = pd.read_csv('data_cleaned_2021.csv')

In [5]:
data.index.name="Job ID"

In [6]:
new_data = data[['Job Title','Salary Estimate','Company Name','Location','Size']]

In [7]:
data[['Lower Salary','Upper Salary','Avg Salary(K)']]

        Lower Salary  Upper Salary  Avg Salary(K)
Job ID
0                 53            91           72.0
1                 63           112           87.5
2                 80            90           85.0
3                 56            97           76.5
4                 86           143          114.5
...              ...           ...            ...
737               58           111           84.5
738               72           133          102.5
739               56            91           73.5
740               95           160          127.5
741               61           126           93.5

[742 rows x 3 columns]

In [8]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    if ":" in salary_str:
        salary_str = salary_str.split(":")[1].strip()
    salary_range = salary_str.split(' ')[0]
    if "-" in salary_range:
        min_salary_str, max_salary_str = salary_range.split('-')
    else:
        min_salary_str = max_salary_str = salary_range

    def clean_and_convert(salary):
        try:
            return float(salary.replace('$','').split('K')[0]) * 1000
        except ValueError:
            return 0

    min_salary = clean_and_convert(min_salary_str)
    max_salary = clean_and_convert(max_salary_str)
        
    return pd.Series([min_salary, max_salary])
parse_salary(string)

0    53000.0
1    91000.0
dtype: float64

In [9]:
data['Salary Estimate'].apply(parse_salary)

              0         1
Job ID
0       53000.0   91000.0
1       63000.0  112000.0
2       80000.0   90000.0
3       56000.0   97000.0
4       86000.0  143000.0
...         ...       ...
737     58000.0  111000.0
738     72000.0  133000.0
739     56000.0   91000.0
740     95000.0  160000.0
741     61000.0  126000.0

[742 rows x 2 columns]

In [10]:
data[['Min Salary', 'Max Salary']] = data['Salary Estimate'].apply(parse_salary)

In [11]:
data['Average Salary'] = (data['Max Salary'] + data['Min Salary']) / 2

In [12]:
data['Job Title'] == "Data Scientist"

Job ID
0       True
1      False
2       True
3       True
4       True
       ...
737    False
738    False
739    False
740    False
741    False
Name: Job Title, Length: 742, dtype: bool

In [13]:
data[data['Job Title'] == "Data Scientist"]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
684,878,Data Scientist,$77K-$132K (Glassdoor est.),"Crossix is seeking intellectually curious, res...",3.5,Crossix Solutions\n3.5,"New York, NY","New York, NY",201 - 500,2005,...,0,0,0,0,data scientist,na,M,77000.0,132000.0,104500.0
685,879,Data Scientist,$51K-$88K (Glassdoor est.),Job Description Header 2 Data scientist Locati...,4.3,Solugenix Corporation\n4.3,"Phoenix, AZ","Brea, CA",201 - 500,1969,...,0,0,0,0,data scientist,na,na,51000.0,88000.0,69500.0
686,880,Data Scientist,$101K-$141K (Glassdoor est.),American Career College and West Coast Univers...,2.6,West Coast University\n2.6,"Irvine, CA","Irvine, CA",10000+,1997,...,1,0,0,0,data scientist,na,M,101000.0,141000.0,121000.0
700,901,Data Scientist,$65K-$113K (Glassdoor est.),DatamanUSA has an exciting opportunity for a D...,3.4,"DatamanUSA, LLC\n3.4","Olympia, WA","Centennial, CO",51 - 200,-1,...,0,0,0,0,data scientist,na,na,65000.0,113000.0,89000.0
714,924,Data Scientist,$96K-$161K (Glassdoor est.),SummaryProvide data management and statistical...,3.2,"Numeric, LLC\n3.2","Philadelphia, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,96000.0,161000.0,128500.0

In [14]:
data['Max Salary'] > 100000

Job ID
0      False
1       True
2      False
3      False
4       True
       ...
737     True
738     True
739    False
740     True
741     True
Name: Max Salary, Length: 742, dtype: bool

In [15]:
data[data['Max Salary'] > 100000]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
7,7,Data Scientist,$86K-$142K (Glassdoor est.),Advanced Analytics Lead Data Scientist\nOver...,3.8,Logic20/20\n3.8,"San Jose, CA","Seattle, WA",201 - 500,2005,...,0,0,0,0,data scientist,na,M,86000.0,142000.0,114000.0
9,9,Data Scientist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,data scientist,na,na,120000.0,160000.0,140000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
736,949,"Principal, Data Science - Advanced Analytics",$86K-$137K (Glassdoor est.),IQVIA is the leading human data science compan...,3.6,IQVIA\n3.6,"Plymouth Meeting, PA","Durham, NC",10000+,2017,...,0,0,0,0,data scientist,sr,M,86000.0,137000.0,111500.0
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,other scientist,na,M,61000.0,126000.0,93500.0

In [16]:
data[data['Founded'] > 2015]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
57,61,Data Scientist,$111K-$176K (Glassdoor est.),About Us\n\n\nInterested in working for a huma...,4.7,1904labs\n4.7,"Saint Louis, MO","Saint Louis, MO",51 - 200,2016,...,0,0,0,0,data scientist,na,na,111000.0,176000.0,143500.0
78,86,Data Scientist,$83K-$137K (Glassdoor est.),Overview\n\n\nPeraton is seeking a Senior Data...,3.3,Peraton\n3.3,"Chantilly, VA","Herndon, VA",1001 - 5000,2017,...,0,0,0,0,data scientist,na,na,83000.0,137000.0,110000.0
80,88,Data Scientist,$94K-$154K (Glassdoor est.),Nurx is looking for a Data Scientist who loves...,3.9,Nurx\n3.9,"San Francisco, CA","San Francisco, CA",51 - 200,2016,...,0,0,0,0,data scientist,na,na,94000.0,154000.0,124000.0
110,125,Data Engineer,$54K-$102K (Glassdoor est.),Sapphire Digital seeks a dynamic and driven mi...,3.4,Sapphire Digital\n3.4,"Lyndhurst, NJ","Lyndhurst, NJ",201 - 500,2019,...,0,0,0,0,data engineer,na,na,54000.0,102000.0,78000.0
127,146,Data Analytics Manager,$26K-$55K (Glassdoor est.),About You:\nWe are looking for a dedicated and...,3.8,Full Potential Solutions\n3.8,"Kansas City, MO","Kansas City, MO",501 - 1000,2017,...,0,0,0,0,Data scientist project manager,na,na,26000.0,55000.0,40500.0
138,161,Data Engineer,Employer Provided Salary:$120K-$145K,"Location: Tampa, FL\nTitle: Data Engineer\nTS/...",5.0,Gridiron IT\n5.0,"Tampa, FL","Reston, VA",51 - 200,2017,...,0,0,0,0,data engineer,na,na,120000.0,145000.0,132500.0
165,197,Medical Lab Scientist,$17-$24 Per Hour(Glassdoor est.),Overview\n\nAbout\n\n\nTower Health is a stron...,3.6,Tower Health\n3.6,"West Reading, PA","Reading, PA",5001 - 10000,2017,...,0,0,0,0,other scientist,na,na,17000.0,24000.0,20500.0
176,208,Principal Data Scientist with over 10 years ex...,Employer Provided Salary:$200K-$250K,Position Title: Principal Data Scientist\nLoca...,-1.0,CA-One Tech Cloud,"San Francisco, CA","Fremont, CA",51 - 200,2017,...,0,0,0,0,data scientist,sr,na,200000.0,250000.0,225000.0
229,281,Data Scientist,$66K-$111K (Glassdoor est.),About U.Group\nU.Group is an advanced technolo...,3.5,U.Group\n3.5,"Indianapolis, IN","Arlington, VA",201 - 500,2019,...,0,0,0,0,data scientist,na,M,66000.0,111000.0,88500.0
246,307,Medical Lab Scientist,$17-$24 Per Hour(Glassdoor est.),Overview\n\nAbout\n\n\nTower Health is a stron...,3.6,Tower Health\n3.6,"West Reading, PA","Reading, PA",5001 - 10000,2017,...,0,0,0,0,other scientist,na,na,17000.0,24000.0,20500.0
266,331,Principal Data Scientist with over 10 years ex...,Employer Provided Salary:$200K-$250K,Position Title: Principal Data Scientist\nLoca...,-1.0,CA-One Tech Cloud,"San Francisco, CA","Fremont, CA",51 - 200,2017,...,0,0,0,0,data scientist,sr,na,200000.0,250000.0,225000.0
320,403,Senior Data Scientist,$95K-$154K (Glassdoor est.),"Req Id: 2475\nJob location: Charlotte, NC, US,...",3.5,Brighthouse Financial\n3.5,"Charlotte, NC","Charlotte, NC",1001 - 5000,2017,...,0,0,0,0,data scientist,sr,M,95000.0,154000.0,124500.0
423,541,Data Scientist,$111K-$176K (Glassdoor est.),About Us\n\n\nInterested in working for a huma...,4.7,1904labs\n4.7,"Saint Louis, MO","Saint Louis, MO",51 - 200,2016,...,0,0,0,0,data scientist,na,na,111000.0,176000.0,143500.0
430,549,Data Scientist,$92K-$149K (Glassdoor est.),"As Scales first data scientist, you will lead...",3.5,Scale AI\n3.5,"San Francisco, CA","San Francisco, CA",51 - 200,2016,...,0,0,0,0,data scientist,na,P,92000.0,149000.0,120500.0
450,576,Senior Data Scientist,$95K-$154K (Glassdoor est.),"Req Id: 2475\nJob location: Charlotte, NC, US,...",3.5,Brighthouse Financial\n3.5,"Charlotte, NC","Charlotte, NC",1001 - 5000,2017,...,0,0,0,0,data scientist,sr,M,95000.0,154000.0,124500.0
455,582,Data Scientist,$61K-$100K (Glassdoor est.),Who we are:\n\n\nautomotiveMastermind currentl...,3.5,IHS Markit\n3.5,"New York, NY","London, United Kingdom",10000+,2016,...,0,0,0,0,data scientist,na,M,61000.0,100000.0,80500.0
553,705,"Principal, Data Science - Advanced Analytics",$86K-$137K (Glassdoor est.),IQVIA is the leading human data science compan...,3.6,IQVIA\n3.6,"Plymouth Meeting, PA","Durham, NC",10000+,2017,...,0,0,0,0,data scientist,sr,M,86000.0,137000.0,111500.0
587,747,Big Data Engineer,$84K-$153K (Glassdoor est.),Overview\n\n\nTechnology is constantly changin...,3.3,Peraton\n3.3,"Chantilly, VA","Herndon, VA",1001 - 5000,2017,...,0,0,0,0,data engineer,na,na,84000.0,153000.0,118500.0
736,949,"Principal, Data Science - Advanced Analytics",$86K-$137K (Glassdoor est.),IQVIA is the leading human data science compan...,3.6,IQVIA\n3.6,"Plymouth Meeting, PA","Durham, NC",10000+,2017,...,0,0,0,0,data scientist,sr,M,86000.0,137000.0,111500.0

In [17]:
data[data['Rating'] > 4]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
6,6,Data Scientist,$54K-$93K (Glassdoor est.),Job Description\n\n**Please only local candida...,4.1,ClearOne Advantage\n4.1,"Baltimore, MD","Baltimore, MD",501 - 1000,2008,...,0,0,0,0,data scientist,na,na,54000.0,93000.0,73500.0
9,9,Data Scientist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,data scientist,na,na,120000.0,160000.0,140000.0
11,11,Data Scientist,$64K-$106K (Glassdoor est.),"Secure our Nation, Ignite your Future\n\nSumma...",4.1,ManTech\n4.1,"Chantilly, VA","Herndon, VA",5001 - 10000,1968,...,0,0,0,0,data scientist,na,na,64000.0,106000.0,85000.0
13,13,Data Analyst,$46K-$85K (Glassdoor est.),"Are you an experienced Data Analyst, skilled a...",4.1,Yesler\n4.1,"Seattle, WA","Seattle, WA",201 - 500,2012,...,1,0,0,0,analyst,na,na,46000.0,85000.0,65500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
707,912,Senior Data Scientist,$108K-$171K (Glassdoor est.),"The Infrastructure, Architecture, and Tools te...",4.4,MathWorks\n4.4,"Natick, MA","Natick, MA",1001 - 5000,1984,...,1,0,0,0,data scientist,sr,M,108000.0,171000.0,139500.0
718,930,Sr. Data Engineer,$87K-$158K (Glassdoor est.),Join our team of Data Consultants and work on ...,4.5,Moser Consulting\n4.5,"Indianapolis, IN","Indianapolis, IN",51 - 200,1996,...,0,0,1,0,data engineer,sr,na,87000.0,158000.0,122500.0
727,940,Revenue Analytics Manager,$45K-$78K (Glassdoor est.),HOVER uses patented technology making it possi...,4.8,HOVER\n4.8,"San Francisco, CA","San Francisco, CA",51 - 200,2011,...,0,0,0,0,Data scientist project manager,na,na,45000.0,78000.0,61500.0
732,945,Machine Learning Engineer (NLP),$80K-$142K (Glassdoor est.),CK-12s mission is to provide free access to o...,4.1,CK-12 Foundation\n4.1,"Palo Alto, CA","Palo Alto, CA",1 - 50,2007,...,0,0,0,0,machine learning engineer,na,na,80000.0,142000.0,111000.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0

In [18]:
data[(data['Max Salary'] > 100000) & (data['Location'] == "New York")]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
7,7,Data Scientist,$86K-$142K (Glassdoor est.),Advanced Analytics Lead Data Scientist\nOver...,3.8,Logic20/20\n3.8,"San Jose, CA","Seattle, WA",201 - 500,2005,...,0,0,0,0,data scientist,na,M,86000.0,142000.0,114000.0
9,9,Data Scientist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,data scientist,na,na,120000.0,160000.0,140000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
736,949,"Principal, Data Science - Advanced Analytics",$86K-$137K (Glassdoor est.),IQVIA is the leading human data science compan...,3.6,IQVIA\n3.6,"Plymouth Meeting, PA","Durham, NC",10000+,2017,...,0,0,0,0,data scientist,sr,M,86000.0,137000.0,111500.0
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,other scientist,na,M,61000.0,126000.0,93500.0

In [20]:
data[(data['Job Title'] == "Data Scientist") & (data['Max Salary'] > 100000) & (data['Rating'] > 4)]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
9,9,Data Scientist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,data scientist,na,na,120000.0,160000.0,140000.0
11,11,Data Scientist,$64K-$106K (Glassdoor est.),"Secure our Nation, Ignite your Future\n\nSumma...",4.1,ManTech\n4.1,"Chantilly, VA","Herndon, VA",5001 - 10000,1968,...,0,0,0,0,data scientist,na,na,64000.0,106000.0,85000.0
23,23,Data Scientist,$63K-$105K (Glassdoor est.),Position Summary\nOur Data Science team is cur...,4.3,SMC 3\n4.3,"Louisville, KY","Peachtree City, GA",51 - 200,1935,...,0,0,0,0,data scientist,na,M,63000.0,105000.0,84000.0
34,35,Data Scientist,$85K-$140K (Glassdoor est.),New England Biolabs is seeking a Data Scientis...,4.7,New England Biolabs\n4.7,"Ipswich, MA","Ipswich, MA",201 - 500,1974,...,0,0,0,0,data scientist,na,na,85000.0,140000.0,112500.0
37,38,Data Scientist,$83K-$137K (Glassdoor est.),STR is a government research contractor specia...,4.7,Systems & Technology Research\n4.7,"Woburn, MA","Woburn, MA",201 - 500,2010,...,0,0,0,0,data scientist,na,P,83000.0,137000.0,110000.0
45,48,Data Scientist,Employer Provided Salary:$150K-$160K,"BPA Services, LLC is seeking a Computer/Data S...",5.0,BPA Services\n5.0,"Washington, DC","Alexandria, VA",unknown,-1,...,0,0,0,0,data scientist,na,na,150000.0,160000.0,155000.0
56,60,Data Scientist,$120K-$189K (Glassdoor est.),"About Netskope\n\nToday, there's more data and...",4.1,Netskope\n4.1,"San Francisco, CA","Santa Clara, CA",501 - 1000,2012,...,0,1,0,0,data scientist,na,P,120000.0,189000.0,154500.0
57,61,Data Scientist,$111K-$176K (Glassdoor est.),About Us\n\n\nInterested in working for a huma...,4.7,1904labs\n4.7,"Saint Louis, MO","Saint Louis, MO",51 - 200,2016,...,0,0,0,0,data scientist,na,na,111000.0,176000.0,143500.0
61,66,Data Scientist,$84K-$146K (Glassdoor est.),USEReady is looking for 2-3 Data Scientist to ...,4.3,USEReady\n4.3,"New York, NY","New York, NY",201 - 500,2011,...,0,0,0,0,data scientist,na,na,84000.0,146000.0,115000.0
79,87,Data Scientist,$86K-$141K (Glassdoor est.),Looking fora Data Scientis/Architect who has 8...,4.4,Pactera\n4.4,"San Jose, CA","Beijing, China",10000+,1995,...,0,0,0,0,data scientist,na,na,86000.0,141000.0,113500.0
82,90,Data Scientist,$100K-$160K (Glassdoor est.),Are you passionate about providing real impact...,4.5,Johns Hopkins University Applied Physics Labor...,"Laurel, MD","Laurel, MD",5001 - 10000,1942,...,0,0,0,0,data scientist,na,na,100000.0,160000.0,130000.0
88,96,Data Scientist,$64K-$107K (Glassdoor est.),Are you performance-driven and want your impac...,4.2,goTRG\n4.2,"Miami, FL","Miami, FL",501 - 1000,2008,...,0,0,0,0,data scientist,na,na,64000.0,107000.0,85500.0
101,113,Data Scientist,$61K-$110K (Glassdoor est.),"About Us\n\nFounded in Syracuse in 1992, we ar...",4.7,Rapid Response Monitoring\n4.7,"Syracuse, NY","Syracuse, NY",501 - 1000,1992,...,0,0,0,0,data scientist,na,M,61000.0,110000.0,85500.0
109,124,Data Scientist,$121K-$193K (Glassdoor est.),The world's largest and fastest-growing compan...,4.5,Demandbase\n4.5,"San Francisco, CA","San Francisco, CA",201 - 500,2006,...,0,0,0,0,data scientist,na,na,121000.0,193000.0,157000.0
112,127,Data Scientist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,data scientist,na,na,120000.0,160000.0,140000.0
120,138,Data Scientist,$77K-$124K (Glassdoor est.),Company Description:\nWhats it like to work at...,4.4,Quick Base\n4.4,"Cambridge, MA","Cambridge, MA",201 - 500,1999,...,1,0,0,0,data scientist,na,na,77000.0,124000.0,100500.0
129,148,Data Scientist,$60K-$102K (Glassdoor est.),"Who We Are!\n\nAt Maven Wave, we are relentles...",4.4,Maven Wave Partners\n4.4,"Chicago, IL","Chicago, IL",201 - 500,2008,...,0,0,0,0,data scientist,na,na,60000.0,102000.0,81000.0
136,158,Data Scientist,$64K-$106K (Glassdoor est.),"Secure our Nation, Ignite your Future\n\nSumma...",4.1,ManTech\n4.1,"Chantilly, VA","Herndon, VA",5001 - 10000,1968,...,0,0,0,0,data scientist,na,na,64000.0,106000.0,85000.0
232,285,Data Scientist,$63K-$105K (Glassdoor est.),Position Summary\nOur Data Science team is cur...,4.3,SMC 3\n4.3,"Louisville, KY","Peachtree City, GA",51 - 200,1935,...,0,0,0,0,data scientist,na,M,63000.0,105000.0,84000.0
241,299,Data Scientist,$61K-$106K (Glassdoor est.),Bakery is a creative and R&D company headquart...,4.3,Bakery Agency\n4.3,"Austin, TX","Austin, TX",1 - 50,2010,...,0,0,0,1,data scientist,na,na,61000.0,106000.0,83500.0
327,413,Data Scientist,$85K-$140K (Glassdoor est.),New England Biolabs is seeking a Data Scientis...,4.7,New England Biolabs\n4.7,"Ipswich, MA","Ipswich, MA",201 - 500,1974,...,0,0,0,0,data scientist,na,na,85000.0,140000.0,112500.0
373,477,Data Scientist,Employer Provided Salary:$150K-$160K,"BPA Services, LLC is seeking a Computer/Data S...",5.0,BPA Services\n5.0,"Washington, DC","Alexandria, VA",unknown,-1,...,0,0,0,0,data scientist,na,na,150000.0,160000.0,155000.0
423,541,Data Scientist,$111K-$176K (Glassdoor est.),About Us\n\n\nInterested in working for a huma...,4.7,1904labs\n4.7,"Saint Louis, MO","Saint Louis, MO",51 - 200,2016,...,0,0,0,0,data scientist,na,na,111000.0,176000.0,143500.0
424,542,Data Scientist,$75K-$127K (Glassdoor est.),Title: Data Scientist\n\nLocation: Springfield...,5.0,Royce Geospatial\n5.0,"Springfield, VA","Arlington, VA",51 - 200,2014,...,0,0,0,0,data scientist,na,na,75000.0,127000.0,101000.0
435,556,Data Scientist,$65K-$106K (Glassdoor est.),About Us:\n\nHeadquartered in beautiful Santa ...,4.7,HG Insights\n4.7,"Santa Barbara, CA","Santa Barbara, CA",51 - 200,2010,...,0,0,0,0,data scientist,na,P,65000.0,106000.0,85500.0
447,572,Data Scientist,$80K-$134K (Glassdoor est.),STR is a government research contractor specia...,4.7,Systems & Technology Research\n4.7,"Arlington, VA","Woburn, MA",201 - 500,2010,...,0,0,0,0,data scientist,na,P,80000.0,134000.0,107000.0
448,573,Data Scientist,$120K-$189K (Glassdoor est.),"About Netskope\n\nToday, there's more data and...",4.1,Netskope\n4.1,"Santa Clara, CA","Santa Clara, CA",501 - 1000,2012,...,0,1,0,0,data scientist,na,P,120000.0,189000.0,154500.0
459,587,Data Scientist,$112K-$179K (Glassdoor est.),"Hi,\n\nGreetings of the Day!!!\n\nLooking for ...",4.8,TechProjects\n4.8,"New York, NY","North Brunswick, NJ",1 - 50,2011,...,0,0,0,0,data scientist,na,na,112000.0,179000.0,145500.0
461,589,Data Scientist,$75K-$126K (Glassdoor est.),PeoplesBank is the largest mutually chartered ...,4.2,PeoplesBank\n4.2,"Holyoke, MA","Holyoke, MA",201 - 500,1885,...,0,0,0,0,data scientist,na,M,75000.0,126000.0,100500.0
465,595,Data Scientist,$70K-$118K (Glassdoor est.),"Hello Associates,\n\n*****Greetings from Conch...",4.6,"Conch Technologies, Inc\n4.6","Waltham, MA","Memphis, TN",51 - 200,-1,...,1,0,0,0,data scientist,na,M,70000.0,118000.0,94000.0
574,733,Data Scientist,$84K-$146K (Glassdoor est.),USEReady is looking for 2-3 Data Scientist to ...,4.3,USEReady\n4.3,"New York, NY","New York, NY",201 - 500,2011,...,0,0,0,0,data scientist,na,na,84000.0,146000.0,115000.0

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('data_cleaned_2021.csv')

In [3]:
data.index.name="Job ID"

In [4]:
new_data = data[['Job Title','Salary Estimate','Company Name','Location','Size']]

In [5]:
data[['Lower Salary','Upper Salary','Avg Salary(K)']]

        Lower Salary  Upper Salary  Avg Salary(K)
Job ID
0                 53            91           72.0
1                 63           112           87.5
2                 80            90           85.0
3                 56            97           76.5
4                 86           143          114.5
...              ...           ...            ...
737               58           111           84.5
738               72           133          102.5
739               56            91           73.5
740               95           160          127.5
741               61           126           93.5

[742 rows x 3 columns]

In [6]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    if ":" in salary_str:
        salary_str = salary_str.split(":")[1].strip()
    salary_range = salary_str.split(' ')[0]
    if "-" in salary_range:
        min_salary_str, max_salary_str = salary_range.split('-')
    else:
        min_salary_str = max_salary_str = salary_range

    def clean_and_convert(salary):
        try:
            return float(salary.replace('$','').split('K')[0]) * 1000
        except ValueError:
            return 0

    min_salary = clean_and_convert(min_salary_str)
    max_salary = clean_and_convert(max_salary_str)
        
    return pd.Series([min_salary, max_salary])
parse_salary(string)

0    53000.0
1    91000.0
dtype: float64

In [7]:
data['Salary Estimate'].apply(parse_salary)

              0         1
Job ID
0       53000.0   91000.0
1       63000.0  112000.0
2       80000.0   90000.0
3       56000.0   97000.0
4       86000.0  143000.0
...         ...       ...
737     58000.0  111000.0
738     72000.0  133000.0
739     56000.0   91000.0
740     95000.0  160000.0
741     61000.0  126000.0

[742 rows x 2 columns]

In [8]:
data[['Min Salary', 'Max Salary']] = data['Salary Estimate'].apply(parse_salary)

In [9]:
data['Average Salary'] = (data['Max Salary'] + data['Min Salary']) / 2

In [12]:
data[(data['Rating'] > 4.5) | (data['Max Salary'] > 100000)]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
7,7,Data Scientist,$86K-$142K (Glassdoor est.),Advanced Analytics Lead Data Scientist\nOver...,3.8,Logic20/20\n3.8,"San Jose, CA","Seattle, WA",201 - 500,2005,...,0,0,0,0,data scientist,na,M,86000.0,142000.0,114000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
736,949,"Principal, Data Science - Advanced Analytics",$86K-$137K (Glassdoor est.),IQVIA is the leading human data science compan...,3.6,IQVIA\n3.6,"Plymouth Meeting, PA","Durham, NC",10000+,2017,...,0,0,0,0,data scientist,sr,M,86000.0,137000.0,111500.0
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,other scientist,na,M,61000.0,126000.0,93500.0

In [13]:
data[(data['Job Title'] == "Data Scientist") | (data['Location'] == "Dallas, TX") | (data['Rating'] > 4.5)]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
686,880,Data Scientist,$101K-$141K (Glassdoor est.),American Career College and West Coast Univers...,2.6,West Coast University\n2.6,"Irvine, CA","Irvine, CA",10000+,1997,...,1,0,0,0,data scientist,na,M,101000.0,141000.0,121000.0
693,893,Senior Data Scientist,Employer Provided Salary:$120K-$140K,"SkySync is a dynamic, fast-paced, venture-back...",5.0,SkySync\n5.0,"Ann Arbor, MI","Ann Arbor, MI",51 - 200,2011,...,0,0,0,0,data scientist,sr,M,120000.0,140000.0,130000.0
700,901,Data Scientist,$65K-$113K (Glassdoor est.),DatamanUSA has an exciting opportunity for a D...,3.4,"DatamanUSA, LLC\n3.4","Olympia, WA","Centennial, CO",51 - 200,-1,...,0,0,0,0,data scientist,na,na,65000.0,113000.0,89000.0
714,924,Data Scientist,$96K-$161K (Glassdoor est.),SummaryProvide data management and statistical...,3.2,"Numeric, LLC\n3.2","Philadelphia, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,96000.0,161000.0,128500.0
727,940,Revenue Analytics Manager,$45K-$78K (Glassdoor est.),HOVER uses patented technology making it possi...,4.8,HOVER\n4.8,"San Francisco, CA","San Francisco, CA",51 - 200,2011,...,0,0,0,0,Data scientist project manager,na,na,45000.0,78000.0,61500.0

In [15]:
# data[(data['Location'] == "Dallas, TX") | (data['Location'] == "New York, NY") | (data['Location'] == "San Jose, CA")]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
7,7,Data Scientist,$86K-$142K (Glassdoor est.),Advanced Analytics Lead Data Scientist\nOver...,3.8,Logic20/20\n3.8,"San Jose, CA","Seattle, WA",201 - 500,2005,...,0,0,0,0,data scientist,na,M,86000.0,142000.0,114000.0
9,9,Data Scientist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,data scientist,na,na,120000.0,160000.0,140000.0
10,10,Data Scientist,$126K-$201K (Glassdoor est.),"At Wish, our Data Science & Engineering team i...",3.5,Wish\n3.5,"San Jose, CA","San Francisco, CA",501 - 1000,2011,...,0,0,0,0,data scientist,na,na,126000.0,201000.0,163500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
697,898,Lead Data Analyst,$32K-$62K (Glassdoor est.),JOB DESCRIPTION:\n\nSignpost is looking for a ...,3.9,Signpost\n3.9,"New York, NY","New York, NY",201 - 500,2010,...,0,0,0,0,analyst,sr,na,32000.0,62000.0,47000.0
698,899,Data Science Engineer - Mobile,$116K-$208K (Glassdoor est.),Mobile is a top strategic priority for Adobe. ...,4.0,Adobe\n4.0,"San Jose, CA","San Jose, CA",10000+,1982,...,1,0,0,0,data scientist,na,M,116000.0,208000.0,162000.0
702,904,Senior Data Scientist - R&D Oncology,$102K-$172K (Glassdoor est.),"At AstraZeneca,we work together to deliver inn...",3.9,AstraZeneca\n3.9,"New York, NY","Cambridge, United Kingdom",10000+,1913,...,0,0,0,0,data scientist,sr,P,102000.0,172000.0,137000.0
709,914,Machine Learning Engineer,$91K-$159K (Glassdoor est.),We are seeking a highly-experienced ML Enginee...,3.2,Information Builders\n3.2,"New York, NY","New York, NY",1001 - 5000,1975,...,0,0,0,0,machine learning engineer,na,M,91000.0,159000.0,125000.0
721,933,Business Data Analyst,$36K-$71K (Glassdoor est.),(We are unable to sponsor for this role now or...,3.8,Fareportal\n3.8,"New York, NY","New York, NY",1001 - 5000,2002,...,1,0,0,1,analyst,na,M,36000.0,71000.0,53500.0

In [17]:
data[data["Location"].isin(["New York, NY","Dallas, TX","San Jose, CA"])]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
7,7,Data Scientist,$86K-$142K (Glassdoor est.),Advanced Analytics Lead Data Scientist\nOver...,3.8,Logic20/20\n3.8,"San Jose, CA","Seattle, WA",201 - 500,2005,...,0,0,0,0,data scientist,na,M,86000.0,142000.0,114000.0
9,9,Data Scientist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,data scientist,na,na,120000.0,160000.0,140000.0
10,10,Data Scientist,$126K-$201K (Glassdoor est.),"At Wish, our Data Science & Engineering team i...",3.5,Wish\n3.5,"San Jose, CA","San Francisco, CA",501 - 1000,2011,...,0,0,0,0,data scientist,na,na,126000.0,201000.0,163500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
697,898,Lead Data Analyst,$32K-$62K (Glassdoor est.),JOB DESCRIPTION:\n\nSignpost is looking for a ...,3.9,Signpost\n3.9,"New York, NY","New York, NY",201 - 500,2010,...,0,0,0,0,analyst,sr,na,32000.0,62000.0,47000.0
698,899,Data Science Engineer - Mobile,$116K-$208K (Glassdoor est.),Mobile is a top strategic priority for Adobe. ...,4.0,Adobe\n4.0,"San Jose, CA","San Jose, CA",10000+,1982,...,1,0,0,0,data scientist,na,M,116000.0,208000.0,162000.0
702,904,Senior Data Scientist - R&D Oncology,$102K-$172K (Glassdoor est.),"At AstraZeneca,we work together to deliver inn...",3.9,AstraZeneca\n3.9,"New York, NY","Cambridge, United Kingdom",10000+,1913,...,0,0,0,0,data scientist,sr,P,102000.0,172000.0,137000.0
709,914,Machine Learning Engineer,$91K-$159K (Glassdoor est.),We are seeking a highly-experienced ML Enginee...,3.2,Information Builders\n3.2,"New York, NY","New York, NY",1001 - 5000,1975,...,0,0,0,0,machine learning engineer,na,M,91000.0,159000.0,125000.0
721,933,Business Data Analyst,$36K-$71K (Glassdoor est.),(We are unable to sponsor for this role now or...,3.8,Fareportal\n3.8,"New York, NY","New York, NY",1001 - 5000,2002,...,1,0,0,1,analyst,na,M,36000.0,71000.0,53500.0

In [18]:
data[data['Max Salary'].between(100000,150000)]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
7,7,Data Scientist,$86K-$142K (Glassdoor est.),Advanced Analytics Lead Data Scientist\nOver...,3.8,Logic20/20\n3.8,"San Jose, CA","Seattle, WA",201 - 500,2005,...,0,0,0,0,data scientist,na,M,86000.0,142000.0,114000.0
11,11,Data Scientist,$64K-$106K (Glassdoor est.),"Secure our Nation, Ignite your Future\n\nSumma...",4.1,ManTech\n4.1,"Chantilly, VA","Herndon, VA",5001 - 10000,1968,...,0,0,0,0,data scientist,na,na,64000.0,106000.0,85000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
735,948,Data Engineer,$62K-$113K (Glassdoor est.),Do you find data architecture exciting? Does b...,3.9,Fivestars\n3.9,"San Francisco, CA","San Francisco, CA",201 - 500,2011,...,0,0,0,0,data engineer,na,P,62000.0,113000.0,87500.0
736,949,"Principal, Data Science - Advanced Analytics",$86K-$137K (Glassdoor est.),IQVIA is the leading human data science compan...,3.6,IQVIA\n3.6,"Plymouth Meeting, PA","Durham, NC",10000+,2017,...,0,0,0,0,data scientist,sr,M,86000.0,137000.0,111500.0
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,other scientist,na,M,61000.0,126000.0,93500.0

In [19]:
data[data['Rating'].between(4.5,5)]

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
9,9,Data Scientist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,data scientist,na,na,120000.0,160000.0,140000.0
29,30,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
34,35,Data Scientist,$85K-$140K (Glassdoor est.),New England Biolabs is seeking a Data Scientis...,4.7,New England Biolabs\n4.7,"Ipswich, MA","Ipswich, MA",201 - 500,1974,...,0,0,0,0,data scientist,na,na,85000.0,140000.0,112500.0
37,38,Data Scientist,$83K-$137K (Glassdoor est.),STR is a government research contractor specia...,4.7,Systems & Technology Research\n4.7,"Woburn, MA","Woburn, MA",201 - 500,2010,...,0,0,0,0,data scientist,na,P,83000.0,137000.0,110000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
633,809,Research Scientist or Senior Research Scientis...,$81K-$161K (Glassdoor est.),25 years of innovation\n\nThe Computer Vision ...,4.6,Mitsubishi Electric Research Labs\n4.6,"Cambridge, MA","Cambridge, MA",51 - 200,1991,...,0,0,0,0,other scientist,sr,P,81000.0,161000.0,121000.0
637,815,Research Scientist / Principal Research Scient...,$115K-$220K (Glassdoor est.),Mitsubishi Electric Research Laboratories (MER...,4.6,Mitsubishi Electric Research Labs\n4.6,"Cambridge, MA","Cambridge, MA",51 - 200,1991,...,0,0,0,0,other scientist,sr,P,115000.0,220000.0,167500.0
693,893,Senior Data Scientist,Employer Provided Salary:$120K-$140K,"SkySync is a dynamic, fast-paced, venture-back...",5.0,SkySync\n5.0,"Ann Arbor, MI","Ann Arbor, MI",51 - 200,2011,...,0,0,0,0,data scientist,sr,M,120000.0,140000.0,130000.0
718,930,Sr. Data Engineer,$87K-$158K (Glassdoor est.),Join our team of Data Consultants and work on ...,4.5,Moser Consulting\n4.5,"Indianapolis, IN","Indianapolis, IN",51 - 200,1996,...,0,0,1,0,data engineer,sr,na,87000.0,158000.0,122500.0
727,940,Revenue Analytics Manager,$45K-$78K (Glassdoor est.),HOVER uses patented technology making it possi...,4.8,HOVER\n4.8,"San Francisco, CA","San Francisco, CA",51 - 200,2011,...,0,0,0,0,Data scientist project manager,na,na,45000.0,78000.0,61500.0

In [20]:
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,other scientist,na,P,56000.0,91000.0,73500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,other scientist,na,M,61000.0,126000.0,93500.0

In [24]:
data.iloc[737]

index                                                               950
Job Title                      Sr Scientist, Immuno-Oncology - Oncology
Salary Estimate                             $58K-$111K (Glassdoor est.)
Job Description       Site Name: USA - Massachusetts - Cambridge\nPo...
Rating                                                              3.9
Company Name                                                   GSK\n3.9
Location                                                  Cambridge, MA
Headquarters                                  Brentford, United Kingdom
Size                                                            10000+
Founded                                                            1830
Type of ownership                                      Company - Public
Industry                                      Biotech & Pharmaceuticals
Sector                                        Biotech & Pharmaceuticals
Revenue                                              $10+ billion (USD)
Competitors                                  Pfizer, AstraZeneca, Merck
Hourly                                                                0
Employer provided                                                     0
Lower Salary                                                         58
Upper Salary                                                        111
Avg Salary(K)                                                      84.5
company_txt                                                         GSK
Job Location                                                         MA
Age                                                                 191
Python                                                                0
spark                                                                 0
aws                                                                   1
excel                                                                 0
sql                                                                   0
sas                                                                   0
keras                                                                 0
pytorch                                                               0
scikit                                                                0
tensor                                                                0
hadoop                                                                0
tableau                                                               0
bi                                                                    0
flink                                                                 0
mongo                                                                 0
google_an                                                             0
job_title_sim                                           other scientist
seniority_by_title                                                   sr
Degree                                                                M
Min Salary                                                      58000.0
Max Salary                                                     111000.0
Average Salary                                                  84500.0
Name: 737, dtype: object

In [26]:
data_copy = data.set_index('Job Title')
data_copy.loc['Data Scientist']

,index,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job Title,,,,,,,,,,,,,,,,,,,,,
Data Scientist,0,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,Company - Private,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
Data Scientist,2,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,Company - Private,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
Data Scientist,3,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,Government,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
Data Scientist,4,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,Company - Private,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
Data Scientist,5,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,Company - Public,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Data Scientist,878,$77K-$132K (Glassdoor est.),"Crossix is seeking intellectually curious, res...",3.5,Crossix Solutions\n3.5,"New York, NY","New York, NY",201 - 500,2005,Company - Public,...,0,0,0,0,data scientist,na,M,77000.0,132000.0,104500.0
Data Scientist,879,$51K-$88K (Glassdoor est.),Job Description Header 2 Data scientist Locati...,4.3,Solugenix Corporation\n4.3,"Phoenix, AZ","Brea, CA",201 - 500,1969,Company - Private,...,0,0,0,0,data scientist,na,na,51000.0,88000.0,69500.0
Data Scientist,880,$101K-$141K (Glassdoor est.),American Career College and West Coast Univers...,2.6,West Coast University\n2.6,"Irvine, CA","Irvine, CA",10000+,1997,Company - Private,...,1,0,0,0,data scientist,na,M,101000.0,141000.0,121000.0
Data Scientist,901,$65K-$113K (Glassdoor est.),DatamanUSA has an exciting opportunity for a D...,3.4,"DatamanUSA, LLC\n3.4","Olympia, WA","Centennial, CO",51 - 200,-1,Company - Private,...,0,0,0,0,data scientist,na,na,65000.0,113000.0,89000.0
Data Scientist,924,$96K-$161K (Glassdoor est.),SummaryProvide data management and statistical...,3.2,"Numeric, LLC\n3.2","Philadelphia, PA","Chadds Ford, PA",1 - 50,-1,Company - Private,...,0,0,0,0,data scientist,na,na,96000.0,161000.0,128500.0

In [27]:
data_copy = data.set_index('Job Title')
data_copy.loc[['Data Scientist','Senior Data Engineer']]

,index,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job Title,,,,,,,,,,,,,,,,,,,,,
Data Scientist,0,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,Company - Private,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
Data Scientist,2,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,Company - Private,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
Data Scientist,3,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,Government,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
Data Scientist,4,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,Company - Private,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
Data Scientist,5,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,Company - Public,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Senior Data Engineer,750,$97K-$180K (Glassdoor est.),Position Overview: From software hacking to ha...,4.7,Praetorian\n4.7,"Austin, TX","Austin, TX",51 - 200,2010,Company - Private,...,0,0,0,0,data engineer,sr,na,97000.0,180000.0,138500.0
Senior Data Engineer,806,$97K-$181K (Glassdoor est.),About Us\n\nFigure Eight is the essential Huma...,3.9,Figure Eight\n3.9,"San Francisco, CA","San Francisco, CA",51 - 200,2008,Company - Public,...,0,0,0,0,data engineer,sr,na,97000.0,181000.0,139000.0
Senior Data Engineer,807,$100K-$173K (Glassdoor est.),Position Title: Senior Data Engineer\n\nPositi...,3.9,Tapjoy\n3.9,"San Francisco, CA","San Francisco, CA",201 - 500,2007,Company - Private,...,0,0,0,0,data engineer,sr,na,100000.0,173000.0,136500.0
Senior Data Engineer,910,$76K-$142K (Glassdoor est.),Sr. Data Engineer FTE for Franklin\n\nThere ar...,3.2,Equian LLC\n3.2,"Franklin, TN","Indianapolis, IN",1001 - 5000,2004,Company - Private,...,0,0,0,0,data engineer,sr,na,76000.0,142000.0,109000.0
Senior Data Engineer,951,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,Company - Public,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0

In [32]:
data_copy = data.set_index('Job Title')
data_copy.iloc[[10,20]]

,index,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job Title,,,,,,,,,,,,,,,,,,,,,
Data Scientist,10,$126K-$201K (Glassdoor est.),"At Wish, our Data Science & Engineering team i...",3.5,Wish\n3.5,"San Jose, CA","San Francisco, CA",501 - 1000,2011,Company - Private,...,0,0,0,0,data scientist,na,na,126000.0,201000.0,163500.0
Data Scientist,20,$81K-$130K (Glassdoor est.),About Our Team\n\nWe understand that the first...,3.2,Porch\n3.2,"Seattle, WA","Seattle, WA",201 - 500,2012,Company - Private,...,0,0,0,0,data scientist,na,M,81000.0,130000.0,105500.0

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('data_cleaned_2021.csv')

In [3]:
data.index.name="Job ID"

In [4]:
new_data = data[['Job Title','Salary Estimate','Company Name','Location','Size']]

In [5]:
data[['Lower Salary','Upper Salary','Avg Salary(K)']]

        Lower Salary  Upper Salary  Avg Salary(K)
Job ID
0                 53            91           72.0
1                 63           112           87.5
2                 80            90           85.0
3                 56            97           76.5
4                 86           143          114.5
...              ...           ...            ...
737               58           111           84.5
738               72           133          102.5
739               56            91           73.5
740               95           160          127.5
741               61           126           93.5

[742 rows x 3 columns]

In [6]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    if ":" in salary_str:
        salary_str = salary_str.split(":")[1].strip()
    salary_range = salary_str.split(' ')[0]
    if "-" in salary_range:
        min_salary_str, max_salary_str = salary_range.split('-')
    else:
        min_salary_str = max_salary_str = salary_range

    def clean_and_convert(salary):
        try:
            return float(salary.replace('$','').split('K')[0]) * 1000
        except ValueError:
            return 0

    min_salary = clean_and_convert(min_salary_str)
    max_salary = clean_and_convert(max_salary_str)
        
    return pd.Series([min_salary, max_salary])
parse_salary(string)

0    53000.0
1    91000.0
dtype: float64

In [7]:
data['Salary Estimate'].apply(parse_salary)

              0         1
Job ID
0       53000.0   91000.0
1       63000.0  112000.0
2       80000.0   90000.0
3       56000.0   97000.0
4       86000.0  143000.0
...         ...       ...
737     58000.0  111000.0
738     72000.0  133000.0
739     56000.0   91000.0
740     95000.0  160000.0
741     61000.0  126000.0

[742 rows x 2 columns]

In [8]:
data[['Min Salary', 'Max Salary']] = data['Salary Estimate'].apply(parse_salary)

In [9]:
data['Average Salary'] = (data['Max Salary'] + data['Min Salary']) / 2

In [10]:
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,other scientist,na,P,56000.0,91000.0,73500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,other scientist,na,M,61000.0,126000.0,93500.0

In [14]:
data.loc[0, 'Job Title'] = "Data Specialist"
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Specialist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,other scientist,na,P,56000.0,91000.0,73500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,other scientist,na,M,61000.0,126000.0,93500.0

In [19]:
data['Job Title'].replace("Data Scientist","Data Specialist")

Job ID
0                                        Data Specialist
1                              Healthcare Data Scientist
2                                        Data Specialist
3                                        Data Specialist
4                                        Data Specialist
                             ...
737             Sr Scientist, Immuno-Oncology - Oncology
738                                 Senior Data Engineer
739    Project Scientist - Auton Lab, Robotics Institute
740                                 Data Science Manager
741            Research Scientist  Security and Privacy
Name: Job Title, Length: 742, dtype: object

In [16]:
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Specialist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,other scientist,na,P,56000.0,91000.0,73500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,other scientist,na,M,61000.0,126000.0,93500.0

In [20]:
data['Job Title'] = data['Job Title'].replace("Data Scientist","Data Specialist")

In [21]:
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Specialist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Specialist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Specialist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Specialist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,0,0,0,0,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,0,0,0,0,data engineer,sr,na,72000.0,133000.0,102500.0
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,0,0,0,0,other scientist,na,P,56000.0,91000.0,73500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,0,0,0,0,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,0,0,0,0,other scientist,na,M,61000.0,126000.0,93500.0

In [22]:
data.head(40)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Specialist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Specialist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Specialist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Specialist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Specialist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
6,6,Data Specialist,$54K-$93K (Glassdoor est.),Job Description\n\n**Please only local candida...,4.1,ClearOne Advantage\n4.1,"Baltimore, MD","Baltimore, MD",501 - 1000,2008,...,0,0,0,0,data scientist,na,na,54000.0,93000.0,73500.0
7,7,Data Specialist,$86K-$142K (Glassdoor est.),Advanced Analytics Lead Data Scientist\nOver...,3.8,Logic20/20\n3.8,"San Jose, CA","Seattle, WA",201 - 500,2005,...,0,0,0,0,data scientist,na,M,86000.0,142000.0,114000.0
8,8,Research Scientist,$38K-$84K (Glassdoor est.),SUMMARY\n\nThe Research Scientist I will be ta...,3.3,Rochester Regional Health\n3.3,"Rochester, NY","Rochester, NY",10000+,2014,...,0,0,0,0,other scientist,na,P,38000.0,84000.0,61000.0
9,9,Data Specialist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,data scientist,na,na,120000.0,160000.0,140000.0
10,10,Data Specialist,$126K-$201K (Glassdoor est.),"At Wish, our Data Science & Engineering team i...",3.5,Wish\n3.5,"San Jose, CA","San Francisco, CA",501 - 1000,2011,...,0,0,0,0,data scientist,na,na,126000.0,201000.0,163500.0
11,11,Data Specialist,$64K-$106K (Glassdoor est.),"Secure our Nation, Ignite your Future\n\nSumma...",4.1,ManTech\n4.1,"Chantilly, VA","Herndon, VA",5001 - 10000,1968,...,0,0,0,0,data scientist,na,na,64000.0,106000.0,85000.0
12,12,Staff Data Scientist - Technology,$106K-$172K (Glassdoor est.),Position Summary...\nDrives the execution of m...,3.2,Walmart\n3.2,"Plano, TX","Bentonville, AR",10000+,1962,...,0,0,0,0,data scientist,na,M,106000.0,172000.0,139000.0
13,13,Data Analyst,$46K-$85K (Glassdoor est.),"Are you an experienced Data Analyst, skilled a...",4.1,Yesler\n4.1,"Seattle, WA","Seattle, WA",201 - 500,2012,...,1,0,0,0,analyst,na,na,46000.0,85000.0,65500.0
14,14,Data Specialist,$83K-$144K (Glassdoor est.),Job Description\n\n\nTakeda is looking for a D...,3.7,Takeda Pharmaceuticals\n3.7,"Cambridge, MA","OSAKA, Japan",10000+,1781,...,0,0,0,0,data scientist,na,M,83000.0,144000.0,113500.0
15,15,Data Engineer I,$102K-$190K (Glassdoor est.),This opportunity is within Audibles Data Engin...,3.6,Audible\n3.6,"Newark, NJ","Newark, NJ",1001 - 5000,1995,...,0,0,0,0,data engineer,na,na,102000.0,190000.0,146000.0
16,16,"Scientist I/II, Biology",$67K-$137K (Glassdoor est.),"Scientist I/II, Biology\n\nCambridge, MA\n\nBI...",3.9,Blueprint Medicines\n3.9,"Cambridge, MA","Cambridge, MA",51 - 200,2011,...,0,0,0,0,other scientist,na,P,67000.0,137000.0,102000.0
17,17,Customer Data Scientist,$118K-$189K (Glassdoor est.),Company Overview\n\nH2O.ai is the open source ...,4.3,h2o.ai\n4.3,"Mountain View, CA","Mountain View, CA",201 - 500,2011,...,0,0,0,0,data scientist,na,M,118000.0,189000.0,153500.0
18,18,Data Scientist - Health Data Analytics,$110K-$175K (Glassdoor est.),"At Nuna, our mission is to make high-quality h...",4.2,Nuna\n4.2,"San Francisco, CA","San Francisco, CA",51 - 200,2010,...,0,0,0,0,data scientist,na,na,110000.0,175000.0,142500.0
19,19,Data Specialist,$64K-$111K (Glassdoor est.),"Pinnacol Assurance does just one thing, and do...",4.0,Pinnacol Assurance\n4.0,"Denver, CO","Denver, CO",501 - 1000,1915,...,0,0,0,0,data scientist,na,M,64000.0,111000.0,87500.0
20,20,Data Specialist,$81K-$130K (Glassdoor est.),About Our Team\n\nWe understand that the first...,3.2,Porch\n3.2,"Seattle, WA","Seattle, WA",201 - 500,2012,...,0,0,0,0,data scientist,na,M,81000.0,130000.0,105500.0
21,21,Senior Data Scientist / Machine Learning,$73K-$119K (Glassdoor est.),IMMEDIATE NEED FOR A SENIOR DATA SCIENTIST / M...,3.9,Health IQ\n3.9,"Dallas, TX","Mountain View, CA",201 - 500,2013,...,0,0,0,0,data scientist,sr,P,73000.0,119000.0,96000.0
22,22,Data Scientist - Quantitative,$86K-$139K (Glassdoor est.),Truckstop.com is hiring a Data Scientist for o...,3.8,Truckstop.com\n3.8,"Chicago, IL","New Plymouth, ID",501 - 1000,1995,...,0,0,1,0,data scientist,na,M,86000.0,139000.0,112500.0
23,23,Data Specialist,$63K-$105K (Glassdoor est.),Position Summary\nOur Data Science team is cur...,4.3,SMC 3\n4.3,"Louisville, KY","Peachtree City, GA",51 - 200,1935,...,0,0,0,0,data scientist,na,M,63000.0,105000.0,84000.0
24,25,Data Specialist,$109K-$177K (Glassdoor est.),Are you passionate about solving challenging p...,4.0,Novetta\n4.0,"Herndon, VA","Mc Lean, VA",501 - 1000,2012,...,0,0,0,0,data scientist,na,na,109000.0,177000.0,143000.0
25,26,Digital Health Data Scientist,$63K-$110K (Glassdoor est.),ROLE SUMMARY\n\nThe Digital Health Data Scient...,4.0,Pfizer\n4.0,"Cambridge, MA","New York, NY",10000+,1849,...,0,0,0,0,data scientist,na,na,63000.0,110000.0,86500.0
26,27,Data Specialist,$75K-$124K (Glassdoor est.),As the Enterprise Data and Analytics Center of...,3.5,First Tech Federal Credit Union\n3.5,"Hillsboro, OR","San Jose, CA",1001 - 5000,1952,...,0,0,0,0,data scientist,na,na,75000.0,124000.0,99500.0
27,28,Associate Data Analyst,$34K-$61K (Glassdoor est.),"Friday, January 17, 2020\n\nOur Enterprise Dat...",3.7,The Hanover Insurance Group\n3.7,"Worcester, MA","Worcester, MA",5001 - 10000,1852,...,0,0,0,0,analyst,na,na,34000.0,61000.0,47500.0
28,29,Clinical Data Scientist,$63K-$105K (Glassdoor est.),THIS ROLE MUST BE BASED IN SAN DIEGO\n\nAs par...,4.0,Pfizer\n4.0,"Groton, CT","New York, NY",10000+,1849,...,0,0,0,0,data scientist,na,M,63000.0,105000.0,84000.0
29,30,Data Specialist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
30,31,Data Specialist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
31,32,Data Specialist,$72K-$120K (Glassdoor est.),Preferred Qualifications\nMasters degree or do...,3.6,Amrock\n3.6,"Detroit, MI","Detroit, MI",1001 - 5000,1997,...,0,0,0,0,data scientist,na,M,72000.0,120000.0,96000.0
32,33,Data Scientist / Machine Learning Expert,$86K-$143K (Glassdoor est.),Posting Title\nData Scientist / Machine Learni...,3.8,Novartis\n3.8,"Cambridge, MA","Basel, Switzerland",10000+,1996,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
33,34,Data Specialist,$93K-$149K (Glassdoor est.),"Title: Software Engineer, Data Science\n\nDesi...",3.8,Juniper Networks\n3.8,"Sunnyvale, CA","Sunnyvale, CA",5001 - 10000,1996,...,0,0,1,0,data scientist,na,M,93000.0,149000.0,121000.0
34,35,Data Specialist,$85K-$140K (Glassdoor est.),New England Biolabs is seeking a Data Scientis...,4.7,New England Biolabs\n4.7,"Ipswich, MA","Ipswich, MA",201 - 500,1974,...,0,0,0,0,data scientist,na,na,85000.0,140000.0,112500.0
35,36,Web Data Analyst,$77K-$135K (Glassdoor est.),We are looking for a Web Data Analyst to assis...,4.2,Clarity Insights\n4.2,"San Jose, CA","Chicago, IL",201 - 500,2008,...,1,0,0,0,analyst,na,na,77000.0,135000.0,106000.0
36,37,Data Specialist,$82K-$132K (Glassdoor est.),Overview\n\n\nAre you passionate about changin...,3.5,Esri\n3.5,"Redlands, CA","Redlands, CA",1001 - 5000,1969,...,0,0,1,0,data scientist,na,M,82000.0,132000.0,107000.0
37,38,Data Specialist,$83K-$137K (Glassdoor est.),STR is a government research contractor specia...,4.7,Systems & Technology Research\n4.7,"Woburn, MA","Woburn, MA",201 - 500,2010,...,0,0,0,0,data scientist,na,P,83000.0,137000.0,110000.0
38,39,Senior Data Scientist,$115K-$180K (Glassdoor est.),"Sartorius Stedim Data Analytics, a market lead...",3.5,Sartorius\n3.5,"Fremont, CA","Gottingen, Germany",5001 - 10000,1870,...,0,0,0,0,data scientist,sr,M,115000.0,180000.0,147500.0
39,40,Data Engineer,$74K-$138K (Glassdoor est.),Lancer Insurance Company is looking for a Data...,3.5,Lancer Insurance\n3.5,"Long Beach, NY","Long Beach, NY",201 - 500,1985,...,0,0,0,0,data engineer,na,M,74000.0,138000.0,106000.0

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('data_cleaned_2021.csv')

In [3]:
data.index.name="Job ID"

In [4]:
new_data = data[['Job Title','Salary Estimate','Company Name','Location','Size']]

In [5]:
data[['Lower Salary','Upper Salary','Avg Salary(K)']]

        Lower Salary  Upper Salary  Avg Salary(K)
Job ID
0                 53            91           72.0
1                 63           112           87.5
2                 80            90           85.0
3                 56            97           76.5
4                 86           143          114.5
...              ...           ...            ...
737               58           111           84.5
738               72           133          102.5
739               56            91           73.5
740               95           160          127.5
741               61           126           93.5

[742 rows x 3 columns]

In [6]:
string = "$53K-$91K (Glassdoor est.)"
def parse_salary(salary_str):
    if ":" in salary_str:
        salary_str = salary_str.split(":")[1].strip()
    salary_range = salary_str.split(' ')[0]
    if "-" in salary_range:
        min_salary_str, max_salary_str = salary_range.split('-')
    else:
        min_salary_str = max_salary_str = salary_range

    def clean_and_convert(salary):
        try:
            return float(salary.replace('$','').split('K')[0]) * 1000
        except ValueError:
            return 0

    min_salary = clean_and_convert(min_salary_str)
    max_salary = clean_and_convert(max_salary_str)
        
    return pd.Series([min_salary, max_salary])
parse_salary(string)

0    53000.0
1    91000.0
dtype: float64

In [7]:
data['Salary Estimate'].apply(parse_salary)

              0         1
Job ID
0       53000.0   91000.0
1       63000.0  112000.0
2       80000.0   90000.0
3       56000.0   97000.0
4       86000.0  143000.0
...         ...       ...
737     58000.0  111000.0
738     72000.0  133000.0
739     56000.0   91000.0
740     95000.0  160000.0
741     61000.0  126000.0

[742 rows x 2 columns]

In [8]:
data[['Min Salary', 'Max Salary']] = data['Salary Estimate'].apply(parse_salary)

In [9]:
data['Average Salary'] = (data['Max Salary'] + data['Min Salary']) / 2

In [10]:
data.head(40)

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,bi,flink,mongo,google_an,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,1,0,0,0,data scientist,na,M,53000.0,91000.0,72000.0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,0,0,0,0,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,1,0,1,0,data scientist,na,na,71000.0,119000.0,95000.0
6,6,Data Scientist,$54K-$93K (Glassdoor est.),Job Description\n\n**Please only local candida...,4.1,ClearOne Advantage\n4.1,"Baltimore, MD","Baltimore, MD",501 - 1000,2008,...,0,0,0,0,data scientist,na,na,54000.0,93000.0,73500.0
7,7,Data Scientist,$86K-$142K (Glassdoor est.),Advanced Analytics Lead Data Scientist\nOver...,3.8,Logic20/20\n3.8,"San Jose, CA","Seattle, WA",201 - 500,2005,...,0,0,0,0,data scientist,na,M,86000.0,142000.0,114000.0
8,8,Research Scientist,$38K-$84K (Glassdoor est.),SUMMARY\n\nThe Research Scientist I will be ta...,3.3,Rochester Regional Health\n3.3,"Rochester, NY","Rochester, NY",10000+,2014,...,0,0,0,0,other scientist,na,P,38000.0,84000.0,61000.0
9,9,Data Scientist,$120K-$160K (Glassdoor est.),isnt your usual company. Our work is powered ...,4.6,<intent>\n4.6,"New York, NY","New York, NY",51 - 200,2009,...,0,0,0,0,data scientist,na,na,120000.0,160000.0,140000.0
10,10,Data Scientist,$126K-$201K (Glassdoor est.),"At Wish, our Data Science & Engineering team i...",3.5,Wish\n3.5,"San Jose, CA","San Francisco, CA",501 - 1000,2011,...,0,0,0,0,data scientist,na,na,126000.0,201000.0,163500.0
11,11,Data Scientist,$64K-$106K (Glassdoor est.),"Secure our Nation, Ignite your Future\n\nSumma...",4.1,ManTech\n4.1,"Chantilly, VA","Herndon, VA",5001 - 10000,1968,...,0,0,0,0,data scientist,na,na,64000.0,106000.0,85000.0
12,12,Staff Data Scientist - Technology,$106K-$172K (Glassdoor est.),Position Summary...\nDrives the execution of m...,3.2,Walmart\n3.2,"Plano, TX","Bentonville, AR",10000+,1962,...,0,0,0,0,data scientist,na,M,106000.0,172000.0,139000.0
13,13,Data Analyst,$46K-$85K (Glassdoor est.),"Are you an experienced Data Analyst, skilled a...",4.1,Yesler\n4.1,"Seattle, WA","Seattle, WA",201 - 500,2012,...,1,0,0,0,analyst,na,na,46000.0,85000.0,65500.0
14,14,Data Scientist,$83K-$144K (Glassdoor est.),Job Description\n\n\nTakeda is looking for a D...,3.7,Takeda Pharmaceuticals\n3.7,"Cambridge, MA","OSAKA, Japan",10000+,1781,...,0,0,0,0,data scientist,na,M,83000.0,144000.0,113500.0
15,15,Data Engineer I,$102K-$190K (Glassdoor est.),This opportunity is within Audibles Data Engin...,3.6,Audible\n3.6,"Newark, NJ","Newark, NJ",1001 - 5000,1995,...,0,0,0,0,data engineer,na,na,102000.0,190000.0,146000.0
16,16,"Scientist I/II, Biology",$67K-$137K (Glassdoor est.),"Scientist I/II, Biology\n\nCambridge, MA\n\nBI...",3.9,Blueprint Medicines\n3.9,"Cambridge, MA","Cambridge, MA",51 - 200,2011,...,0,0,0,0,other scientist,na,P,67000.0,137000.0,102000.0
17,17,Customer Data Scientist,$118K-$189K (Glassdoor est.),Company Overview\n\nH2O.ai is the open source ...,4.3,h2o.ai\n4.3,"Mountain View, CA","Mountain View, CA",201 - 500,2011,...,0,0,0,0,data scientist,na,M,118000.0,189000.0,153500.0
18,18,Data Scientist - Health Data Analytics,$110K-$175K (Glassdoor est.),"At Nuna, our mission is to make high-quality h...",4.2,Nuna\n4.2,"San Francisco, CA","San Francisco, CA",51 - 200,2010,...,0,0,0,0,data scientist,na,na,110000.0,175000.0,142500.0
19,19,Data Scientist,$64K-$111K (Glassdoor est.),"Pinnacol Assurance does just one thing, and do...",4.0,Pinnacol Assurance\n4.0,"Denver, CO","Denver, CO",501 - 1000,1915,...,0,0,0,0,data scientist,na,M,64000.0,111000.0,87500.0
20,20,Data Scientist,$81K-$130K (Glassdoor est.),About Our Team\n\nWe understand that the first...,3.2,Porch\n3.2,"Seattle, WA","Seattle, WA",201 - 500,2012,...,0,0,0,0,data scientist,na,M,81000.0,130000.0,105500.0
21,21,Senior Data Scientist / Machine Learning,$73K-$119K (Glassdoor est.),IMMEDIATE NEED FOR A SENIOR DATA SCIENTIST / M...,3.9,Health IQ\n3.9,"Dallas, TX","Mountain View, CA",201 - 500,2013,...,0,0,0,0,data scientist,sr,P,73000.0,119000.0,96000.0
22,22,Data Scientist - Quantitative,$86K-$139K (Glassdoor est.),Truckstop.com is hiring a Data Scientist for o...,3.8,Truckstop.com\n3.8,"Chicago, IL","New Plymouth, ID",501 - 1000,1995,...,0,0,1,0,data scientist,na,M,86000.0,139000.0,112500.0
23,23,Data Scientist,$63K-$105K (Glassdoor est.),Position Summary\nOur Data Science team is cur...,4.3,SMC 3\n4.3,"Louisville, KY","Peachtree City, GA",51 - 200,1935,...,0,0,0,0,data scientist,na,M,63000.0,105000.0,84000.0
24,25,Data Scientist,$109K-$177K (Glassdoor est.),Are you passionate about solving challenging p...,4.0,Novetta\n4.0,"Herndon, VA","Mc Lean, VA",501 - 1000,2012,...,0,0,0,0,data scientist,na,na,109000.0,177000.0,143000.0
25,26,Digital Health Data Scientist,$63K-$110K (Glassdoor est.),ROLE SUMMARY\n\nThe Digital Health Data Scient...,4.0,Pfizer\n4.0,"Cambridge, MA","New York, NY",10000+,1849,...,0,0,0,0,data scientist,na,na,63000.0,110000.0,86500.0
26,27,Data Scientist,$75K-$124K (Glassdoor est.),As the Enterprise Data and Analytics Center of...,3.5,First Tech Federal Credit Union\n3.5,"Hillsboro, OR","San Jose, CA",1001 - 5000,1952,...,0,0,0,0,data scientist,na,na,75000.0,124000.0,99500.0
27,28,Associate Data Analyst,$34K-$61K (Glassdoor est.),"Friday, January 17, 2020\n\nOur Enterprise Dat...",3.7,The Hanover Insurance Group\n3.7,"Worcester, MA","Worcester, MA",5001 - 10000,1852,...,0,0,0,0,analyst,na,na,34000.0,61000.0,47500.0
28,29,Clinical Data Scientist,$63K-$105K (Glassdoor est.),THIS ROLE MUST BE BASED IN SAN DIEGO\n\nAs par...,4.0,Pfizer\n4.0,"Groton, CT","New York, NY",10000+,1849,...,0,0,0,0,data scientist,na,M,63000.0,105000.0,84000.0
29,30,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,0,0,0,0,data scientist,na,M,80000.0,90000.0,85000.0
30,31,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,0,0,0,0,data scientist,na,na,56000.0,97000.0,76500.0
31,32,Data Scientist,$72K-$120K (Glassdoor est.),Preferred Qualifications\nMasters degree or do...,3.6,Amrock\n3.6,"Detroit, MI","Detroit, MI",1001 - 5000,1997,...,0,0,0,0,data scientist,na,M,72000.0,120000.0,96000.0
32,33,Data Scientist / Machine Learning Expert,$86K-$143K (Glassdoor est.),Posting Title\nData Scientist / Machine Learni...,3.8,Novartis\n3.8,"Cambridge, MA","Basel, Switzerland",10000+,1996,...,0,0,0,0,data scientist,na,na,86000.0,143000.0,114500.0
33,34,Data Scientist,$93K-$149K (Glassdoor est.),"Title: Software Engineer, Data Science\n\nDesi...",3.8,Juniper Networks\n3.8,"Sunnyvale, CA","Sunnyvale, CA",5001 - 10000,1996,...,0,0,1,0,data scientist,na,M,93000.0,149000.0,121000.0
34,35,Data Scientist,$85K-$140K (Glassdoor est.),New England Biolabs is seeking a Data Scientis...,4.7,New England Biolabs\n4.7,"Ipswich, MA","Ipswich, MA",201 - 500,1974,...,0,0,0,0,data scientist,na,na,85000.0,140000.0,112500.0
35,36,Web Data Analyst,$77K-$135K (Glassdoor est.),We are looking for a Web Data Analyst to assis...,4.2,Clarity Insights\n4.2,"San Jose, CA","Chicago, IL",201 - 500,2008,...,1,0,0,0,analyst,na,na,77000.0,135000.0,106000.0
36,37,Data Scientist,$82K-$132K (Glassdoor est.),Overview\n\n\nAre you passionate about changin...,3.5,Esri\n3.5,"Redlands, CA","Redlands, CA",1001 - 5000,1969,...,0,0,1,0,data scientist,na,M,82000.0,132000.0,107000.0
37,38,Data Scientist,$83K-$137K (Glassdoor est.),STR is a government research contractor specia...,4.7,Systems & Technology Research\n4.7,"Woburn, MA","Woburn, MA",201 - 500,2010,...,0,0,0,0,data scientist,na,P,83000.0,137000.0,110000.0
38,39,Senior Data Scientist,$115K-$180K (Glassdoor est.),"Sartorius Stedim Data Analytics, a market lead...",3.5,Sartorius\n3.5,"Fremont, CA","Gottingen, Germany",5001 - 10000,1870,...,0,0,0,0,data scientist,sr,M,115000.0,180000.0,147500.0
39,40,Data Engineer,$74K-$138K (Glassdoor est.),Lancer Insurance Company is looking for a Data...,3.5,Lancer Insurance\n3.5,"Long Beach, NY","Long Beach, NY",201 - 500,1985,...,0,0,0,0,data engineer,na,M,74000.0,138000.0,106000.0

In [11]:
data.columns

Index(['index', 'Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'Hourly', 'Employer provided', 'Lower Salary', 'Upper Salary',
       'Avg Salary(K)', 'company_txt', 'Job Location', 'Age', 'Python',
       'spark', 'aws', 'excel', 'sql', 'sas', 'keras', 'pytorch', 'scikit',
       'tensor', 'hadoop', 'tableau', 'bi', 'flink', 'mongo', 'google_an',
       'job_title_sim', 'seniority_by_title', 'Degree', 'Min Salary',
       'Max Salary', 'Average Salary'],
      dtype='object')

In [12]:
data = data.drop(columns = ['Python',
       'spark', 'aws', 'excel', 'sql', 'sas', 'keras', 'pytorch', 'scikit',
       'tensor', 'hadoop', 'tableau', 'bi', 'flink', 'mongo', 'google_an'])

In [13]:
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,Avg Salary(K),company_txt,Job Location,Age,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
0,0,Data Scientist,$53K-$91K (Glassdoor est.),"Data Scientist\nLocation: Albuquerque, NM\nEdu...",3.8,Tecolote Research\n3.8,"Albuquerque, NM","Goleta, CA",501 - 1000,1973,...,72.0,Tecolote Research,NM,48,data scientist,na,M,53000.0,91000.0,72000.0
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,87.5,University of Maryland Medical System,MD,37,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,85.0,KnowBe4,FL,11,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,76.5,PNNL,WA,56,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,114.5,Affinity Solutions,NY,23,data scientist,na,na,86000.0,143000.0,114500.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,84.5,GSK,MA,191,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,102.5,Eventbrite,TN,15,data engineer,sr,na,72000.0,133000.0,102500.0
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,73.5,Software Engineering Institute,PA,37,other scientist,na,P,56000.0,91000.0,73500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,127.5,"Numeric, LLC",PA,-1,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,93.5,Riverside Research Institute,OH,54,other scientist,na,M,61000.0,126000.0,93500.0

In [14]:
data.columns

Index(['index', 'Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'Hourly', 'Employer provided', 'Lower Salary', 'Upper Salary',
       'Avg Salary(K)', 'company_txt', 'Job Location', 'Age', 'job_title_sim',
       'seniority_by_title', 'Degree', 'Min Salary', 'Max Salary',
       'Average Salary'],
      dtype='object')

In [16]:
data = data.drop(index = [0])
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,...,Avg Salary(K),company_txt,Job Location,Age,job_title_sim,seniority_by_title,Degree,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD","Baltimore, MD",10000+,1984,...,87.5,University of Maryland Medical System,MD,37,data scientist,na,M,63000.0,112000.0,87500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL","Clearwater, FL",501 - 1000,2010,...,85.0,KnowBe4,FL,11,data scientist,na,M,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA","Richland, WA",1001 - 5000,1965,...,76.5,PNNL,WA,56,data scientist,na,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY","New York, NY",51 - 200,1998,...,114.5,Affinity Solutions,NY,23,data scientist,na,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX","Dallas, TX",201 - 500,2000,...,95.0,CyrusOne,TX,21,data scientist,na,na,71000.0,119000.0,95000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA","Brentford, United Kingdom",10000+,1830,...,84.5,GSK,MA,191,other scientist,sr,M,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN","San Francisco, CA",1001 - 5000,2006,...,102.5,Eventbrite,TN,15,data engineer,sr,na,72000.0,133000.0,102500.0
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA","Pittsburgh, PA",501 - 1000,1984,...,73.5,Software Engineering Institute,PA,37,other scientist,na,P,56000.0,91000.0,73500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA","Chadds Ford, PA",1 - 50,-1,...,127.5,"Numeric, LLC",PA,-1,data scientist,na,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH","Arlington, VA",501 - 1000,1967,...,93.5,Riverside Research Institute,OH,54,other scientist,na,M,61000.0,126000.0,93500.0

In [17]:
hqs = data.pop('Headquarters')

In [18]:
hqs

Job ID
1                  Baltimore, MD
2                 Clearwater, FL
3                   Richland, WA
4                   New York, NY
5                     Dallas, TX
                 ...
737    Brentford, United Kingdom
738            San Francisco, CA
739               Pittsburgh, PA
740              Chadds Ford, PA
741                Arlington, VA
Name: Headquarters, Length: 741, dtype: object

In [19]:
del data['Degree']

In [20]:
data

,index,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Size,Founded,Type of ownership,...,Upper Salary,Avg Salary(K),company_txt,Job Location,Age,job_title_sim,seniority_by_title,Min Salary,Max Salary,Average Salary
Job ID,,,,,,,,,,,,,,,,,,,,,
1,1,Healthcare Data Scientist,$63K-$112K (Glassdoor est.),What You Will Do:\n\nI. General Summary\n\nThe...,3.4,University of Maryland Medical System\n3.4,"Linthicum, MD",10000+,1984,Other Organization,...,112,87.5,University of Maryland Medical System,MD,37,data scientist,na,63000.0,112000.0,87500.0
2,2,Data Scientist,$80K-$90K (Glassdoor est.),"KnowBe4, Inc. is a high growth information sec...",4.8,KnowBe4\n4.8,"Clearwater, FL",501 - 1000,2010,Company - Private,...,90,85.0,KnowBe4,FL,11,data scientist,na,80000.0,90000.0,85000.0
3,3,Data Scientist,$56K-$97K (Glassdoor est.),*Organization and Job ID**\nJob ID: 310709\n\n...,3.8,PNNL\n3.8,"Richland, WA",1001 - 5000,1965,Government,...,97,76.5,PNNL,WA,56,data scientist,na,56000.0,97000.0,76500.0
4,4,Data Scientist,$86K-$143K (Glassdoor est.),Data Scientist\nAffinity Solutions / Marketing...,2.9,Affinity Solutions\n2.9,"New York, NY",51 - 200,1998,Company - Private,...,143,114.5,Affinity Solutions,NY,23,data scientist,na,86000.0,143000.0,114500.0
5,5,Data Scientist,$71K-$119K (Glassdoor est.),CyrusOne is seeking a talented Data Scientist ...,3.4,CyrusOne\n3.4,"Dallas, TX",201 - 500,2000,Company - Public,...,119,95.0,CyrusOne,TX,21,data scientist,na,71000.0,119000.0,95000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
737,950,"Sr Scientist, Immuno-Oncology - Oncology",$58K-$111K (Glassdoor est.),Site Name: USA - Massachusetts - Cambridge\nPo...,3.9,GSK\n3.9,"Cambridge, MA",10000+,1830,Company - Public,...,111,84.5,GSK,MA,191,other scientist,sr,58000.0,111000.0,84500.0
738,951,Senior Data Engineer,$72K-$133K (Glassdoor est.),THE CHALLENGE\nEventbrite has a world-class da...,4.4,Eventbrite\n4.4,"Nashville, TN",1001 - 5000,2006,Company - Public,...,133,102.5,Eventbrite,TN,15,data engineer,sr,72000.0,133000.0,102500.0
739,952,"Project Scientist - Auton Lab, Robotics Institute",$56K-$91K (Glassdoor est.),The Auton Lab at Carnegie Mellon University is...,2.6,Software Engineering Institute\n2.6,"Pittsburgh, PA",501 - 1000,1984,College / University,...,91,73.5,Software Engineering Institute,PA,37,other scientist,na,56000.0,91000.0,73500.0
740,953,Data Science Manager,$95K-$160K (Glassdoor est.),Data Science ManagerResponsibilities:\n\nOvers...,3.2,"Numeric, LLC\n3.2","Allentown, PA",1 - 50,-1,Company - Private,...,160,127.5,"Numeric, LLC",PA,-1,data scientist,na,95000.0,160000.0,127500.0
741,955,Research Scientist Security and Privacy,$61K-$126K (Glassdoor est.),Returning Candidate? Log back in to the Career...,3.6,Riverside Research Institute\n3.6,"Beavercreek, OH",501 - 1000,1967,Nonprofit Organization,...,126,93.5,Riverside Research Institute,OH,54,other scientist,na,61000.0,126000.0,93500.0

In [21]:
data = pd.read_csv('happiness_report.csv')
data

,Country Name,Regional Indicator,Year,Life Ladder,Log GDP Per Capita,Social Support,Healthy Life Expectancy At Birth,Freedom To Make Life Choices,Generosity,Perceptions Of Corruption,Positive Affect,Negative Affect,Confidence In National Government
0,Afghanistan,South Asia,2008,3.723590,7.350416,0.450662,50.500000,0.718114,0.167652,0.881686,0.414297,0.258195,0.612072
1,Afghanistan,South Asia,2009,4.401778,7.508646,0.552308,50.799999,0.678896,0.190809,0.850035,0.481421,0.237092,0.611545
2,Afghanistan,South Asia,2010,4.758381,7.613900,0.539075,51.099998,0.600127,0.121316,0.706766,0.516907,0.275324,0.299357
3,Afghanistan,South Asia,2011,3.831719,7.581259,0.521104,51.400002,0.495901,0.163571,0.731109,0.479835,0.267175,0.307386
4,Afghanistan,South Asia,2012,3.782938,7.660506,0.520637,51.700001,0.530935,0.237588,0.775620,0.613513,0.267919,0.435440
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2194,Zimbabwe,Sub-Saharan Africa,2018,3.616480,7.783066,0.775388,52.625000,0.762675,-0.051219,0.844209,0.657524,0.211726,0.550508
2195,Zimbabwe,Sub-Saharan Africa,2019,2.693523,7.697755,0.759162,53.099998,0.631908,-0.047464,0.830652,0.658434,0.235354,0.456455
2196,Zimbabwe,Sub-Saharan Africa,2020,3.159802,7.596050,0.717243,53.575001,0.643303,0.006313,0.788523,0.660658,0.345736,0.577302
2197,Zimbabwe,Sub-Saharan Africa,2021,3.154578,7.656878,0.685151,54.049999,0.667636,-0.075575,0.756945,0.609917,0.241682,0.665703
2198,Zimbabwe,Sub-Saharan Africa,2022,3.296220,7.670123,0.666172,54.525002,0.651987,-0.069513,0.752632,0.640609,0.191350,NaN

In [22]:
data = data.set_index(keys = ['Country Name','Year'])
data

                   Regional Indicator  Life Ladder  Log GDP Per Capita  \
Country Name Year
Afghanistan  2008          South Asia     3.723590            7.350416
             2009          South Asia     4.401778            7.508646
             2010          South Asia     4.758381            7.613900
             2011          South Asia     3.831719            7.581259
             2012          South Asia     3.782938            7.660506
...                               ...          ...                 ...
Zimbabwe     2018  Sub-Saharan Africa     3.616480            7.783066
             2019  Sub-Saharan Africa     2.693523            7.697755
             2020  Sub-Saharan Africa     3.159802            7.596050
             2021  Sub-Saharan Africa     3.154578            7.656878
             2022  Sub-Saharan Africa     3.296220            7.670123

                   Social Support  Healthy Life Expectancy At Birth  \
Country Name Year
Afghanistan  2008        0.450662                         50.500000
             2009        0.552308                         50.799999
             2010        0.539075                         51.099998
             2011        0.521104                         51.400002
             2012        0.520637                         51.700001
...                           ...                               ...
Zimbabwe     2018        0.775388                         52.625000
             2019        0.759162                         53.099998
             2020        0.717243                         53.575001
             2021        0.685151                         54.049999
             2022        0.666172                         54.525002

                   Freedom To Make Life Choices  Generosity  \
Country Name Year
Afghanistan  2008                      0.718114    0.167652
             2009                      0.678896    0.190809
             2010                      0.600127    0.121316
             2011                      0.495901    0.163571
             2012                      0.530935    0.237588
...                                         ...         ...
Zimbabwe     2018                      0.762675   -0.051219
             2019                      0.631908   -0.047464
             2020                      0.643303    0.006313
             2021                      0.667636   -0.075575
             2022                      0.651987   -0.069513

                   Perceptions Of Corruption  Positive Affect  \
Country Name Year
Afghanistan  2008                   0.881686         0.414297
             2009                   0.850035         0.481421
             2010                   0.706766         0.516907
             2011                   0.731109         0.479835
             2012                   0.775620         0.613513
...                                      ...              ...
Zimbabwe     2018                   0.844209         0.657524
             2019                   0.830652         0.658434
             2020                   0.788523         0.660658
             2021                   0.756945         0.609917
             2022                   0.752632         0.640609

                   Negative Affect  Confidence In National Government
Country Name Year
Afghanistan  2008         0.258195                           0.612072
             2009         0.237092                           0.611545
             2010         0.275324                           0.299357
             2011         0.267175                           0.307386
             2012         0.267919                           0.435440
...                            ...                                ...
Zimbabwe     2018         0.211726                           0.550508
             2019         0.235354                           0.456455
             2020         0.345736                           0.577302
             2021         0.241682                           0.665703
             2022         0.191350                                NaN

[2199 rows x 11 columns]

In [26]:
data.index[1]

('Afghanistan', 2009)

In [27]:
data.index

MultiIndex([('Afghanistan', 2008),
            ('Afghanistan', 2009),
            ('Afghanistan', 2010),
            ('Afghanistan', 2011),
            ('Afghanistan', 2012),
            ('Afghanistan', 2013),
            ('Afghanistan', 2014),
            ('Afghanistan', 2015),
            ('Afghanistan', 2016),
            ('Afghanistan', 2017),
            ...
            (   'Zimbabwe', 2013),
            (   'Zimbabwe', 2014),
            (   'Zimbabwe', 2015),
            (   'Zimbabwe', 2016),
            (   'Zimbabwe', 2017),
            (   'Zimbabwe', 2018),
            (   'Zimbabwe', 2019),
            (   'Zimbabwe', 2020),
            (   'Zimbabwe', 2021),
            (   'Zimbabwe', 2022)],
           names=['Country Name', 'Year'], length=2199)

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('happiness_report.csv')

In [3]:
data = data.set_index(keys = ['Country Name','Year'])

In [4]:
data

                   Regional Indicator  Life Ladder  Log GDP Per Capita  \
Country Name Year
Afghanistan  2008          South Asia     3.723590            7.350416
             2009          South Asia     4.401778            7.508646
             2010          South Asia     4.758381            7.613900
             2011          South Asia     3.831719            7.581259
             2012          South Asia     3.782938            7.660506
...                               ...          ...                 ...
Zimbabwe     2018  Sub-Saharan Africa     3.616480            7.783066
             2019  Sub-Saharan Africa     2.693523            7.697755
             2020  Sub-Saharan Africa     3.159802            7.596050
             2021  Sub-Saharan Africa     3.154578            7.656878
             2022  Sub-Saharan Africa     3.296220            7.670123

                   Social Support  Healthy Life Expectancy At Birth  \
Country Name Year
Afghanistan  2008        0.450662                         50.500000
             2009        0.552308                         50.799999
             2010        0.539075                         51.099998
             2011        0.521104                         51.400002
             2012        0.520637                         51.700001
...                           ...                               ...
Zimbabwe     2018        0.775388                         52.625000
             2019        0.759162                         53.099998
             2020        0.717243                         53.575001
             2021        0.685151                         54.049999
             2022        0.666172                         54.525002

                   Freedom To Make Life Choices  Generosity  \
Country Name Year
Afghanistan  2008                      0.718114    0.167652
             2009                      0.678896    0.190809
             2010                      0.600127    0.121316
             2011                      0.495901    0.163571
             2012                      0.530935    0.237588
...                                         ...         ...
Zimbabwe     2018                      0.762675   -0.051219
             2019                      0.631908   -0.047464
             2020                      0.643303    0.006313
             2021                      0.667636   -0.075575
             2022                      0.651987   -0.069513

                   Perceptions Of Corruption  Positive Affect  \
Country Name Year
Afghanistan  2008                   0.881686         0.414297
             2009                   0.850035         0.481421
             2010                   0.706766         0.516907
             2011                   0.731109         0.479835
             2012                   0.775620         0.613513
...                                      ...              ...
Zimbabwe     2018                   0.844209         0.657524
             2019                   0.830652         0.658434
             2020                   0.788523         0.660658
             2021                   0.756945         0.609917
             2022                   0.752632         0.640609

                   Negative Affect  Confidence In National Government
Country Name Year
Afghanistan  2008         0.258195                           0.612072
             2009         0.237092                           0.611545
             2010         0.275324                           0.299357
             2011         0.267175                           0.307386
             2012         0.267919                           0.435440
...                            ...                                ...
Zimbabwe     2018         0.211726                           0.550508
             2019         0.235354                           0.456455
             2020         0.345736                           0.577302
             2021         0.241682                           0.665703
             2022         0.191350                                NaN

[2199 rows x 11 columns]

In [5]:
data.index

MultiIndex([('Afghanistan', 2008),
            ('Afghanistan', 2009),
            ('Afghanistan', 2010),
            ('Afghanistan', 2011),
            ('Afghanistan', 2012),
            ('Afghanistan', 2013),
            ('Afghanistan', 2014),
            ('Afghanistan', 2015),
            ('Afghanistan', 2016),
            ('Afghanistan', 2017),
            ...
            (   'Zimbabwe', 2013),
            (   'Zimbabwe', 2014),
            (   'Zimbabwe', 2015),
            (   'Zimbabwe', 2016),
            (   'Zimbabwe', 2017),
            (   'Zimbabwe', 2018),
            (   'Zimbabwe', 2019),
            (   'Zimbabwe', 2020),
            (   'Zimbabwe', 2021),
            (   'Zimbabwe', 2022)],
           names=['Country Name', 'Year'], length=2199)

In [6]:
data.index.get_level_values('Year')

Index([2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017,
       ...
       2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022],
      dtype='int64', name='Year', length=2199)

In [7]:
data.index.get_level_values('Year')

Index([2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017,
       ...
       2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022],
      dtype='int64', name='Year', length=2199)

In [8]:
data.sort_index()

                   Regional Indicator  Life Ladder  Log GDP Per Capita  \
Country Name Year
Afghanistan  2008          South Asia     3.723590            7.350416
             2009          South Asia     4.401778            7.508646
             2010          South Asia     4.758381            7.613900
             2011          South Asia     3.831719            7.581259
             2012          South Asia     3.782938            7.660506
...                               ...          ...                 ...
Zimbabwe     2018  Sub-Saharan Africa     3.616480            7.783066
             2019  Sub-Saharan Africa     2.693523            7.697755
             2020  Sub-Saharan Africa     3.159802            7.596050
             2021  Sub-Saharan Africa     3.154578            7.656878
             2022  Sub-Saharan Africa     3.296220            7.670123

                   Social Support  Healthy Life Expectancy At Birth  \
Country Name Year
Afghanistan  2008        0.450662                         50.500000
             2009        0.552308                         50.799999
             2010        0.539075                         51.099998
             2011        0.521104                         51.400002
             2012        0.520637                         51.700001
...                           ...                               ...
Zimbabwe     2018        0.775388                         52.625000
             2019        0.759162                         53.099998
             2020        0.717243                         53.575001
             2021        0.685151                         54.049999
             2022        0.666172                         54.525002

                   Freedom To Make Life Choices  Generosity  \
Country Name Year
Afghanistan  2008                      0.718114    0.167652
             2009                      0.678896    0.190809
             2010                      0.600127    0.121316
             2011                      0.495901    0.163571
             2012                      0.530935    0.237588
...                                         ...         ...
Zimbabwe     2018                      0.762675   -0.051219
             2019                      0.631908   -0.047464
             2020                      0.643303    0.006313
             2021                      0.667636   -0.075575
             2022                      0.651987   -0.069513

                   Perceptions Of Corruption  Positive Affect  \
Country Name Year
Afghanistan  2008                   0.881686         0.414297
             2009                   0.850035         0.481421
             2010                   0.706766         0.516907
             2011                   0.731109         0.479835
             2012                   0.775620         0.613513
...                                      ...              ...
Zimbabwe     2018                   0.844209         0.657524
             2019                   0.830652         0.658434
             2020                   0.788523         0.660658
             2021                   0.756945         0.609917
             2022                   0.752632         0.640609

                   Negative Affect  Confidence In National Government
Country Name Year
Afghanistan  2008         0.258195                           0.612072
             2009         0.237092                           0.611545
             2010         0.275324                           0.299357
             2011         0.267175                           0.307386
             2012         0.267919                           0.435440
...                            ...                                ...
Zimbabwe     2018         0.211726                           0.550508
             2019         0.235354                           0.456455
             2020         0.345736                           0.577302
             2021         0.241682                           0.665703
             2022         0.191350                                NaN

[2199 rows x 11 columns]

In [9]:
data.sort_index(ascending=False)

                   Regional Indicator  Life Ladder  Log GDP Per Capita  \
Country Name Year
Zimbabwe     2022  Sub-Saharan Africa     3.296220            7.670123
             2021  Sub-Saharan Africa     3.154578            7.656878
             2020  Sub-Saharan Africa     3.159802            7.596050
             2019  Sub-Saharan Africa     2.693523            7.697755
             2018  Sub-Saharan Africa     3.616480            7.783066
...                               ...          ...                 ...
Afghanistan  2012          South Asia     3.782938            7.660506
             2011          South Asia     3.831719            7.581259
             2010          South Asia     4.758381            7.613900
             2009          South Asia     4.401778            7.508646
             2008          South Asia     3.723590            7.350416

                   Social Support  Healthy Life Expectancy At Birth  \
Country Name Year
Zimbabwe     2022        0.666172                         54.525002
             2021        0.685151                         54.049999
             2020        0.717243                         53.575001
             2019        0.759162                         53.099998
             2018        0.775388                         52.625000
...                           ...                               ...
Afghanistan  2012        0.520637                         51.700001
             2011        0.521104                         51.400002
             2010        0.539075                         51.099998
             2009        0.552308                         50.799999
             2008        0.450662                         50.500000

                   Freedom To Make Life Choices  Generosity  \
Country Name Year
Zimbabwe     2022                      0.651987   -0.069513
             2021                      0.667636   -0.075575
             2020                      0.643303    0.006313
             2019                      0.631908   -0.047464
             2018                      0.762675   -0.051219
...                                         ...         ...
Afghanistan  2012                      0.530935    0.237588
             2011                      0.495901    0.163571
             2010                      0.600127    0.121316
             2009                      0.678896    0.190809
             2008                      0.718114    0.167652

                   Perceptions Of Corruption  Positive Affect  \
Country Name Year
Zimbabwe     2022                   0.752632         0.640609
             2021                   0.756945         0.609917
             2020                   0.788523         0.660658
             2019                   0.830652         0.658434
             2018                   0.844209         0.657524
...                                      ...              ...
Afghanistan  2012                   0.775620         0.613513
             2011                   0.731109         0.479835
             2010                   0.706766         0.516907
             2009                   0.850035         0.481421
             2008                   0.881686         0.414297

                   Negative Affect  Confidence In National Government
Country Name Year
Zimbabwe     2022         0.191350                                NaN
             2021         0.241682                           0.665703
             2020         0.345736                           0.577302
             2019         0.235354                           0.456455
             2018         0.211726                           0.550508
...                            ...                                ...
Afghanistan  2012         0.267919                           0.435440
             2011         0.267175                           0.307386
             2010         0.275324                           0.299357
             2009         0.237092                           0.611545
             2008         0.258195                           0.612072

[2199 rows x 11 columns]

In [10]:
data.sort_index(ascending=[True, False])

                   Regional Indicator  Life Ladder  Log GDP Per Capita  \
Country Name Year
Afghanistan  2022          South Asia     1.281271                 NaN
             2021          South Asia     2.436034            7.324032
             2019          South Asia     2.375092            7.640086
             2018          South Asia     2.694303            7.630801
             2017          South Asia     2.661718            7.647830
...                               ...          ...                 ...
Zimbabwe     2010  Sub-Saharan Africa     4.681570            7.495286
             2009  Sub-Saharan Africa     4.055914            7.313474
             2008  Sub-Saharan Africa     3.174264            7.210233
             2007  Sub-Saharan Africa     3.280247            7.412637
             2006  Sub-Saharan Africa     3.826268            7.459545

                   Social Support  Healthy Life Expectancy At Birth  \
Country Name Year
Afghanistan  2022        0.228217                         54.875000
             2021        0.454175                         54.549999
             2019        0.419973                         53.900002
             2018        0.507516                         53.575001
             2017        0.490880                         53.250000
...                           ...                               ...
Zimbabwe     2010        0.856638                         45.200001
             2009        0.805781                         44.000000
             2008        0.843475                         42.799999
             2007        0.828113                         41.599998
             2006        0.821656                         40.400002

                   Freedom To Make Life Choices  Generosity  \
Country Name Year
Afghanistan  2022                      0.368377         NaN
             2021                      0.394306   -0.081011
             2019                      0.393656   -0.106016
             2018                      0.373536   -0.091106
             2017                      0.427011   -0.119410
...                                         ...         ...
Zimbabwe     2010                      0.664718   -0.077651
             2009                      0.411089   -0.061252
             2008                      0.343556   -0.073042
             2007                      0.455957   -0.065477
             2006                      0.431110   -0.059926

                   Perceptions Of Corruption  Positive Affect  \
Country Name Year
Afghanistan  2022                   0.733198         0.205868
             2021                   0.946299         0.178886
             2019                   0.923849         0.324108
             2018                   0.927606         0.384561
             2017                   0.954393         0.435270
...                                      ...              ...
Zimbabwe     2010                   0.828361         0.699366
             2009                   0.930818         0.660173
             2008                   0.963846         0.570538
             2007                   0.946287         0.588695
             2006                   0.904757         0.668662

                   Negative Affect  Confidence In National Government
Country Name Year
Afghanistan  2022         0.575512                                NaN
             2021         0.606713                           0.255620
             2019         0.502474                           0.341482
             2018         0.404904                           0.364666
             2017         0.371326                           0.261179
...                            ...                                ...
Zimbabwe     2010         0.122150                           0.471201
             2009         0.218419                           0.285287
             2008         0.250060                           0.181594
             2007         0.264989                           0.225752
             2006         0.297147                           0.317073

[2199 rows x 11 columns]

In [12]:
data.loc['India', 2010]

Regional Indicator                   South Asia
Life Ladder                            4.989277
Log GDP Per Capita                     8.346016
Social Support                          0.60481
Healthy Life Expectancy At Birth      57.299999
Freedom To Make Life Choices            0.78306
Generosity                             0.055902
Perceptions Of Corruption              0.862548
Positive Affect                        0.579225
Negative Affect                        0.266502
Confidence In National Government      0.667365
Name: (India, 2010), dtype: object

In [13]:
data.loc[('India',2010)]

Regional Indicator                   South Asia
Life Ladder                            4.989277
Log GDP Per Capita                     8.346016
Social Support                          0.60481
Healthy Life Expectancy At Birth      57.299999
Freedom To Make Life Choices            0.78306
Generosity                             0.055902
Perceptions Of Corruption              0.862548
Positive Affect                        0.579225
Negative Affect                        0.266502
Confidence In National Government      0.667365
Name: (India, 2010), dtype: object

In [17]:
data.loc[('India',2010):('India',2021),'Social Support']

Country Name  Year
India         2010    0.604810
              2011    0.552593
              2012    0.510575
              2013    0.552826
              2014    0.621467
              2015    0.610133
              2016    0.613529
              2017    0.606767
              2018    0.638052
              2019    0.560781
              2020    0.616412
              2021    0.569733
Name: Social Support, dtype: float64

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('happiness_report.csv')

In [3]:
# data = data.set_index(keys = ['Country Name','Year'])

In [4]:
data

                   Regional Indicator  Life Ladder  Log GDP Per Capita  \
Country Name Year
Afghanistan  2008          South Asia     3.723590            7.350416
             2009          South Asia     4.401778            7.508646
             2010          South Asia     4.758381            7.613900
             2011          South Asia     3.831719            7.581259
             2012          South Asia     3.782938            7.660506
...                               ...          ...                 ...
Zimbabwe     2018  Sub-Saharan Africa     3.616480            7.783066
             2019  Sub-Saharan Africa     2.693523            7.697755
             2020  Sub-Saharan Africa     3.159802            7.596050
             2021  Sub-Saharan Africa     3.154578            7.656878
             2022  Sub-Saharan Africa     3.296220            7.670123

                   Social Support  Healthy Life Expectancy At Birth  \
Country Name Year
Afghanistan  2008        0.450662                         50.500000
             2009        0.552308                         50.799999
             2010        0.539075                         51.099998
             2011        0.521104                         51.400002
             2012        0.520637                         51.700001
...                           ...                               ...
Zimbabwe     2018        0.775388                         52.625000
             2019        0.759162                         53.099998
             2020        0.717243                         53.575001
             2021        0.685151                         54.049999
             2022        0.666172                         54.525002

                   Freedom To Make Life Choices  Generosity  \
Country Name Year
Afghanistan  2008                      0.718114    0.167652
             2009                      0.678896    0.190809
             2010                      0.600127    0.121316
             2011                      0.495901    0.163571
             2012                      0.530935    0.237588
...                                         ...         ...
Zimbabwe     2018                      0.762675   -0.051219
             2019                      0.631908   -0.047464
             2020                      0.643303    0.006313
             2021                      0.667636   -0.075575
             2022                      0.651987   -0.069513

                   Perceptions Of Corruption  Positive Affect  \
Country Name Year
Afghanistan  2008                   0.881686         0.414297
             2009                   0.850035         0.481421
             2010                   0.706766         0.516907
             2011                   0.731109         0.479835
             2012                   0.775620         0.613513
...                                      ...              ...
Zimbabwe     2018                   0.844209         0.657524
             2019                   0.830652         0.658434
             2020                   0.788523         0.660658
             2021                   0.756945         0.609917
             2022                   0.752632         0.640609

                   Negative Affect  Confidence In National Government
Country Name Year
Afghanistan  2008         0.258195                           0.612072
             2009         0.237092                           0.611545
             2010         0.275324                           0.299357
             2011         0.267175                           0.307386
             2012         0.267919                           0.435440
...                            ...                                ...
Zimbabwe     2018         0.211726                           0.550508
             2019         0.235354                           0.456455
             2020         0.345736                           0.577302
             2021         0.241682                           0.665703
             2022         0.191350                                NaN

[2199 rows x 11 columns]

In [5]:
data

                   Regional Indicator  Life Ladder  Log GDP Per Capita  \
Country Name Year
Afghanistan  2008          South Asia     3.723590            7.350416
             2009          South Asia     4.401778            7.508646
             2010          South Asia     4.758381            7.613900
             2011          South Asia     3.831719            7.581259
             2012          South Asia     3.782938            7.660506
...                               ...          ...                 ...
Zimbabwe     2018  Sub-Saharan Africa     3.616480            7.783066
             2019  Sub-Saharan Africa     2.693523            7.697755
             2020  Sub-Saharan Africa     3.159802            7.596050
             2021  Sub-Saharan Africa     3.154578            7.656878
             2022  Sub-Saharan Africa     3.296220            7.670123

                   Social Support  Healthy Life Expectancy At Birth  \
Country Name Year
Afghanistan  2008        0.450662                         50.500000
             2009        0.552308                         50.799999
             2010        0.539075                         51.099998
             2011        0.521104                         51.400002
             2012        0.520637                         51.700001
...                           ...                               ...
Zimbabwe     2018        0.775388                         52.625000
             2019        0.759162                         53.099998
             2020        0.717243                         53.575001
             2021        0.685151                         54.049999
             2022        0.666172                         54.525002

                   Freedom To Make Life Choices  Generosity  \
Country Name Year
Afghanistan  2008                      0.718114    0.167652
             2009                      0.678896    0.190809
             2010                      0.600127    0.121316
             2011                      0.495901    0.163571
             2012                      0.530935    0.237588
...                                         ...         ...
Zimbabwe     2018                      0.762675   -0.051219
             2019                      0.631908   -0.047464
             2020                      0.643303    0.006313
             2021                      0.667636   -0.075575
             2022                      0.651987   -0.069513

                   Perceptions Of Corruption  Positive Affect  \
Country Name Year
Afghanistan  2008                   0.881686         0.414297
             2009                   0.850035         0.481421
             2010                   0.706766         0.516907
             2011                   0.731109         0.479835
             2012                   0.775620         0.613513
...                                      ...              ...
Zimbabwe     2018                   0.844209         0.657524
             2019                   0.830652         0.658434
             2020                   0.788523         0.660658
             2021                   0.756945         0.609917
             2022                   0.752632         0.640609

                   Negative Affect  Confidence In National Government
Country Name Year
Afghanistan  2008         0.258195                           0.612072
             2009         0.237092                           0.611545
             2010         0.275324                           0.299357
             2011         0.267175                           0.307386
             2012         0.267919                           0.435440
...                            ...                                ...
Zimbabwe     2018         0.211726                           0.550508
             2019         0.235354                           0.456455
             2020         0.345736                           0.577302
             2021         0.241682                           0.665703
             2022         0.191350                                NaN

[2199 rows x 11 columns]

In [9]:
data = pd.read_csv('happiness_report.csv', index_col=['Country Name'])
data = data.stack()
data.head()

Country Name
Afghanistan   Regional Indicator    South Asia
              Year                        2008
              Life Ladder              3.72359
              Log GDP Per Capita      7.350416
              Social Support          0.450662
dtype: object

In [14]:
data['Afghanistan']['Year']

Year    2008
Year    2009
Year    2010
Year    2011
Year    2012
Year    2013
Year    2014
Year    2015
Year    2016
Year    2017
Year    2018
Year    2019
Year    2021
Year    2022
dtype: object

In [18]:
data = pd.read_csv('happiness_report.csv')

In [19]:
data = data.set_index(keys = ['Country Name','Year'])

In [22]:
data = data.stack()

In [26]:
data['India'][2009]['Generosity']

-0.027893195

In [27]:
data

Country Name  Year
Afghanistan   2008  Regional Indicator                  South Asia
                    Life Ladder                            3.72359
                    Log GDP Per Capita                    7.350416
                    Social Support                        0.450662
                    Healthy Life Expectancy At Birth          50.5
                                                           ...
Zimbabwe      2022  Freedom To Make Life Choices          0.651987
                    Generosity                           -0.069513
                    Perceptions Of Corruption             0.752632
                    Positive Affect                       0.640609
                    Negative Affect                        0.19135
Length: 23367, dtype: object

In [30]:
data.unstack(level = 1)

Year                                           2005      2006      2007  \
Country Name
Afghanistan  Regional Indicator                 NaN       NaN       NaN
             Life Ladder                        NaN       NaN       NaN
             Log GDP Per Capita                 NaN       NaN       NaN
             Social Support                     NaN       NaN       NaN
             Healthy Life Expectancy At Birth   NaN       NaN       NaN
...                                             ...       ...       ...
Zimbabwe     Generosity                         NaN -0.059926 -0.065477
             Perceptions Of Corruption          NaN  0.904757  0.946287
             Positive Affect                    NaN  0.668662  0.588695
             Negative Affect                    NaN  0.297147  0.264989
             Confidence In National Government  NaN  0.317073  0.225752

Year                                                  2008        2009  \
Country Name
Afghanistan  Regional Indicator                 South Asia  South Asia
             Life Ladder                           3.72359    4.401778
             Log GDP Per Capita                   7.350416    7.508646
             Social Support                       0.450662    0.552308
             Healthy Life Expectancy At Birth         50.5   50.799999
...                                                    ...         ...
Zimbabwe     Generosity                          -0.073042   -0.061252
             Perceptions Of Corruption            0.963846    0.930818
             Positive Affect                      0.570538    0.660173
             Negative Affect                       0.25006    0.218419
             Confidence In National Government    0.181594    0.285287

Year                                                  2010        2011  \
Country Name
Afghanistan  Regional Indicator                 South Asia  South Asia
             Life Ladder                          4.758381    3.831719
             Log GDP Per Capita                     7.6139    7.581259
             Social Support                       0.539075    0.521104
             Healthy Life Expectancy At Birth    51.099998   51.400002
...                                                    ...         ...
Zimbabwe     Generosity                          -0.077651   -0.073153
             Perceptions Of Corruption            0.828361      0.8298
             Positive Affect                      0.699366    0.699491
             Negative Affect                       0.12215    0.210544
             Confidence In National Government    0.471201    0.425926

Year                                                  2012        2013  \
Country Name
Afghanistan  Regional Indicator                 South Asia  South Asia
             Life Ladder                          3.782938      3.5721
             Log GDP Per Capita                   7.660506    7.680333
             Social Support                       0.520637    0.483552
             Healthy Life Expectancy At Birth    51.700001        52.0
...                                                    ...         ...
Zimbabwe     Generosity                          -0.087237   -0.089405
             Perceptions Of Corruption            0.858691    0.830937
             Positive Affect                      0.613298    0.623596
             Negative Affect                      0.177311    0.182288
             Confidence In National Government    0.407084    0.527755

Year                                                  2014        2015  \
Country Name
Afghanistan  Regional Indicator                 South Asia  South Asia
             Life Ladder                          3.130896    3.982855
             Log GDP Per Capita                   7.670638    7.653833
             Social Support                       0.525568    0.528597
             Healthy Life Expectancy At Birth    52.299999   52.599998
...                                                    ...         ...
Zimbabwe     Generosity                          -0.058242   -0.107365
             Perceptions Of Corruption            0.820217    0.810457
             Positive Affect                      0.661307    0.639002
             Negative Affect                      0.239111    0.178861
             Confidence In National Government    0.566209    0.590012

Year                                                  2016        2017  \
Country Name
Afghanistan  Regional Indicator                 South Asia  South Asia
             Life Ladder                          4.220169    2.661718
             Log GDP Per Capita                    7.65037     7.64783
             Social Support                       0.559072     0.49088
             Healthy Life Expectancy At Birth    52.924999       53.25
...                                                    ...         ...
Zimbabwe     Generosity                          -0.078541   -0.080725
             Perceptions Of Corruption            0.723612    0.751208
             Positive Affect                      0.685256    0.733641
             Negative Affect                      0.208555    0.224051
             Confidence In National Government    0.699344    0.682647

Year                                                  2018        2019  \
Country Name
Afghanistan  Regional Indicator                 South Asia  South Asia
             Life Ladder                          2.694303    2.375092
             Log GDP Per Capita                   7.630801    7.640086
             Social Support                       0.507516    0.419973
             Healthy Life Expectancy At Birth    53.575001   53.900002
...                                                    ...         ...
Zimbabwe     Generosity                          -0.051219   -0.047464
             Perceptions Of Corruption            0.844209    0.830652
             Positive Affect                      0.657524    0.658434
             Negative Affect                      0.211726    0.235354
             Confidence In National Government    0.550508    0.456455

Year                                                2020        2021  \
Country Name
Afghanistan  Regional Indicator                      NaN  South Asia
             Life Ladder                             NaN    2.436034
             Log GDP Per Capita                      NaN    7.324032
             Social Support                          NaN    0.454175
             Healthy Life Expectancy At Birth        NaN   54.549999
...                                                  ...         ...
Zimbabwe     Generosity                         0.006313   -0.075575
             Perceptions Of Corruption          0.788523    0.756945
             Positive Affect                    0.660658    0.609917
             Negative Affect                    0.345736    0.241682
             Confidence In National Government  0.577302    0.665703

Year                                                  2022
Country Name
Afghanistan  Regional Indicator                 South Asia
             Life Ladder                          1.281271
             Log GDP Per Capita                        NaN
             Social Support                       0.228217
             Healthy Life Expectancy At Birth       54.875
...                                                    ...
Zimbabwe     Generosity                          -0.069513
             Perceptions Of Corruption            0.752632
             Positive Affect                      0.640609
             Negative Affect                       0.19135
             Confidence In National Government         NaN

[1763 rows x 18 columns]

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('happiness_report.csv')

In [3]:
data = data.set_index(keys = ['Country Name','Year'])

In [4]:
data

                   Regional Indicator  Life Ladder  Log GDP Per Capita  \
Country Name Year
Afghanistan  2008          South Asia     3.723590            7.350416
             2009          South Asia     4.401778            7.508646
             2010          South Asia     4.758381            7.613900
             2011          South Asia     3.831719            7.581259
             2012          South Asia     3.782938            7.660506
...                               ...          ...                 ...
Zimbabwe     2018  Sub-Saharan Africa     3.616480            7.783066
             2019  Sub-Saharan Africa     2.693523            7.697755
             2020  Sub-Saharan Africa     3.159802            7.596050
             2021  Sub-Saharan Africa     3.154578            7.656878
             2022  Sub-Saharan Africa     3.296220            7.670123

                   Social Support  Healthy Life Expectancy At Birth  \
Country Name Year
Afghanistan  2008        0.450662                         50.500000
             2009        0.552308                         50.799999
             2010        0.539075                         51.099998
             2011        0.521104                         51.400002
             2012        0.520637                         51.700001
...                           ...                               ...
Zimbabwe     2018        0.775388                         52.625000
             2019        0.759162                         53.099998
             2020        0.717243                         53.575001
             2021        0.685151                         54.049999
             2022        0.666172                         54.525002

                   Freedom To Make Life Choices  Generosity  \
Country Name Year
Afghanistan  2008                      0.718114    0.167652
             2009                      0.678896    0.190809
             2010                      0.600127    0.121316
             2011                      0.495901    0.163571
             2012                      0.530935    0.237588
...                                         ...         ...
Zimbabwe     2018                      0.762675   -0.051219
             2019                      0.631908   -0.047464
             2020                      0.643303    0.006313
             2021                      0.667636   -0.075575
             2022                      0.651987   -0.069513

                   Perceptions Of Corruption  Positive Affect  \
Country Name Year
Afghanistan  2008                   0.881686         0.414297
             2009                   0.850035         0.481421
             2010                   0.706766         0.516907
             2011                   0.731109         0.479835
             2012                   0.775620         0.613513
...                                      ...              ...
Zimbabwe     2018                   0.844209         0.657524
             2019                   0.830652         0.658434
             2020                   0.788523         0.660658
             2021                   0.756945         0.609917
             2022                   0.752632         0.640609

                   Negative Affect  Confidence In National Government
Country Name Year
Afghanistan  2008         0.258195                           0.612072
             2009         0.237092                           0.611545
             2010         0.275324                           0.299357
             2011         0.267175                           0.307386
             2012         0.267919                           0.435440
...                            ...                                ...
Zimbabwe     2018         0.211726                           0.550508
             2019         0.235354                           0.456455
             2020         0.345736                           0.577302
             2021         0.241682                           0.665703
             2022         0.191350                                NaN

[2199 rows x 11 columns]

In [5]:
data = pd.read_csv('happiness_report.csv')

In [6]:
data

,Country Name,Regional Indicator,Year,Life Ladder,Log GDP Per Capita,Social Support,Healthy Life Expectancy At Birth,Freedom To Make Life Choices,Generosity,Perceptions Of Corruption,Positive Affect,Negative Affect,Confidence In National Government
0,Afghanistan,South Asia,2008,3.723590,7.350416,0.450662,50.500000,0.718114,0.167652,0.881686,0.414297,0.258195,0.612072
1,Afghanistan,South Asia,2009,4.401778,7.508646,0.552308,50.799999,0.678896,0.190809,0.850035,0.481421,0.237092,0.611545
2,Afghanistan,South Asia,2010,4.758381,7.613900,0.539075,51.099998,0.600127,0.121316,0.706766,0.516907,0.275324,0.299357
3,Afghanistan,South Asia,2011,3.831719,7.581259,0.521104,51.400002,0.495901,0.163571,0.731109,0.479835,0.267175,0.307386
4,Afghanistan,South Asia,2012,3.782938,7.660506,0.520637,51.700001,0.530935,0.237588,0.775620,0.613513,0.267919,0.435440
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2194,Zimbabwe,Sub-Saharan Africa,2018,3.616480,7.783066,0.775388,52.625000,0.762675,-0.051219,0.844209,0.657524,0.211726,0.550508
2195,Zimbabwe,Sub-Saharan Africa,2019,2.693523,7.697755,0.759162,53.099998,0.631908,-0.047464,0.830652,0.658434,0.235354,0.456455
2196,Zimbabwe,Sub-Saharan Africa,2020,3.159802,7.596050,0.717243,53.575001,0.643303,0.006313,0.788523,0.660658,0.345736,0.577302
2197,Zimbabwe,Sub-Saharan Africa,2021,3.154578,7.656878,0.685151,54.049999,0.667636,-0.075575,0.756945,0.609917,0.241682,0.665703
2198,Zimbabwe,Sub-Saharan Africa,2022,3.296220,7.670123,0.666172,54.525002,0.651987,-0.069513,0.752632,0.640609,0.191350,NaN

In [7]:
data.pivot(index = 'Year', columns = 'Country Name')

             Regional Indicator                              \
Country Name        Afghanistan                     Albania
Year
2005                        NaN                         NaN
2006                        NaN                         NaN
2007                        NaN  Central and Eastern Europe
2008                 South Asia                         NaN
2009                 South Asia  Central and Eastern Europe
2010                 South Asia  Central and Eastern Europe
2011                 South Asia  Central and Eastern Europe
2012                 South Asia  Central and Eastern Europe
2013                 South Asia  Central and Eastern Europe
2014                 South Asia  Central and Eastern Europe
2015                 South Asia  Central and Eastern Europe
2016                 South Asia  Central and Eastern Europe
2017                 South Asia  Central and Eastern Europe
2018                 South Asia  Central and Eastern Europe
2019                 South Asia  Central and Eastern Europe
2020                        NaN  Central and Eastern Europe
2021                 South Asia  Central and Eastern Europe
2022                 South Asia  Central and Eastern Europe

                                                   \
Country Name                       Algeria Angola
Year
2005                                   NaN    NaN
2006                                   NaN    NaN
2007                                   NaN    NaN
2008                                   NaN    NaN
2009                                   NaN    NaN
2010          Middle East and North Africa    NaN
2011          Middle East and North Africa    NaN
2012          Middle East and North Africa    NaN
2013                                   NaN    NaN
2014          Middle East and North Africa    NaN
2015                                   NaN    NaN
2016          Middle East and North Africa    NaN
2017          Middle East and North Africa    NaN
2018          Middle East and North Africa    NaN
2019          Middle East and North Africa    NaN
2020          Middle East and North Africa    NaN
2021          Middle East and North Africa    NaN
2022                                   NaN    NaN

                                                                               \
Country Name                    Argentina                             Armenia
Year
2005                                  NaN                                 NaN
2006          Latin America and Caribbean  Commonwealth of Independent States
2007          Latin America and Caribbean  Commonwealth of Independent States
2008          Latin America and Caribbean  Commonwealth of Independent States
2009          Latin America and Caribbean  Commonwealth of Independent States
2010          Latin America and Caribbean  Commonwealth of Independent States
2011          Latin America and Caribbean  Commonwealth of Independent States
2012          Latin America and Caribbean  Commonwealth of Independent States
2013          Latin America and Caribbean  Commonwealth of Independent States
2014          Latin America and Caribbean  Commonwealth of Independent States
2015          Latin America and Caribbean  Commonwealth of Independent States
2016          Latin America and Caribbean  Commonwealth of Independent States
2017          Latin America and Caribbean  Commonwealth of Independent States
2018          Latin America and Caribbean  Commonwealth of Independent States
2019          Latin America and Caribbean  Commonwealth of Independent States
2020          Latin America and Caribbean                                 NaN
2021          Latin America and Caribbean  Commonwealth of Independent States
2022          Latin America and Caribbean  Commonwealth of Independent States

                                                     \
Country Name              Australia         Austria
Year
2005          North America and ANZ             NaN
2006                            NaN  Western Europe
2007          North America and ANZ             NaN
2008          North America and ANZ  Western Europe
2009                            NaN             NaN
2010          North America and ANZ  Western Europe
2011          North America and ANZ  Western Europe
2012          North America and ANZ  Western Europe
2013          North America and ANZ  Western Europe
2014          North America and ANZ  Western Europe
2015          North America and ANZ  Western Europe
2016          North America and ANZ  Western Europe
2017          North America and ANZ  Western Europe
2018          North America and ANZ  Western Europe
2019          North America and ANZ  Western Europe
2020          North America and ANZ  Western Europe
2021          North America and ANZ  Western Europe
2022          North America and ANZ  Western Europe

                                                  \
Country Name                          Azerbaijan
Year
2005                                         NaN
2006          Commonwealth of Independent States
2007          Commonwealth of Independent States
2008          Commonwealth of Independent States
2009          Commonwealth of Independent States
2010          Commonwealth of Independent States
2011          Commonwealth of Independent States
2012          Commonwealth of Independent States
2013          Commonwealth of Independent States
2014          Commonwealth of Independent States
2015          Commonwealth of Independent States
2016          Commonwealth of Independent States
2017          Commonwealth of Independent States
2018          Commonwealth of Independent States
2019          Commonwealth of Independent States
2020                                         NaN
2021                                         NaN
2022                                         NaN

                                            ...  \
Country Name                       Bahrain  ...
Year                                        ...
2005                                   NaN  ...
2006                                   NaN  ...
2007                                   NaN  ...
2008                                   NaN  ...
2009          Middle East and North Africa  ...
2010          Middle East and North Africa  ...
2011          Middle East and North Africa  ...
2012          Middle East and North Africa  ...
2013          Middle East and North Africa  ...
2014          Middle East and North Africa  ...
2015          Middle East and North Africa  ...
2016          Middle East and North Africa  ...
2017          Middle East and North Africa  ...
2018                                   NaN  ...
2019          Middle East and North Africa  ...
2020          Middle East and North Africa  ...
2021                                   NaN  ...
2022                                   NaN  ...

             Confidence In National Government                               \
Country Name              United Arab Emirates United Kingdom United States
Year
2005                                       NaN       0.494750           NaN
2006                                       NaN            NaN      0.558029
2007                                       NaN       0.363638      0.393245
2008                                       NaN       0.324166      0.379221
2009                                       NaN       0.384067      0.503047
2010                                       NaN       0.503511      0.418276
2011                                       NaN       0.467890      0.382532
2012                                       NaN       0.421262      0.348856
2013                                       NaN       0.379232      0.288648
2014                                       NaN       0.422672      0.348671
2015                                       NaN       0.456812      0.346936
2016                                       NaN       0.408632      0.297206
2017                                       NaN       0.440121      0.386535
2018                                       NaN       0.420860      0.313816
2019                                       NaN       0.340829      0.362774
2020                                       NaN       0.346973      0.464917
2021                                       NaN       0.394754      0.404625
2022                                       NaN            NaN           NaN

                                                                           \
Country Name   Uruguay Uzbekistan Venezuela   Vietnam     Yemen    Zambia
Year
2005               NaN        NaN  0.491368       NaN       NaN       NaN
2006          0.652354   0.891238  0.630931  0.860486       NaN  0.526590
2007          0.610193        NaN       NaN  0.906148  0.465138  0.404140
2008          0.590952        NaN  0.530698  0.866249       NaN  0.557462
2009          0.655708        NaN  0.487304  0.863494  0.552199  0.413418
2010          0.728630        NaN  0.588830  0.850196  0.520393       NaN
2011          0.631277        NaN  0.518394  0.772131  0.387044  0.397613
2012          0.584287        NaN  0.539273  0.856454  0.598435  0.594114
2013          0.524400        NaN  0.388056  0.811746  0.387677  0.552761
2014          0.595346        NaN  0.202780       NaN  0.344929  0.606339
2015          0.550559   0.973944  0.212657       NaN  0.263297  0.631103
2016          0.423133   0.978045  0.164022       NaN  0.267581  0.696892
2017          0.413032   0.964690  0.241124       NaN  0.247787  0.717004
2018          0.361706   0.969356  0.260700       NaN  0.308151  0.606715
2019          0.551633   0.960945  0.260136       NaN       NaN  0.589811
2020          0.665178   0.898496  0.251202       NaN       NaN  0.589309
2021          0.485831   0.912673  0.175912       NaN       NaN  0.697678
2022               NaN        NaN       NaN       NaN       NaN       NaN


Country Name  Zimbabwe
Year
2005               NaN
2006          0.317073
2007          0.225752
2008          0.181594
2009          0.285287
2010          0.471201
2011          0.425926
2012          0.407084
2013          0.527755
2014          0.566209
2015          0.590012
2016          0.699344
2017          0.682647
2018          0.550508
2019          0.456455
2020          0.577302
2021          0.665703
2022               NaN

[18 rows x 1815 columns]

In [8]:
data.pivot(index = ['Year', 'Country Name'], columns = [])

,,Regional Indicator,Life Ladder,Log GDP Per Capita,Social Support,Healthy Life Expectancy At Birth,Freedom To Make Life Choices,Generosity,Perceptions Of Corruption,Positive Affect,Negative Affect,Confidence In National Government
Year,Country Name,,,,,,,,,,,
2008,Afghanistan,South Asia,3.723590,7.350416,0.450662,50.500000,0.718114,0.167652,0.881686,0.414297,0.258195,0.612072
2009,Afghanistan,South Asia,4.401778,7.508646,0.552308,50.799999,0.678896,0.190809,0.850035,0.481421,0.237092,0.611545
2010,Afghanistan,South Asia,4.758381,7.613900,0.539075,51.099998,0.600127,0.121316,0.706766,0.516907,0.275324,0.299357
2011,Afghanistan,South Asia,3.831719,7.581259,0.521104,51.400002,0.495901,0.163571,0.731109,0.479835,0.267175,0.307386
2012,Afghanistan,South Asia,3.782938,7.660506,0.520637,51.700001,0.530935,0.237588,0.775620,0.613513,0.267919,0.435440
...,...,...,...,...,...,...,...,...,...,...,...,...
2018,Zimbabwe,Sub-Saharan Africa,3.616480,7.783066,0.775388,52.625000,0.762675,-0.051219,0.844209,0.657524,0.211726,0.550508
2019,Zimbabwe,Sub-Saharan Africa,2.693523,7.697755,0.759162,53.099998,0.631908,-0.047464,0.830652,0.658434,0.235354,0.456455
2020,Zimbabwe,Sub-Saharan Africa,3.159802,7.596050,0.717243,53.575001,0.643303,0.006313,0.788523,0.660658,0.345736,0.577302
2021,Zimbabwe,Sub-Saharan Africa,3.154578,7.656878,0.685151,54.049999,0.667636,-0.075575,0.756945,0.609917,0.241682,0.665703
2022,Zimbabwe,Sub-Saharan Africa,3.296220,7.670123,0.666172,54.525002,0.651987,-0.069513,0.752632,0.640609,0.191350,NaN

In [9]:
data.pivot(index = ['Country Name'], columns = ['Year'], values = 'Generosity')

Year,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
Country Name,,,,,,,,,,,,,,,,,,
Afghanistan,NaN,NaN,NaN,0.167652,0.190809,0.121316,0.163571,0.237588,0.062666,0.105755,0.081652,0.043916,-0.119410,-0.091106,-0.106016,NaN,-0.081011,NaN
Albania,NaN,NaN,-0.010429,NaN,-0.159259,-0.173675,-0.206186,-0.170467,-0.128825,-0.026298,-0.082492,-0.018664,-0.030506,0.007197,-0.100910,0.004123,0.041378,-0.065987
Algeria,NaN,NaN,NaN,NaN,NaN,-0.209753,-0.185084,-0.176571,NaN,NaN,NaN,NaN,-0.171471,-0.150559,0.000268,-0.121148,-0.113483,NaN
Angola,NaN,NaN,NaN,NaN,NaN,NaN,0.052619,-0.138630,-0.105992,-0.170031,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Argentina,NaN,-0.159916,-0.144077,-0.134858,-0.132990,-0.129371,-0.177722,-0.151320,-0.133839,-0.167844,-0.177552,-0.195433,-0.189601,-0.214173,-0.214477,-0.128546,-0.012197,-0.127506
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Venezuela,NaN,-0.034787,NaN,-0.229713,-0.121412,-0.160537,-0.232479,-0.198846,-0.227712,-0.188283,-0.085865,-0.056050,0.054434,0.072312,0.128371,NaN,NaN,NaN
Vietnam,NaN,-0.003454,0.071138,0.182484,-0.079961,-0.023855,0.086779,-0.128693,-0.045563,-0.018801,0.066410,-0.109294,NaN,-0.060768,-0.145854,0.065848,0.106941,-0.178987
Yemen,NaN,NaN,0.009045,NaN,-0.052437,-0.103785,-0.170486,-0.168769,-0.175701,-0.162416,-0.135052,-0.140766,-0.124107,-0.123616,-0.102915,NaN,NaN,NaN
Zambia,NaN,-0.008994,-0.069393,0.053855,-0.097342,NaN,0.002038,0.007005,-0.104995,-0.011231,-0.039224,0.122042,0.140128,0.048026,0.077648,0.057657,0.141230,NaN
Zimbabwe,NaN,-0.059926,-0.065477,-0.073042,-0.061252,-0.077651,-0.073153,-0.087237,-0.089405,-0.058242,-0.107365,-0.078541,-0.080725,-0.051219,-0.047464,0.006313,-0.075575,-0.069513

In [10]:
data.pivot(index = ['Country Name'], columns = ['Year'], values = ['Generosity','Social Support'])

             Generosity                                                    \
Year               2005      2006      2007      2008      2009      2010
Country Name
Afghanistan         NaN       NaN       NaN  0.167652  0.190809  0.121316
Albania             NaN       NaN -0.010429       NaN -0.159259 -0.173675
Algeria             NaN       NaN       NaN       NaN       NaN -0.209753
Angola              NaN       NaN       NaN       NaN       NaN       NaN
Argentina           NaN -0.159916 -0.144077 -0.134858 -0.132990 -0.129371
...                 ...       ...       ...       ...       ...       ...
Venezuela           NaN -0.034787       NaN -0.229713 -0.121412 -0.160537
Vietnam             NaN -0.003454  0.071138  0.182484 -0.079961 -0.023855
Yemen               NaN       NaN  0.009045       NaN -0.052437 -0.103785
Zambia              NaN -0.008994 -0.069393  0.053855 -0.097342       NaN
Zimbabwe            NaN -0.059926 -0.065477 -0.073042 -0.061252 -0.077651

                                                      ... Social Support  \
Year              2011      2012      2013      2014  ...           2013
Country Name                                          ...
Afghanistan   0.163571  0.237588  0.062666  0.105755  ...       0.483552
Albania      -0.206186 -0.170467 -0.128825 -0.026298  ...       0.759477
Algeria      -0.185084 -0.176571       NaN       NaN  ...            NaN
Angola        0.052619 -0.138630 -0.105992 -0.170031  ...       0.721591
Argentina    -0.177722 -0.151320 -0.133839 -0.167844  ...       0.909874
...                ...       ...       ...       ...  ...            ...
Venezuela    -0.232479 -0.198846 -0.227712 -0.188283  ...       0.896301
Vietnam       0.086779 -0.128693 -0.045563 -0.018801  ...       0.759477
Yemen        -0.170486 -0.168769 -0.175701 -0.162416  ...       0.693905
Zambia        0.002038  0.007005 -0.104995 -0.011231  ...       0.761312
Zimbabwe     -0.073153 -0.087237 -0.089405 -0.058242  ...       0.799274

                                                                          \
Year              2014      2015      2016      2017      2018      2019
Country Name
Afghanistan   0.525568  0.528597  0.559072  0.490880  0.507516  0.419973
Albania       0.625587  0.639356  0.638411  0.637698  0.683592  0.686365
Algeria       0.818189       NaN  0.748588  0.806754  0.798651  0.803259
Angola        0.754615       NaN       NaN       NaN       NaN       NaN
Argentina     0.917870  0.926492  0.882819  0.906699  0.899912  0.896371
...                ...       ...       ...       ...       ...       ...
Venezuela     0.903956  0.911087  0.901949  0.895879  0.886882  0.887672
Vietnam       0.792168  0.848677  0.876324       NaN  0.831945  0.847592
Yemen         0.638252  0.668683  0.775407  0.789555  0.789422  0.870043
Zambia        0.706223  0.691483  0.767047  0.743754  0.717720  0.637894
Zimbabwe      0.765839  0.735800  0.768425  0.754147  0.775388  0.759162


Year              2020      2021      2022
Country Name
Afghanistan        NaN  0.454175  0.228217
Albania       0.710115  0.701883  0.724090
Algeria       0.867649  0.840710       NaN
Angola             NaN       NaN       NaN
Argentina     0.897104  0.882305  0.893330
...                ...       ...       ...
Venezuela     0.805224  0.812418  0.899366
Vietnam       0.764510  0.799494  0.878744
Yemen              NaN       NaN       NaN
Zambia        0.766872  0.619071       NaN
Zimbabwe      0.717243  0.685151  0.666172

[165 rows x 36 columns]

In [11]:
data = pd.read_csv('happiness_report.csv')

In [12]:
data

,Country Name,Regional Indicator,Year,Life Ladder,Log GDP Per Capita,Social Support,Healthy Life Expectancy At Birth,Freedom To Make Life Choices,Generosity,Perceptions Of Corruption,Positive Affect,Negative Affect,Confidence In National Government
0,Afghanistan,South Asia,2008,3.723590,7.350416,0.450662,50.500000,0.718114,0.167652,0.881686,0.414297,0.258195,0.612072
1,Afghanistan,South Asia,2009,4.401778,7.508646,0.552308,50.799999,0.678896,0.190809,0.850035,0.481421,0.237092,0.611545
2,Afghanistan,South Asia,2010,4.758381,7.613900,0.539075,51.099998,0.600127,0.121316,0.706766,0.516907,0.275324,0.299357
3,Afghanistan,South Asia,2011,3.831719,7.581259,0.521104,51.400002,0.495901,0.163571,0.731109,0.479835,0.267175,0.307386
4,Afghanistan,South Asia,2012,3.782938,7.660506,0.520637,51.700001,0.530935,0.237588,0.775620,0.613513,0.267919,0.435440
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2194,Zimbabwe,Sub-Saharan Africa,2018,3.616480,7.783066,0.775388,52.625000,0.762675,-0.051219,0.844209,0.657524,0.211726,0.550508
2195,Zimbabwe,Sub-Saharan Africa,2019,2.693523,7.697755,0.759162,53.099998,0.631908,-0.047464,0.830652,0.658434,0.235354,0.456455
2196,Zimbabwe,Sub-Saharan Africa,2020,3.159802,7.596050,0.717243,53.575001,0.643303,0.006313,0.788523,0.660658,0.345736,0.577302
2197,Zimbabwe,Sub-Saharan Africa,2021,3.154578,7.656878,0.685151,54.049999,0.667636,-0.075575,0.756945,0.609917,0.241682,0.665703
2198,Zimbabwe,Sub-Saharan Africa,2022,3.296220,7.670123,0.666172,54.525002,0.651987,-0.069513,0.752632,0.640609,0.191350,NaN

In [13]:
data.melt()

                                variable        value
0                           Country Name  Afghanistan
1                           Country Name  Afghanistan
2                           Country Name  Afghanistan
3                           Country Name  Afghanistan
4                           Country Name  Afghanistan
...                                  ...          ...
28582  Confidence In National Government     0.550508
28583  Confidence In National Government     0.456455
28584  Confidence In National Government     0.577302
28585  Confidence In National Government     0.665703
28586  Confidence In National Government          NaN

[28587 rows x 2 columns]

In [14]:
data.melt(id_vars = "Country Name")

      Country Name                           variable       value
0      Afghanistan                 Regional Indicator  South Asia
1      Afghanistan                 Regional Indicator  South Asia
2      Afghanistan                 Regional Indicator  South Asia
3      Afghanistan                 Regional Indicator  South Asia
4      Afghanistan                 Regional Indicator  South Asia
...            ...                                ...         ...
26383     Zimbabwe  Confidence In National Government    0.550508
26384     Zimbabwe  Confidence In National Government    0.456455
26385     Zimbabwe  Confidence In National Government    0.577302
26386     Zimbabwe  Confidence In National Government    0.665703
26387     Zimbabwe  Confidence In National Government         NaN

[26388 rows x 3 columns]

In [16]:
data.melt(id_vars = "Country Name", var_name = "Metric", value_name = "Value")

      Country Name                             Metric       Value
0      Afghanistan                 Regional Indicator  South Asia
1      Afghanistan                 Regional Indicator  South Asia
2      Afghanistan                 Regional Indicator  South Asia
3      Afghanistan                 Regional Indicator  South Asia
4      Afghanistan                 Regional Indicator  South Asia
...            ...                                ...         ...
26383     Zimbabwe  Confidence In National Government    0.550508
26384     Zimbabwe  Confidence In National Government    0.456455
26385     Zimbabwe  Confidence In National Government    0.577302
26386     Zimbabwe  Confidence In National Government    0.665703
26387     Zimbabwe  Confidence In National Government         NaN

[26388 rows x 3 columns]

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('happiness_report.csv')

In [3]:
data = data.set_index(keys = ['Country Name','Year'])

In [4]:
data

                   Regional Indicator  Life Ladder  Log GDP Per Capita  \
Country Name Year
Afghanistan  2008          South Asia     3.723590            7.350416
             2009          South Asia     4.401778            7.508646
             2010          South Asia     4.758381            7.613900
             2011          South Asia     3.831719            7.581259
             2012          South Asia     3.782938            7.660506
...                               ...          ...                 ...
Zimbabwe     2018  Sub-Saharan Africa     3.616480            7.783066
             2019  Sub-Saharan Africa     2.693523            7.697755
             2020  Sub-Saharan Africa     3.159802            7.596050
             2021  Sub-Saharan Africa     3.154578            7.656878
             2022  Sub-Saharan Africa     3.296220            7.670123

                   Social Support  Healthy Life Expectancy At Birth  \
Country Name Year
Afghanistan  2008        0.450662                         50.500000
             2009        0.552308                         50.799999
             2010        0.539075                         51.099998
             2011        0.521104                         51.400002
             2012        0.520637                         51.700001
...                           ...                               ...
Zimbabwe     2018        0.775388                         52.625000
             2019        0.759162                         53.099998
             2020        0.717243                         53.575001
             2021        0.685151                         54.049999
             2022        0.666172                         54.525002

                   Freedom To Make Life Choices  Generosity  \
Country Name Year
Afghanistan  2008                      0.718114    0.167652
             2009                      0.678896    0.190809
             2010                      0.600127    0.121316
             2011                      0.495901    0.163571
             2012                      0.530935    0.237588
...                                         ...         ...
Zimbabwe     2018                      0.762675   -0.051219
             2019                      0.631908   -0.047464
             2020                      0.643303    0.006313
             2021                      0.667636   -0.075575
             2022                      0.651987   -0.069513

                   Perceptions Of Corruption  Positive Affect  \
Country Name Year
Afghanistan  2008                   0.881686         0.414297
             2009                   0.850035         0.481421
             2010                   0.706766         0.516907
             2011                   0.731109         0.479835
             2012                   0.775620         0.613513
...                                      ...              ...
Zimbabwe     2018                   0.844209         0.657524
             2019                   0.830652         0.658434
             2020                   0.788523         0.660658
             2021                   0.756945         0.609917
             2022                   0.752632         0.640609

                   Negative Affect  Confidence In National Government
Country Name Year
Afghanistan  2008         0.258195                           0.612072
             2009         0.237092                           0.611545
             2010         0.275324                           0.299357
             2011         0.267175                           0.307386
             2012         0.267919                           0.435440
...                            ...                                ...
Zimbabwe     2018         0.211726                           0.550508
             2019         0.235354                           0.456455
             2020         0.345736                           0.577302
             2021         0.241682                           0.665703
             2022         0.191350                                NaN

[2199 rows x 11 columns]

In [5]:
data.pivot_table(values = "Generosity", index = "Country Name")

              Generosity
Country Name
Afghanistan     0.059799
Albania        -0.074733
Algeria        -0.140975
Angola         -0.090508
Argentina      -0.152436
...                  ...
Venezuela      -0.098505
Vietnam        -0.013477
Yemen          -0.120917
Zambia          0.021230
Zimbabwe       -0.067616

[162 rows x 1 columns]

In [6]:
data.pivot_table(values = "Generosity", index = "Country Name", aggfunc = "sum")

              Generosity
Country Name
Afghanistan     0.777382
Albania        -1.120999
Algeria        -1.127801
Angola         -0.362033
Argentina      -2.591420
...                  ...
Venezuela      -1.280566
Vietnam        -0.215629
Yemen          -1.451005
Zambia          0.318449
Zimbabwe       -1.149473

[165 rows x 1 columns]

In [8]:
data.pivot_table(values = "Generosity", index = ["Country Name", "Year"])

                   Generosity
Country Name Year
Afghanistan  2008    0.167652
             2009    0.190809
             2010    0.121316
             2011    0.163571
             2012    0.237588
...                       ...
Zimbabwe     2018   -0.051219
             2019   -0.047464
             2020    0.006313
             2021   -0.075575
             2022   -0.069513

[2126 rows x 1 columns]

In [9]:
data.pivot_table(values = ["Generosity", "Social Support", "Life Ladder"], index = ["Country Name", "Year"])

                   Generosity  Life Ladder  Social Support
Country Name Year
Afghanistan  2008    0.167652     3.723590        0.450662
             2009    0.190809     4.401778        0.552308
             2010    0.121316     4.758381        0.539075
             2011    0.163571     3.831719        0.521104
             2012    0.237588     3.782938        0.520637
...                       ...          ...             ...
Zimbabwe     2018   -0.051219     3.616480        0.775388
             2019   -0.047464     2.693523        0.759162
             2020    0.006313     3.159802        0.717243
             2021   -0.075575     3.154578        0.685151
             2022   -0.069513     3.296220        0.666172

[2199 rows x 3 columns]

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('happiness_report.csv')

In [3]:
data

,Country Name,Regional Indicator,Year,Life Ladder,Log GDP Per Capita,Social Support,Healthy Life Expectancy At Birth,Freedom To Make Life Choices,Generosity,Perceptions Of Corruption,Positive Affect,Negative Affect,Confidence In National Government
0,Afghanistan,South Asia,2008,3.723590,7.350416,0.450662,50.500000,0.718114,0.167652,0.881686,0.414297,0.258195,0.612072
1,Afghanistan,South Asia,2009,4.401778,7.508646,0.552308,50.799999,0.678896,0.190809,0.850035,0.481421,0.237092,0.611545
2,Afghanistan,South Asia,2010,4.758381,7.613900,0.539075,51.099998,0.600127,0.121316,0.706766,0.516907,0.275324,0.299357
3,Afghanistan,South Asia,2011,3.831719,7.581259,0.521104,51.400002,0.495901,0.163571,0.731109,0.479835,0.267175,0.307386
4,Afghanistan,South Asia,2012,3.782938,7.660506,0.520637,51.700001,0.530935,0.237588,0.775620,0.613513,0.267919,0.435440
...,...,...,...,...,...,...,...,...,...,...,...,...,...
2194,Zimbabwe,Sub-Saharan Africa,2018,3.616480,7.783066,0.775388,52.625000,0.762675,-0.051219,0.844209,0.657524,0.211726,0.550508
2195,Zimbabwe,Sub-Saharan Africa,2019,2.693523,7.697755,0.759162,53.099998,0.631908,-0.047464,0.830652,0.658434,0.235354,0.456455
2196,Zimbabwe,Sub-Saharan Africa,2020,3.159802,7.596050,0.717243,53.575001,0.643303,0.006313,0.788523,0.660658,0.345736,0.577302
2197,Zimbabwe,Sub-Saharan Africa,2021,3.154578,7.656878,0.685151,54.049999,0.667636,-0.075575,0.756945,0.609917,0.241682,0.665703
2198,Zimbabwe,Sub-Saharan Africa,2022,3.296220,7.670123,0.666172,54.525002,0.651987,-0.069513,0.752632,0.640609,0.191350,NaN

In [4]:
data.head(20)

,Country Name,Regional Indicator,Year,Life Ladder,Log GDP Per Capita,Social Support,Healthy Life Expectancy At Birth,Freedom To Make Life Choices,Generosity,Perceptions Of Corruption,Positive Affect,Negative Affect,Confidence In National Government
0,Afghanistan,South Asia,2008,3.723590,7.350416,0.450662,50.500000,0.718114,0.167652,0.881686,0.414297,0.258195,0.612072
1,Afghanistan,South Asia,2009,4.401778,7.508646,0.552308,50.799999,0.678896,0.190809,0.850035,0.481421,0.237092,0.611545
2,Afghanistan,South Asia,2010,4.758381,7.613900,0.539075,51.099998,0.600127,0.121316,0.706766,0.516907,0.275324,0.299357
3,Afghanistan,South Asia,2011,3.831719,7.581259,0.521104,51.400002,0.495901,0.163571,0.731109,0.479835,0.267175,0.307386
4,Afghanistan,South Asia,2012,3.782938,7.660506,0.520637,51.700001,0.530935,0.237588,0.775620,0.613513,0.267919,0.435440
5,Afghanistan,South Asia,2013,3.572100,7.680333,0.483552,52.000000,0.577955,0.062666,0.823204,0.547417,0.273328,0.482847
6,Afghanistan,South Asia,2014,3.130896,7.670638,0.525568,52.299999,0.508514,0.105755,0.871242,0.491641,0.374861,0.409048
7,Afghanistan,South Asia,2015,3.982855,7.653833,0.528597,52.599998,0.388928,0.081652,0.880638,0.491410,0.339276,0.260557
8,Afghanistan,South Asia,2016,4.220169,7.650370,0.559072,52.924999,0.522566,0.043916,0.793246,0.501409,0.348332,0.324990
9,Afghanistan,South Asia,2017,2.661718,7.647830,0.490880,53.250000,0.427011,-0.119410,0.954393,0.435270,0.371326,0.261179
10,Afghanistan,South Asia,2018,2.694303,7.630801,0.507516,53.575001,0.373536,-0.091106,0.927606,0.384561,0.404904,0.364666
11,Afghanistan,South Asia,2019,2.375092,7.640086,0.419973,53.900002,0.393656,-0.106016,0.923849,0.324108,0.502474,0.341482
12,Afghanistan,South Asia,2021,2.436034,7.324032,0.454175,54.549999,0.394306,-0.081011,0.946299,0.178886,0.606713,0.255620
13,Afghanistan,South Asia,2022,1.281271,NaN,0.228217,54.875000,0.368377,NaN,0.733198,0.205868,0.575512,NaN
14,Albania,Central and Eastern Europe,2007,4.634252,9.121704,0.821372,66.760002,0.528605,-0.010429,0.874700,0.488819,0.246335,0.300681
15,Albania,Central and Eastern Europe,2009,5.485470,9.241429,0.833047,67.320000,0.525223,-0.159259,0.863665,0.564474,0.279257,NaN
16,Albania,Central and Eastern Europe,2010,5.268937,9.282793,0.733152,67.599998,0.568958,-0.173675,0.726262,0.576077,0.300060,NaN
17,Albania,Central and Eastern Europe,2011,5.867422,9.310619,0.759434,67.879997,0.487496,-0.206186,0.877003,0.565759,0.256577,NaN
18,Albania,Central and Eastern Europe,2012,5.510124,9.326344,0.784502,68.160004,0.601512,-0.170467,0.847675,0.553473,0.271393,0.364894
19,Albania,Central and Eastern Europe,2013,4.550648,9.338146,0.759477,68.440002,0.631830,-0.128825,0.862905,0.540751,0.338379,0.338095

In [5]:
countries = data.groupby("Country Name")

In [6]:
countries

In [7]:
len(countries)

165

In [8]:
countries.get_group("India")

,Country Name,Regional Indicator,Year,Life Ladder,Log GDP Per Capita,Social Support,Healthy Life Expectancy At Birth,Freedom To Make Life Choices,Generosity,Perceptions Of Corruption,Positive Affect,Negative Affect,Confidence In National Government
831,India,South Asia,2006,5.348259,8.141137,0.707318,55.860001,0.773737,NaN,0.854812,0.576096,0.198602,0.649276
832,India,South Asia,2007,5.026793,8.200289,0.568993,56.220001,0.728893,-0.053104,0.862143,0.541330,0.252502,0.817412
833,India,South Asia,2008,5.145833,8.216465,0.683593,56.580002,0.755840,-0.073802,0.891188,0.572614,0.259315,0.616265
834,India,South Asia,2009,4.521518,8.278234,0.652852,56.939999,0.678644,-0.027893,0.894611,0.638586,0.300621,0.698452
835,India,South Asia,2010,4.989277,8.346016,0.604810,57.299999,0.783060,0.055902,0.862548,0.579225,0.266502,0.667365
836,India,South Asia,2011,4.634871,8.383487,0.552593,57.660000,0.837552,-0.039747,0.907794,0.479760,0.231594,0.580354
837,India,South Asia,2012,4.720147,8.423292,0.510575,58.020000,0.609320,0.065380,0.829615,0.543507,0.294841,0.539207
838,India,South Asia,2013,4.427789,8.472221,0.552826,58.380001,0.740177,0.082349,0.832356,0.608283,0.330437,0.532655
839,India,South Asia,2014,4.424379,8.531302,0.621467,58.740002,0.809383,-0.027681,0.832142,0.651043,0.284582,0.733619
840,India,South Asia,2015,4.342079,8.596351,0.610133,59.099998,0.777225,-0.007035,0.776435,0.657201,0.321829,0.694717
841,India,South Asia,2016,4.179177,8.663832,0.613529,59.400002,0.820069,0.044032,0.764722,0.645889,0.345681,0.732105
842,India,South Asia,2017,4.046111,8.718020,0.606767,59.700001,0.885850,-0.043519,0.780803,0.578831,0.317937,0.839278
843,India,South Asia,2018,3.818069,8.769687,0.638052,60.000000,0.890443,0.082798,0.805263,0.590560,0.357458,0.753281
844,India,South Asia,2019,3.248770,8.796131,0.560781,60.299999,0.875540,0.110720,0.751979,0.560403,0.466336,0.789703
845,India,South Asia,2020,4.223866,8.718342,0.616412,60.599998,0.906416,0.071108,0.780127,0.686477,0.383293,0.798643
846,India,South Asia,2021,3.558254,8.793618,0.569733,60.900002,0.866111,0.055863,0.756820,0.547308,0.429138,0.785475
847,India,South Asia,2022,3.929816,8.849925,0.608045,61.200001,0.893131,0.089502,0.770742,0.596355,0.432264,NaN

In [9]:
countries.get_group("India").max()

Country Name                              India
Regional Indicator                   South Asia
Year                                       2022
Life Ladder                            5.348259
Log GDP Per Capita                     8.849925
Social Support                         0.707318
Healthy Life Expectancy At Birth      61.200001
Freedom To Make Life Choices           0.906416
Generosity                              0.11072
Perceptions Of Corruption              0.907794
Positive Affect                        0.686477
Negative Affect                        0.466336
Confidence In National Government      0.839278
dtype: object

In [10]:
countries.get_group("India").min()

Country Name                              India
Regional Indicator                   South Asia
Year                                       2006
Life Ladder                             3.24877
Log GDP Per Capita                     8.141137
Social Support                         0.510575
Healthy Life Expectancy At Birth      55.860001
Freedom To Make Life Choices            0.60932
Generosity                            -0.073802
Perceptions Of Corruption              0.751979
Positive Affect                         0.47976
Negative Affect                        0.198602
Confidence In National Government      0.532655
dtype: object

In [11]:
countries.max()

,Regional Indicator,Year,Life Ladder,Log GDP Per Capita,Social Support,Healthy Life Expectancy At Birth,Freedom To Make Life Choices,Generosity,Perceptions Of Corruption,Positive Affect,Negative Affect,Confidence In National Government
Country Name,,,,,,,,,,,,
Afghanistan,South Asia,2022,4.758381,7.680333,0.559072,54.875000,0.718114,0.237588,0.954393,0.613513,0.606713,0.612072
Albania,Central and Eastern Europe,2022,5.867422,9.626483,0.833047,69.175003,0.827453,0.041378,0.914284,0.592045,0.350427,0.506978
Algeria,Middle East and North Africa,2021,6.354898,9.383312,0.867649,66.599998,0.592696,0.000268,0.758704,0.565026,0.377112,NaN
Angola,NaN,2014,5.589001,9.009897,0.754615,53.080002,0.583702,0.052619,0.911320,0.666833,0.370875,0.572346
Argentina,Latin America and Caribbean,2022,6.775805,10.112436,0.938463,67.250000,0.881224,-0.012197,0.884742,0.769468,0.345132,0.607538
...,...,...,...,...,...,...,...,...,...,...,...,...
Venezuela,Latin America and Caribbean,2022,7.478455,9.862485,0.955278,65.500000,0.838198,0.128371,0.890125,0.847400,0.396250,0.630931
Vietnam,Southeast Asia,2022,6.266509,9.332854,0.897655,65.599998,0.975405,0.182484,0.837870,0.774236,0.286374,0.906148
Yemen,Middle East and North Africa,2019,4.809259,8.413556,0.870043,58.720001,0.705815,0.009045,0.885429,0.526577,0.378784,0.598435
Zambia,Sub-Saharan Africa,2021,5.260361,8.139133,0.864023,55.250000,0.832574,0.141230,0.947914,0.770685,0.394385,0.717004
Zimbabwe,Sub-Saharan Africa,2022,4.955101,7.783066,0.896476,54.525002,0.762675,0.006313,0.963846,0.733641,0.345736,0.699344

In [12]:
countries['Generosity'].mean()

Country Name
Afghanistan    0.059799
Albania       -0.074733
Algeria       -0.140975
Angola        -0.090508
Argentina     -0.152436
                 ...
Venezuela     -0.098505
Vietnam       -0.013477
Yemen         -0.120917
Zambia         0.021230
Zimbabwe      -0.067616
Name: Generosity, Length: 165, dtype: float64

In [13]:
countries['Generosity'].mean().sort_values()

Country Name
Greece              -0.277875
Georgia             -0.249699
Lithuania           -0.235710
Morocco             -0.221665
Russia              -0.205973
                       ...
Indonesia            0.418940
Myanmar              0.611992
Cuba                      NaN
Somaliland region         NaN
South Sudan               NaN
Name: Generosity, Length: 165, dtype: float64

In [1]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

In [2]:
data = pd.read_csv('happiness_report.csv')

In [3]:
df1 = DataFrame({'fruit':['apple', 'orange', 'banana', 'peach'], 'prices 2023':[10,20,30,40]})

In [4]:
df2 = DataFrame({'fruit':['apple', 'orange','mango'], 'prices 2024':[12,33,35]})

In [5]:
df1

    fruit  prices 2023
0   apple           10
1  orange           20
2  banana           30
3   peach           40

In [6]:
df2

    fruit  prices 2024
0   apple           12
1  orange           33
2   mango           35

In [8]:
pd.merge(df1, df2, how="outer")

    fruit  prices 2023  prices 2024
0   apple         10.0         12.0
1  banana         30.0          NaN
2   mango          NaN         35.0
3  orange         20.0         33.0
4   peach         40.0          NaN